Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter005/level002/po/*.po
Languages: cs

source: Mover 2
cs: Přeprava 2

source: Retrieve several titanium cubes.
cs: Přivezte několik kostek titanu.

source: Mover
cs: Preprava

source: Exercise
cs: Cvičení

source: This exercise is very similar to the previous one. There are now three <a object|titan>titanium cubes</a> that you must move to 3 finishing pads. Here are the coordinates of the finishing pads:
cs: Toto cvičení je velmi podobné jako to předchozí. Tentokrát musíte odvézt tři <a object|titan>kostky titanu</a> na tři cílové značky. Zde jsou souřadnice cílových značek:

source: General principle
cs: Obecný postup

source: Look for the most distant titanium cube with <code><a cbot|radar>radar</a></code>.
cs: Najít nejvzdálenější kostku titanu příkazem <code><a cbot|radar>radar</a></code>.

source: Pick it up with <code><a cbot|grab>grab</a></code>.
cs: Zvednout ji příkazem <code><a cbot|grab>grab</a></code>.

source: Go to one of the pads with <code><a cbot|goto>goto</a></code>.
cs: Dojet k jedné z cílových značek příkazem <code><a cbot|goto>goto</a></code>.

source: Drop the titanium with <code><a cbot|drop>drop</a></code>.
cs: Položit titan příkazem <code><a cbot|drop>drop</a></code>.

source: If you look for the nearest titanium cube, the radar would find one that you already retrieved and dropped on a pad. Therefore you must look for the most distant titanium cube.
cs: Pokud byste hledali nejbližší kostku titanu, radar najde tu, kterou už jste přivezli a položili na značku. Proto musíte hledat nejvzdálenější kostku titanu.

source: The program
cs: Program

source: Use a <code><a cbot|for>for</a></code> loop in order to repeat 3 times all the instructions necessary to retrieve the titanium cube. Inside the loop, in order to find the most distant titanium cube, use the instruction <c/><a cbot|radar>radar</a>(Titanium, 0, 360, 0, 1000, -1);<n/>. The last value <code>-1</code> means that instead of looking for the closest item, the radar will return the most distant that it can find.
cs: Všechny příkazy pro přivezení kostky titanu opakujte třikrát pomocí cyklu <code><a cbot|for>for</a></code>. Uvnitř cyklu hledejte nejvzdálenější kostku titanu příkazem <c/><a cbot|radar>radar</a>(Titanium, 0, 360, 0, 1000, -1);<n/>. Poslední hodnota <code>-1</code> znamená, že radar má místo nejbližšího objektu hledat ten nejvzdálenější.

source: The variable <code>metal</code> if of type <code><a cbot|object>object</a></code>. In order to know the position of the object described by the variable, you must write <code>metal.position</code>.
cs: Proměnná <code>metal</code> je typu <code><a cbot|object>object</a></code>. Polohu objektu popsaného touto proměnnou zjistíte výrazem <code>metal.position</code>.

source: The <code>x</code> coordinates of the 3 pads are all equal to 10. The <code>y</code> coordinates are respectively -60, -65 and -70. The most efficient way to get the coordinates of the pads is to use the value of <code>i</code> of the <code>for</code> loop that will take successively the values 0, 1 and 2:
cs: Všechny cílové značky mají souřadnici <code>x</code> rovnu 10. Souřadnice <code>y</code> mají hodnoty -60, -65 a -70. Nejpohodlnější způsob, jak získat souřadnice další cílové značky, je využít řídící proměnnou <code>for</code> cyklu "<code>i</code>", která bude v jednotlivých opakováních cyklu postupně nabývat hodnot 0, 1 a 2:

source: It is up to you now to finish the program.
cs: Dopsat zbytek programu už je na Vás.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Repeat 3 times:
cs: Opakovat třikrát:
