Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter002/level007/po/*.po
Languages: cs

source: Wasp Hunter 2
cs: Lovec vos 2

source: Get better at shooting down the wasps.
cs: Naučte se lépe střílet na vosy.

source: Wasp2
cs: Vosa2

source: Objective
cs: Úkol

source: Bring down the flying wasps in a more efficient way than with the previous program.
cs: Napište efektivnější program na likvidaci létajících vos než byl ten předchozí.

source: Here is again the program of the previous exercise that shoots down all the wasps after many, many unsuccessful attempts:
cs: Zde je opět program z předchozího cvičení, který po spoustě neúspěšných pokusů nakonec sestřelí všechny vosy:

source: extern void object::Wasp1() { <a cbot|type>object</a> item; <a cbot|aim>aim</a>(0); <a cbot|while>while</a> (true) { <a cbot|while>while</a> (<a cbot|radar>radar</a>(AlienWasp, 0, 360, 0, 20) == null) { item = <a cbot|radar>radar</a>(AlienWasp); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|motor>motor</a>(1,1); <a cbot|jet>jet</a>(0); <a cbot|if>if</a> (position.z > item.position.z) { <a cbot|jet>jet</a>(-0.3); } <a cbot|if>if</a> (position.z < item.position.z - 1) { <a cbot|jet>jet</a>(0.3); } <a cbot|wait>wait</a>(0.2); } item = <a cbot|radar>radar</a>(AlienWasp); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|fire>fire</a>(1); } }
cs: extern void object::Vosa1() { <a cbot|type>object</a> item; <a cbot|aim>aim</a>(0); <a cbot|while>while</a> (true) { <a cbot|while>while</a> (<a cbot|radar>radar</a>(AlienWasp, 0, 360, 0, 20) == null) { item = <a cbot|radar>radar</a>(AlienWasp); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|motor>motor</a>(1,1); <a cbot|jet>jet</a>(0); <a cbot|if>if</a> (position.z > item.position.z) { <a cbot|jet>jet</a>(-0.3); } <a cbot|if>if</a> (position.z < item.position.z - 1) { <a cbot|jet>jet</a>(0.3); } <a cbot|wait>wait</a>(0.2); } item = <a cbot|radar>radar</a>(AlienWasp); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|fire>fire</a>(1); } }

source: The many failures are due to the fact that the wasp is already gone before the bullets can reach it. The only way to improve the program consists in setting the power of the two motors and of the jet in such a way that the bot follows the movement of the target during the burst.
cs: Robot se často nedokáže trefit, protože vosa stihne uletět pryč, než ji střela zasáhne. Tomu lze zabránit jedině tak, že budete přímo ovládat výkon všech motorů, aby robot během palby stále držel cíl na mušce.

source: Just before the shot, the program adjusts a last time the direction with <c/>turn(direction(item.position));<n/>. In order to follow the wasp during the burst, you have to "remember" the angle of this last rotation: if the angle was positive (rotation to the left), the bot must continue to turn left during the burst; if the angle was negative, the bot must continue to turn right.
cs: Robot těsně před výstřelem ještě naposledy upraví směr příkazem <c/>turn(direction(item.position));<n/>. Abyste mohli během palby držet vosu na mušce, musíte si tento úhel "zapamatovat": pokud byl úhel kladný (otočení doleva), robot musí během palby dále točit doleva, pokud byl záporný, robot musí dále točit doprava.

source: In order to "remember" the angle of the last rotation, we need a variable that can contain just one number. If we choose to call it <code>angle</code>, we must define the variable with the following line at the beginning of the program:
cs: Na "zapamatování" daného úhlu potřebujeme proměnnou, do které lze uložit jedno číslo. Když ji nazveme <code>angle</code>, musíme ji na začátku programu deklarovat následujícím řádkem kódu:

source: The variable type <a cbot|type>float</a> is the variable type that can contain any number, i.e. whole numbers or real numbers. Please refer to the <a cbot|type>text about variable types</a> if you want to know more about the different types of variables and what they can contain.
cs: Proměnná typu <a cbot|type>float</a> může obsahovat libovolné číslo, t.j. celá čísla nebo reálná čísla. Pokud se chcete dozvědět více o různých typech proměnných a co mohou obsahovat, přečtěte si <a cbot|type>popis datových typů</a>.

source: Just before the instruction <c/>fire(1);<n/>, instead of writing <c/><a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position));<n/>, we will put the rotation angle into the variable <code>angle</code>:
cs: Těsně před příkazem <c/>fire(1);<n/> místo příkazu <c/><a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position));<n/> uložíme úhel pro otočení do proměnné <code>angle</code>:

source: Then we perform the rotation, and we set the power of the motors so that the bot continues the movement:
cs: Pak robota otočíme a nastavíme výkon motorů, aby robot zatáčel dále:

source: The instruction <code>else</code> determines what instructions the program should execute if the condition stated in the <code>if</code> instruction is false.
cs: Příkaz <code>else</code> označuje blok, který se provede v případě, když podmínka v příkazu <code>if</code> neplatí.

source: Then we must set the power of the jet so that the bot follows the wasp also in the vertical direction:
cs: Nakonec musíme nastavit i výkon tryskového motoru, aby robot udržoval stejnou letovou výšku jako vosa:

source: As you will see, this program is much more efficient than the previous one!
cs: Uvidíte, že tento programu bude mnohem úspěšnější než ten předchozí!

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
