Repository: badernageral/colobot-data
Catalog: levels/missions/chapter001/level001/po/*.po
Languages: cs

source: Equipment
cs: Vybavení

source: Prepare yourself to embark on mankind's most thrilling adventure yet.
cs: Připravte se vyrazit na nejdobrodružnější výpravu v dějinách lidstva.

source: From the NASA Training Center
cs: Zpráva z výcvikového střediska NASA

source: We are pleased to inform you that you have been selected for the space exploration mission Colobot.
cs: S radostí Vám oznamujeme, že jste byli vybráni na vesmírnou průzkumnou misi Colobot.

source: Your psychological profile has been established as more than 98.84% favorable, and your aptitude during the extensive testing period was undeniable. The detailed results are at your disposal in the central computer under the registration number that was assigned to you.
cs: Váš psychologický profil vyhovuje z 98,84 % a během dlouhých a náročných zkoušek jste prokázali neobyčejnou zdatnost. Podrobné výsledky máte k dispozici v centrálním počítači pod Vaším osobním číslem.

source: Please report to the <a object|Huston>Houston Mission Control</a> for further directives about your forthcoming mission.
cs: Hlaste se prosím v <a object|huston>řídícím středisku Houston</a> pro další rozkazy ohledně Vaší nadcházející mise.

source: From Houston Mission Control
cs: Zpráva z řídícího střediska Houston

source: As you know, Earth is heading towards imminent disaster, due to increasing atmospheric pollution.
cs: Jak jistě víte, Zemi hrozí důsledkem znečištění ovzduší neodvratná katastrofa.

source: <a object|human>Your</a> mission consists of exploring neighboring galaxies with the hopes of finding a planet that will be suitable to human needs and possibly serve as a shelter for mankind. You will be on your own for the entire mission but your spaceship will be carrying a few bots along.
cs: <a object|human>Vaše</a> mise sestává z průzkumu sousedních galaxií v naději, že naleznete planetu vhodnou pro lidský život a snad i nový domov pro lidstvo. Po celou misi budete úplně sami, ale na palubě rakety s sebou povezete několik robotů.

source: Eight months ago an expedition composed entirely of robots was sent across the cosmos with the same objective. It encountered a fair share of obstacles along the way, apparently landing on planets that were unsuitable for colonization, even possibly outright hostile. Very recently all communications were terminated.
cs: Před osmi měsíci jsme do vesmíru vyslali výpravu složenou výhradně z robotů se stejným úkolem. Ta po cestě narazila na řadu překážek a přistála na několika planetách nevhodných pro kolonizaci, některých přímo smrtelně nebezpečných. Nedávno pak bylo spojení s výpravou zcela přerušeno.

source: The reasons for the mission's failure are unclear at this date, mainly because of recurrent transmission problems. It is our hope that you will be able to use some of the data it gathered to your advantage.
cs: Příčina neúspěchu výpravy v tuto chvíli není jasná, především kvůli opakovaným výpadkům spojení. Doufáme, že dokážete data shromážděná předchozí výpravou nějak zužitkovat.

source: Immediate Objective
cs: Bezprostřední úkol

source: The Nevada desert is already bustling with activity. Bots are setting up a space station catered to your specific needs.
cs: Nevadská poušť už se hemží přípravami. Roboti sestavují vesmírnou stanici uzpůsobenou všem Vašim potřebám.

source: In order to let you familiarize with your spacesuit and equipment, we have set up a few training drills.
cs: Přichystali jsme několik výcvikových úkolů, abyste se důkladně seznámili se svým skafandrem a vybavením.

source: In the first drill, you need to find your survival kit that contains all the tools necessary to brave the cold of outer space. It is easy to spot since it contains both an orange and a blue tank.
cs: V prvním cvičení musíte najít své vybavení pro přežití, které obsahuje vše potřebné, abyste mohli čelit chladu vnějšího vesmíru. Snadno ho poznáte podle oranžové a modré nádržky po stranách.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a>
cs: <a command>Ovládání</a>

source: Walkthrough
cs: Návod

source: To find the survival kit from your starting point :
cs: Jak najít vybavení pro přežití od své startovní pozice:

source: Follow the road heading south.
cs: Jděte po silnici směrem na jih.

source: Turn east (left) at the first crossroad.
cs: Na první křižovatce zahněte na východ (vlevo).

source: The survival kit is lying between the northern wall of Mission Control and the first tree on the right hand side of the road.
cs: Vybavení pro přežití leží mezi severní zdí řídícího střediska a prvním stromem po pravé straně silnice.

source: Just position yourself close to it to successfully complete the drill.
cs: Prostě dojděte až k němu, abyste cvičení úspěšně dokončili.
