Repository: badernageral/colobot-data
Catalog: levels/missions/chapter006/level004/po/*.po
Languages: cs

source: Technological Treasure
cs: Technologický poklad

source: Rediscover a new type of bot.
cs: Znovu objevte nový druh robota.

source: An urgent notification from Mission Control
cs: Naléhavá zpráva z řídícího střediska

source: As you were about to take off, we received from the satellite the following piece of information: a bot of a type yet unknown has been spotted on Volcano. Try to bring it back onto your spaceship for further study.
cs: Zatímco jste se chystali k odletu, dostali jsme ze satelitu následující informaci: Na Vulkánu byl objeven robot prozatím neznámého typu. Pokuste se ho přivézt na palubu rakety k dalšímu zkoumání.

source: Our engineers on Earth have very recently come up with a formula that should allow reactors to function properly, at least for a short while, despite the high temperatures. The data have been transmitted to you.
cs: Naši inženýři na Zemi právě vymysleli vylepšení, díky kterému by měly tryskové motory alespoň na kratší lety řádně fungovat i za vysokých teplot. Data jsme Vám poslali.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of Volcano.
cs: Aktuálně na stacionární oběžné dráze Vulkánu.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: 96.7C \tab;Atmosphere: CO2, SO2, HCN, HS, CH4, NH3 \tab;Wind: 2.8 mps \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Teplota: 96,7 °C \tab;Atmosféra: CO2, SO2, HCN, HS, CH4, NH3 \tab;Vítr: 2,8 m/s \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: none \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Zdroj energie: žádný \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>

source: \tab;Detected: bot \tab; - Type: unknown \tab;Detected: giant ants \tab; - Danger: not immediate
cs: \tab;Nalezeno: robot \tab; - Typ: neznámý \tab;Nalezeno: obří mravenci \tab; - Nebezpečí: není bezprostřední

source: Walkthrough
cs: Návod

source: A gap in the northwest mountain leads the way to a lake of boiling lava.
cs: Průsmyk v severozápadních horách vede k jezeru vroucí lávy.

source: Just hop from one rocky island to the next. Keep checking your reactor, let it cool off completely before taking off again. The mini map will help you to figure out where the closest island is.
cs: Jednoduše skákejte z jednoho skalnatého ostrůvku na druhý. Hlídejte si tryskový motor, před každým vzletem ho nechte úplně vychladnout. Minimapa Vám vždy pomůže najít nejbližší další ostrov.

source: In case of an ant attack, don't worry too much. Just take the time for your reactor to cool off, without lingering longer than necessary, and your built-in shield should do its duty. However we advise you to save the game from time to time (key Esc, and "Save"), so you will not have to start from the beginning in case of a landing in the lava lake.
cs: V případě útoku mravenců se příliš nelekejte. Po vychladnutí tryskového motoru zbytečně neotálejte, a Váš osobní štít by Vás měl spolehlivě ochránit. Přesto ale doporučujeme občas uložit hru (klávesa Esc, a pak "Uložit"), ať v případě pádu do lávového jezera nemusíte začínat úplně od začátku.

source: The bot is at the westernmost point on your map though you'll have to take a roundabout route to reach it. A <a object|atomic>nuclear power cell</a> lies nearby.
cs: Robot se nachází na nejzápadnějším místě mapy, ale budete se k němu muset dostat oklikou. Kousek od něj leží <a object|atomic>jaderná baterie</a>.

source: You don't have to radio-control the bot back to the spaceship by the same way you came because its reactor has a greater range than yours. One or two stops may still be needed and watch out for those ants.
cs: Robota nemusíte zpět k raketě řídit stejnou cestou, kterou jste k němu doletěli, protože jeho tryskový motor se zahřívá pomaleji než ten Váš. Jedna nebo dvě zastávky by měly stačit a pozor na mravence.

source: <a command>Controls</a>
cs: <a command>Ovládání</a>
