Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter002/level006/po/*.po
Languages: cs

source: Wasp Hunter 1
cs: Lovec vos 1

source: Shoot down the flying wasps.
cs: Sestřelte létající vosy.

source: Wasp1
cs: Vosa1

source: Objective
cs: Úkol

source: Here is again the program of the previous exercise that shoots all ants and adapts to the terrain:
cs: Zde je opět program z předchozího cvičení, který zlikviduje všechny mravence a za letu kopíruje terén:

source: extern void object::JetFighter2() { <a cbot|type>object</a> item; <a cbot|aim>aim</a>(-20); <a cbot|while>while</a> (true) { <a cbot|while>while</a> (<a cbot|radar>radar</a>(AlienAnt, 0, 360, 0, 20) == null) { item = <a cbot|radar>radar</a>(AlienAnt); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|motor>motor</a>(1,1); <a cbot|jet>jet</a>(0); <a cbot|if>if</a> (position.z-topo(position) < 6) { <a cbot|jet>jet</a>(1); } <a cbot|if>if</a> (position.z-topo(position) > 9) { <a cbot|jet>jet</a>(-1); } <a cbot|wait>wait</a>(0.2); } <a cbot|fire>fire</a>(1); } }
cs: extern void object::Stihacka2() { <a cbot|type>object</a> item; <a cbot|aim>aim</a>(-20); <a cbot|while>while</a> (true) { <a cbot|while>while</a> (<a cbot|radar>radar</a>(AlienAnt, 0, 360, 0, 20) == null) { item = <a cbot|radar>radar</a>(AlienAnt); <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|motor>motor</a>(1,1); <a cbot|jet>jet</a>(0); <a cbot|if>if</a> (position.z-topo(position) < 6) { <a cbot|jet>jet</a>(1); } <a cbot|if>if</a> (position.z-topo(position) > 9) { <a cbot|jet>jet</a>(-1); } <a cbot|wait>wait</a>(0.2); } <a cbot|fire>fire</a>(1); } }

source: In order to adapt the program to shooting wasps, you need to make a few changes. Replace all <code>radar(AlienAnt)</code> with <code>radar(AlienWasp)</code>. The cannon must aim straight forward and not downward, replace <c/>aim(-20);<n/> with <c/>aim(0);<n/>. And the bot must fly at the same height as the wasp. For this, you must compare the altitude of the bot given by <code>position.z</code> with the altitude of the wasp given by <code>item.position.z</code>: if <code>position.z > item.position.z</code>, go down slowly with <c/>jet(-0.3);<n/>. If <code>position.z < item.position.z-1</code>, climb slowly with <c/>jet(0.3);<n/>. A winged shooter is higher than a wasp, therefore it is better if the altitude of the bot is a little lower than the altitude of the wasp. In this case, we admit that the altitude of the bot ranges between the altitude of the wasp and the altitude of the wasp minus 1.
cs: Aby tento program fungoval proti vosám, je třeba několik úprav. Změňte všechny příkazy <code>radar(AlienAnt)</code> na <code>radar(AlienWasp)</code>. Kanón musí mířit rovně před sebe místo dolů, takže změňte <c/>aim(-20);<n/> na <c/>aim(0);<n/>. A robot musí letět ve stejné výšce jako vosa. Musíte tedy porovnávat letovou výšku robota danou výrazem <code>position.z</code> s letovou výškou vosy danou výrazem <code>item.position.z</code>: Když bude <code>position.z > item.position.z</code>, pomalu klesejte příkazem <c/>jet(-0.3);<n/>. Když bude <code>position.z < item.position.z-1</code>, pomalu stoupejte příkazem <c/>jet(0.3);<n/>. Létající kanón je vyšší než vosa, takže je výhodnější letět trochu níže. V tomto případě přiznáváme, že robot se bude snažit letět nejvýše ve stejné výšce jako vosa a nejníže metr pod ní.

source: Further improvement
cs: Další vylepšení

source: Wasps move very fast. In order to increase your chances to get them, better to repeat just before the <c/>fire(1);<n/> a <code>radar</code> and a <code>turn</code> in order to perform a last readjustment of the direction before the shot.
cs: Vosy se pohybují velmi rychle. Pro lepší šanci na zásah byste tedy před palbou příkazem <c/>fire(1);<n/> měli ještě naposledy upravit směr pomocí příkazů <code>radar</code> a <code>turn</code>.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
