Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter001/level004/po/*.po
Languages: cs

source: Titanium 2
cs: Titan 2

source: Use the bot's radar to look for the titanium ore and bring it to the converter.
cs: Najděte titanovou rudu pomocí robotova radaru a odvezte ji do konvertoru.

source: Titanium2
cs: Titan2

source: Objective
cs: Úkol

source: Take a chunk of <a object|titanore>titanium ore</a> the exact location of which we do not know. Use the bot's radar to find it. Bring the titanium ore to the <a object|convert>converter</a>.
cs: Vezměte hroudu <a object|titanore>titanové rudy</a>, jejíž přesnou polohu neznáme. Najděte ji pomocí robotova radaru. Pak ji odvezte do <a object|convert>konvertoru</a>.

source: As you have certainly noticed, the programs written in the previous exercises were completely "blind": if the titanium ore, the power cell or the spiders had been at another location, the bot would not have found them.
cs: Jak jste si jistě všimli, programy napsané v předchozích cvičeních fungovaly zcela "naslepo": kdyby byla titanová ruda, baterie nebo pavouci někde jinde, robot by je nenašel.

source: The radar represents the "eyes" of the bot. With the radar, it can detect the objects around it. For example the instruction <c/><a cbot|radar>radar</a>(TitaniumOre);<n/> will return information about the closest chunk of <a object|titanore>titanium ore</a>. However, we will have to "store" the information returned by the instruction <c/><a cbot|radar>radar</a>(TitaniumOre);<n/> somewhere. For this task we will need a <a cbot|var>variable</a>.
cs: Radar představuje "oči" robota. Pomocí radaru může hledat objekty v okolí. Například příkaz <c/><a cbot|radar>radar</a>(TitaniumOre);<n/> vrátí informace o nejbližší hroudě <a object|titanore>titanové rudy</a>. Jenže informace vrácené příkazem <c/><a cbot|radar>radar</a>(TitaniumOre);<n/> budeme muset někam uložit. K tomu slouží <a cbot|var>proměnné</a>.

source: A <a cbot|var>variable</a> is like a small box with a name where you can put some information, retrieve it, change it, etc. Before you can use a variable, you have got to declare it. First you must indicate the <a cbot|type>type</a> of the variable, in this case <code>object</code>. A variable of this type can contain all the information describing an object such as a chunk of titanium ore, a spider, an ant, a bot, a power cell, etc. Then you must write the name that you want to give to the variable, for example <code>item</code>. If we put this together, we get the following line:
cs: <a cbot|var>Proměnná</a> je jako malá pojmenovaná krabička, kde si můžete nějakou informaci odložit, prohlédnout, upravit, atd. Před použitím proměnné ji musíte nejprve deklarovat. Nejdříve musíte určit <a cbot|type>datový typ</a> proměnné, v tomto případě <code>object</code>. Do proměnné tohoto typu můžete uložit všechny informace popisující nějaký objekt, například hroudu titanové rudy, pavouka, mravence, robota, baterii, atd. Pak musíte napsat jméno, které chcete nové proměnné přidělit, například <code>item</code>. Když to dáme dohromady, vyjde nám následující řádek:

source: Then we must put the information returned by the instruction <code><a cbot|radar>radar</a>(TitaniumOre)</code> into this variable:
cs: Pak do této proměnné musíme uložit informace vrácené příkazem <code><a cbot|radar>radar</a>(TitaniumOre)</code>:

source: The variable <code>item</code> contains many different kinds of information: it contains the position, the orientation, the pitch, etc. In order to get the position of the chunk of titanium ore, write <code>item.position</code>. Then we use the instruction <c/>goto();<n/> in order to move the bot to this position. Here is a line that puts all this together:
cs: Proměnná <code>item</code> obsahuje několik různých informací: obsahuje polohu, azimut, náklon, atd. Pokud chcete zjistit polohu hroudy titanové rudy, napište <code>item.position</code>. Pak na dané místo můžeme s robotem dojet příkazem <c/>goto();<n/>. Shrnuto do jednoho řádku:

source: If we "translate" this into English, this would mean: go to the position of the object described by the variable <code>item</code>.
cs: Když to "přeložíme" do češtiny, znamená to: dojeď k pozici objektu popsaného v proměnné <code>item</code>.

source: You can then just pick up what is at this position with the instruction <c/><a cbot|grab>grab</a>();<n/>.
cs: Pak můžete příkazem <c/><a cbot|grab>grab</a>();<n/> zvednout to, co na daném místě leží.

source: If we put all this together, we get the following program:
cs: Když to vše dáme dohromady, vyjde nám následující program:

source: extern void object::Titanium2( ) { <a cbot|type>object</a> item; item = <a cbot|radar>radar</a>(TitaniumOre); <a cbot|goto>goto</a>(item.position); grab(); }
cs: extern void object::Titan2( ) { <a cbot|type>object</a> item; item = <a cbot|radar>radar</a>(TitaniumOre); <a cbot|goto>goto</a>(item.position); grab(); }

source: Then you must look for the <a cbot|convert>converter</a>, and put the information about the converter into the variable <code>item</code>:
cs: Pak musíte najít <a object|convert>konvertor</a> a uložit informace o něm do proměnné <code>item</code>:

source: Go to the converter with the same instruction <c/><a cbot|goto>goto</a>(item.position);<n/> as above, drop the titanium, and step back. The converter will take care of the rest.
cs: Dojeďte ke konvertoru opět příkazem <c/><a cbot|goto>goto</a>(item.position);<n/> jako předtím, položte rudu a zacouvejte. Konvertor zařídí zbytek.

source: If you want to know more about the "names" of the different objects in the programming language, please refer to the <a cbot|category>text about categories</a>.
cs: Pokud se chcete dozvědět více o "názvech" různých druhů objektů v tomto programovacím jazyce, přečtěte si <a cbot|category>popis kategorií</a>.

source: Remarks
cs: Poznámky

source: A <a cbot|var>variable</a> must be declared only once at the beginning of the program! You can then use it as often as you want.
cs: <a cbot|var>Proměnnou</a> musíte deklarovat pouze jednou na začátku programu. Pak ji můžete použít, kolikrát budete chtít.

source: In order to avoid retyping the instructions explained above, you can select them with the mouse, and copy-paste <button 61/> them into your program.
cs: Abyste příkazy popsané výše nemuseli přepisovat ručně, můžete je vybrat myší a zkopírovat <button 61/> do editoru programu.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
