Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter001/level003/po/*.po
Languages: cs

source: Titanium 1
cs: Titan 1

source: Take a chunk of titanium ore and bring it to the converter.
cs: Vezměte hroudu titanové rudy a odvezte ji do konvertoru.

source: Titanium1
cs: Titan1

source: Objective
cs: Úkol

source: Write a program that takes a chunk of <a object|titanore>titanium ore</a> and drops in on the <a object|convert>converter</a> in order to produce a <a object|titan>titanium cube</a>.
cs: Napište program, který vezme hroudu <a object|titanore>titanové rudy</a> a položí ji do <a object|convert>konvertoru</a>, aby se vyrobila <a object|titan>kostka titanu</a>.

source: You will need a new instruction:
cs: Budete potřebovat nový příkaz:

source: Instructs the bot to move forward or backward. The distance of the move is given in brackets in meters: <c/>move(10);<n/> moves the bot 10m forward, <c/>move(-1);<n/> moves the bot 1m backward.
cs: Přikazuje robotovi, aby popojel dopředu nebo dozadu. Číslo v závorkách určuje vzdálenost jízdy v metrech: <c/>move(10);<n/> pošle robota 10m kupředu, <c/>move(-1);<n/> pošle robota 1m dozadu.

source: The instructions <code><a cbot|turn>turn</a>()</code>, <code><a cbot|grab>grab</a>()</code> and <code><a cbot|drop>drop</a>()</code> have already been explained in the previous exercises. If you have any questions about these instructions, click the name of the instruction underlined in blue, and an explanation of the instruction will appear.
cs: Příkazy <code><a cbot|turn>turn</a>()</code>, <code><a cbot|grab>grab</a>()</code> a <code><a cbot|drop>drop</a>()</code> již byly vysvětleny v předchozích cvičeních. Pokud máte k těmto příkazům nějaké otázky, klikněte na jejich modře podtržený název a zobrazí se jejich podrobný popis.

source: The <a object|titanore>titanium ore</a> is 20m in front of the bot, the <a object|convert>converter</a> is 10m behind the bot. After dropping the titanium ore on the converter, do not forget to move back (for example <c/>move(-2.5);<n/>) so as to allow the converter to get down to work.
cs: <a object|titanore>Titanová ruda</a> je 20m před robotem a <a object|convert>konvertor</a> je 10m za robotem. Po položení rudy do konvertoru nezapomeňte kousek zacouvat (například <c/>move(-2.5);<n/>), aby konvertor mohl začít pracovat. Desetinná čísla používají anglický zápis, tedy s tečkou jako oddělovačem desetinných míst.

source: <format key><key help/></format> allows you to review these instructions at all times.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst klávesou <format key><key help/></format>.
