Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter001/level002/po/*.po
Languages: cs

source: Power Cell 1
cs: Baterie 1

source: Instruct a bot to change the power cell of a nearby winged shooter.
cs: Naprogramujte robota, aby vyměnil baterii létajícímu kanónu.

source: Spider2
cs: Pavouk2

source: Objective
cs: Úkol

source: Program the <a object|botgr>grabber bot</a> to change the <a object|power>power cell</a> of the <a object|botfj>winged shooter</a>. The winged shooter can then shoot the spiders.
cs: Naprogramujte <a object|botgr>pojízdné rameno</a>, aby vyměnilo <a object|power>baterii</a> <a object|botfj>létajícímu kanónu</a>. Létající kanón pak zlikviduje pavouky.

source: Procedure
cs: Postup

source: Program the <a object|botgr>grabber bot</a>.
cs: Naprogramujte <a object|botgr>pojízdné rameno</a>.

source: Execute the program with the arrow button <button 21/>.
cs: Spusťte program tlačítkem se šipkou <button 21/>.

source: The <a object|botfj>winged shooter</a> is already programmed, it will do its job as soon as it has got a new power cell.
cs: <a object|botfj>Létající kanón</a> už je naprogramovaný, čeká jen na novou baterii.

source: You will need the following instructions:
cs: Budete potřebovat následující příkazy:

source: <n/>Takes whatever there is in front of the bot.
cs: <n/>Zvedne libovolný předmět před robotem.

source: <n/>Drops whatever the bot is carrying in front.
cs: <n/>Položí před sebe předmět, který robot drží.

source: <n/>We have seen this instruction already in the previous exercise: it performs a rotation of a certain angle, given in degrees.
cs: <n/>Tento příkaz už jsme viděli v předchozím cvičení: otočí robota o úhel zadaný ve stupních.

source: pick up the empty power cell with <c/>grab();<n/>
cs: zvedněte prázdnou baterii příkazem <c/>grab();<n/>

source: turn left 90 degrees (quarter turn) with <code>turn(90)</code>
cs: otočte doleva o 90 stupňů (půlobrat) příkazem <code>turn(90)</code>

source: drop the empty cell with <c/>drop();<n/>
cs: položte prázdnou baterii příkazem <c/>drop();<n/>

source: etc.
cs: atd.

source: It is up to you now to write the rest of the program!
cs: Dopsat zbytek programu už je na Vás!

source: If you have got a problem, you can always look at the solution: select the <code>Solution</code> program, and click the braces button <button 22/>.
cs: Pokud se Vám nedaří, můžete se kdykoliv podívat na řešení: vyberte program <code>Řešení</code> a klikněte na tlačítko se složenými závorkami <button 22/>.

source: Remarks
cs: Poznámky

source: Be careful to write the instructions precisely, respecting lower and upper case letters.
cs: Dávejte pozor, abyste příkazy psali přesně a správně. Dodržujte i velká a malá písmena.

source: Always write one instruction per line, finishing each line with a semicolon.
cs: Na každý řádek pište jen jeden příkaz a zakončete ho středníkem.

source: In case your program does not do exactly what you wanted, you can put the bot back at the starting point with the button <button 59/>. You can also start over again from the beginning (hit the key "Esc", the click "Restart"). The program you have written will not be lost.
cs: Pokud Váš program dělá něco jiného, než jste chtěli, můžete robota vrátit na startovní pozici tlačítkem <button 59/>. Nebo můžete cvičení spustit úplně od začátku (stiskněte klávesu "Esc" a klikněte na "Restartovat"). O svůj program tím nepřijdete.

source: <format key><key help/></format> allows you to review these instructions at all times.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst klávesou <format key><key help/></format>.

source: Let us see the beginning of the program:
cs: Podívejme se na základ programu:
