Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter005/level003/po/*.po
Languages: cs

source: Mover 3
cs: Přeprava 3

source: Convert some titanium ore to titanium cubes.
cs: Vyrobte z titanové rudy několik kostek titanu.

source: Mover
cs: Preprava

source: Exercise
cs: Cvičení

source: Convert some <a object|titanore>titanium ore</a> to <a object|titan>titanium cubes</a>, then drop 2 titanium cubes on the pads whose coordinates are:
cs: Vyrobte z <a object|titanore>titanové rudy</a> dvě <a object|titan>kostky titanu</a> a položte je na cílové značky na souřadnicích:

source: The <a object|derrick>derrick</a> extracts titanium ore from the subsoil; you just have to pick it up.
cs: <a object|derrick>Vrtná věž</a> těží titanovou rudu z podzemí; hroudu rudy pak stačí jen zvednout ze země.

source: The <a object|convert>converter</a> converts titanium ore to titanium cubes. Just drop the titanium ore on the platform, move backward, and wait until it has been converted.
cs: <a object|convert>Konvertor</a> vyrábí z rudy titanové kostky. Jednoduše položte hroudu rudy na podložku, zacouvejte a počkejte na dokončení výroby.

source: General principle
cs: Obecný postup

source: Wait until there is some titanium ore.
cs: Počkat na vytěžení titanové rudy.

source: Go to the titanium ore.
cs: Dojet k hroudě rudy.

source: Pick it up.
cs: Zvednout ji.

source: Go to converter.
cs: Dojet ke konvertoru.

source: Drop the titanium ore.
cs: Položit rudu.

source: Move back 2.5 meters.
cs: Zacouvat 2,5 metru.

source: Wait until there is a titanium cube.
cs: Počkat na vyrobení kostky titanu.

source: Pick up the titanium cube.
cs: Zvednout kostku titanu.

source: Go to the platform.
cs: Dojet na cílovou značku.

source: Drop the titanium cube.
cs: Položit kostku titanu.

source: The program
cs: Program

source: A <code><a cbot|for>for</a></code> loop allows you to repeat 2 times all the instructions. The titanium ore is not available immediately. You will have to wait until the derrick extracts it. Use a <code><a cbot|do>do</a></code> loop, as follows:
cs: Cyklus <code><a cbot|for>for</a></code> umožňuje dvakrát zopakovat zadané příkazy. Titanová ruda není dostupná hned od začátku. Budete muset počkat, než ji vrtná věž vytěží. Na to použijte cyklus <code><a cbot|do>do</a></code> takto:

source: After the loop (when the radar has found one titanium ore), you can go to its location <code>obj.position</code> with the instruction <code><a cbot|goto>goto</a></code>. Use the instruction <code><a cbot|grab>grab</a></code> to grab the titanium ore. Use the following instruction in order to find the converter:
cs: Po skončení cyklu (když radar našel nějakou titanovou rudu) zjistíte její polohu výrazem <code>obj.position</code> a můžete k ní dojet příkazem <code><a cbot|goto>goto</a></code>. Pro zvednutí rudy použijte příkaz <code><a cbot|grab>grab</a></code>. Pro nalezení konvertoru použijte následující příkaz:

source: After you dropped the ore on the converter, move back 2.5 meters with <code><a cbot|move>move</a>(-2.5)</code>. A second <code>do</code> loop allows you to wait until the titanium cube is available. You must limit the range of the radar to 5m, otherwise you would immediately find the titanium cube that you already dropped on a pad:
cs: Po položení rudy do konvertoru zacouvejte 2,5 metru příkazem <code><a cbot|move>move</a>(-2.5)</code>. Dalším cyklem <code>do</code> pak můžete počkat na vyrobení kostky titanu. Dosah radaru musíte omezit na 5m, jinak by okamžitě našel kostku titanu, kterou jste už předtím položili na cílovou značku:

source: The <code>x</code> coordinates of the 2 pads are all equal to 10. The <code>y</code> coordinates are respectively -60 and -65. The most efficient way to get the coordinates of the pads is to use the value of <code>i</code> of the <code>for</code> loop that will take successively the values 0 and 1:
cs: Obě cílové značky mají souřadnici <code>x</code> rovnu 10. Souřadnice <code>y</code> mají hodnotu -60 a -65. Nejpohodlnější způsob, jak získat souřadnice další cílové značky, je využít řídící proměnnou <code>for</code> cyklu "<code>i</code>", která bude v jednotlivých opakováních cyklu postupně nabývat hodnot 0 a 1:

source: It is up to you to finish the program...
cs: Dopsat zbytek programu už je na Vás...

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Repeat two times :
cs: Opakovat dvakrát:
