Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter003/level006/po/*.po
Languages: cs

source: Labyrinth 1
cs: Bludiště 1

source: Teach your bot how to find its way out of the labyrinth.
cs: Naučte svého robota, jak najít cestu skrz bludiště.

source: Labyrinth
cs: Bludiste

source: Exercise
cs: Cvičení

source: Program the bot so that it will find its way without hitting the walls of the labyrinth. We suppose that you do not know the configuration of the labyrinth, but there are no bifurcations, and no dead-ends. The labyrinth is made of squares measuring 5m each.
cs: Naprogramujte robota, aby našel cestu skrz bludiště a nenarazil při tom do zdi. Předpokládejme, že neznáte přesnou mapu bludiště, ale nejsou v něm žádná rozcestí ani slepé uličky. Bludiště se skládá ze čtvercových polí o rozměrech 5x5 metrů.

source: The instruction <code>radar</code>
cs: Příkaz <code>radar</code>

source: The instruction <c/><a cbot|radar>radar</a>(Barrier, 0, 45, 0, 5);<n/> will find any <a object|barrier>barrier</a> in front of the radar that is closer than 5m. Let us take a closer look at the five parameters used:
cs: Příkaz <c/><a cbot|radar>radar</a>(Barrier, 0, 45, 0, 5)<n/> najde libovolný <a object|barrier>zátaras</a>, který je blíže než 5 metrů před robotem. Proberme si všech pět parametrů podrobněji:

source: <a cbot|category>Category</a> of the object that the radar must look for, i.e. a barrier.
cs: <a cbot|category>Kategorie</a> objektu, který má radar hledat, t.j. zátaras.

source: Direction of the radar. <code>0</code> means that the radar must search straight forward.
cs: Směrový úhel radaru. <code>0</code> znamená, že radar má mířit rovně dopředu.

source: Opening angle in degrees. With an opening angle of 45 degrees, barriers situated between 22.5 degrees to the left and 22.5 degrees to the right will be detected.
cs: Zorný úhel ve stupních. Při úhlu 45 stupňů budou nalezeny zátarasy nacházející se až 22,5 stupně nalevo nebo 22,5 stupně napravo od směrové osy radaru.

source: Minimum detection distance. <code>0</code> means that even object that are very close to the bot will be detected.
cs: Minimální vzdálenost. <code>0</code> znamená, že radar najde i objekty těsně u robota.

source: Maximum detection range. Any barrier situated beyond <code>5</code> meters will not be detected.
cs: Maximální vzdálenost. Radar si nebude všímat zátarasů, které jsou dále než <code>5</code> metrů.

source: To take another example, <c/><a cbot|radar>radar</a>(Barrier, 90, 45, 0, 5);<n/> will direct the radar 90 degrees to the left, in order to test if the way to the left is free.
cs: Ukažme si další příklad. Příkaz <c/><a cbot|radar>radar</a>(Barrier, 90, 45, 0, 5);<n/> namíří radar o 90 stupňů vlevo, aby program zjistil, jestli je cesta doleva volná.

source: General principle
cs: Obecný postup

source: If there is nothing in front, move forward.
cs: Pokud je před robotem volno, popojeďte vpřed.

source: If there is nothing on the left side, quarter turn left, move forward.
cs: Pokud je volno nalevo od robota, udělejte půlobrat vlevo a popojeďte vpřed.

source: If there is nothing on the right side, quarter turn right, move forward.
cs: Pokud je volno napravo od robota, udělejte půlobrat vpravo a popojeďte vpřed.

source: First of all declare three <a cbot|var>variables</a> of type <code><a cbot|object>object</a></code>, that we call <code>front</code>, <code>left</code> and <code>right</code>. Variables of this type can contain the description of any object, for example of a barrier found by the radar.
cs: Nejprve deklarujte tři <a cbot|var>proměnné</a> typu <code><a cbot|object>object</a></code>, které nazveme <code>front</code>, <code>left</code> a <code>right</code>. Proměnné tohoto typu mohou obsahovat popis libovolného objektu, například zátarasu objeveného radarem.

source: Look for barriers in all three directions, and put the result of the <code>radar</code> instruction into the three variables defined at point 1). If the radar finds nothing, the variable will contain the value <code><a cbot|null>null</a></code>.
cs: Hledejte zátarasy ve všech třech směrech a výsledky příkazu <code>radar</code> uložte do proměnných deklarovaných v kroku 1). Pokud radar nic nenajde, do příslušné proměnné se uloží hodnota <code><a cbot|null>null</a></code>.

source: Test if the way is free in front of the bot with the instruction <code><a cbot|if>if</a></code>. If the test is true, the instructions in braces <code>{ }</code> will be executed, otherwise the execution will resume after the closing brace <code>}</code>.
cs: Zkontrolujte příkazem <code><a cbot|if>if</a></code>, jestli je rovně před robotem volno. Když bude podmínka v příkazu <code><a cbot|if>if</a></code> platit, provedou se příkazy ve složených závorkách <code>{ }</code>, jinak bude program pokračovat až za pravou složenou závorkou <code>}</code>.

source: The instruction <code>return</code> leaves the program: the job is done.
cs: Příkaz <code>return</code> ukončí program: úkol je splněn.

source: Test if it is possible to turn left; if so, turn left with the instruction <code><a cbot|turn>turn</a></code> and move 5m forward.
cs: Zkontrolujte, jestli je možno jet doleva; pokud ano, otočte doleva příkazem <code><a cbot|turn>turn</a></code> a popojeďte 5m vpřed.

source: Test if it is possible to turn right.
cs: Zkontrolujte, jestli je možno jet doprava.

source: Attention
cs: Pozor

source: The instruction <code>if ( )</code> must never be followed by a <a cbot|term>semicolon</a>.
cs: Za příkazem <code>if ( )</code> nikdy nesmíte napsat <a cbot|term>středník</a>.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: The program must only take care of one square portion of the labyrinth. You will have to execute it several times in order to arrive at the finishing pad.
cs: Níže popsaný program dojede pouze na následující volné pole. Budete ho muset ručně spustit několikrát dokola, abyste dojeli až do cíle.
