Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter003/level007/po/*.po
Languages: cs

source: Labyrinth 2
cs: Bludiště 2

source: Teach your bot to do the same job in a more autonomous way.
cs: Naučte svého robota, aby stejný úkol zvládl samostatně.

source: Labyrinth
cs: Bludiste

source: Exercise
cs: Cvičení

source: This exercise is very similar to the previous one. This time the bot should find its way alone from the start to the goal; you will have to execute the program only once.
cs: Toto cvičení je velmi podobné jako to předchozí. Tentokrát by měl robot najít cestu od startu až do cíle úplně sám; program musí stačit spustit pouze jednou.

source: Remark
cs: Poznámka

source: The labyrinth is not exactly the same, but this should be of no importance, as the program adapts to what it "sees".
cs: Bludiště je trochu jiné než minule, ale to by mělo být jedno, protože program se řídí tím, co "vidí".

source: General principle
cs: Obecný postup

source: Use an infinite <code><a cbot|while>while</a></code> loop in order to execute the previous program several times:
cs: Opakujte předchozí program stále dokola pomocí nekonečného cyklu <code><a cbot|while>while</a></code>:

source: <code>while ( true ) { </code>If there is nothing in front, move forward<code> </code>If there is nothing on your left hand, turn left<code> </code>If there is nothing on your right hand, turn right<c/> }
cs: <code>while ( true ) { </code>Pokud je před robotem volno, popojeďte vpřed<code> </code>Pokud je volno nalevo, zahněte doleva<code> </code>Pokud je volno napravo, zahněte doprava<c/> }

source: Inside this <code>while</code> loop, replace the <code>return</code> instructions by <code><a cbot|continue>continue</a></code> instructions. <code>return</code> would quit the program, which is not what we want here. <code>continue</code> will just resume the execution at the beginning of the <code><a cbot|while>while</a></code> loop:
cs: Příkazy <code>return</code> uvnitř cyklu <code>while</code> přepište na příkaz <code><a cbot|continue>continue</a></code>. Příkaz <code>return</code> by ukončil program, což v tomto případě nechceme. Příkaz <code>continue</code> místo toho přeskočí zpět na začátek cyklu <code><a cbot|while>while</a></code>:

source: Remember
cs: Pamatujte

source: Here is again the program of the previous exercise :
cs: Zde je opět program z předchozího cvičení:

source: Help
cs: Nápověda

source: If you need some help, just click on the hyperlinks of the instructions <code><a cbot|radar>radar</a></code>, <code><a cbot|if>if</a></code>, <code><a cbot|move>move</a></code> or <code><a cbot|turn>turn</a></code>.
cs: Pokud potřebujete nápovědu, prostě klikněte na odkazy k příkazům <code><a cbot|radar>radar</a></code>, <code><a cbot|if>if</a></code>, <code><a cbot|move>move</a></code> nebo <code><a cbot|turn>turn</a></code> na této stránce.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
