Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter001/level007/po/*.po
Languages: cs

source: Spiders 3
cs: Pavouci 3

source: Learn to move the bot so that no spider can escape.
cs: Naučte se jezdit s robotem, aby žádný pavouk neunikl.

source: Spider3
cs: Pavouk3

source: Objective
cs: Úkol

source: Move towards the spiders that are out of shooting range.
cs: Přibližte se k pavoukům, kteří jsou mimo dostřel.

source: The program will look like the previous one, but before you shoot, use the instruction <c/><a cbot|move>move</a>();<n/> in order to get close enough.
cs: Program bude vypadat podobně jako v předchozím cvičení, ale před výstřelem se přibližte na dostřel příkazem <c/><a cbot|move>move</a>();<n/>.

source: The question is just how many meters the bot must move. The instruction <code><a cbot|dist>distance</a>( , )</code> calculates the distance between two positions. In this case, we need to know the distance between the bot and the target. The position of the target is given by <code>item.position</code>, the position of the bot is given by <code>position</code>. The distance between the bot and the target is given by <code><a cbot|dist>distance</a>(position, item.position)</code>. The range of a fireball cannon is 40 meters. In order to get close enough, the bot must move forward <code><a cbot|dist>distance</a>(position, item.position)-40</code> meters. The following line will do this:
cs: Otázka zní, o kolik metrů musí robot popojet. Příkaz <code><a cbot|dist>distance</a>( , )</code> počítá vzdálenost mezi dvěma body. V tomto případě potřebujeme znát vzdálenost mezi robotem a cílem. Polohu cíle nám řekne výraz <code>item.position</code>, polohu robota nám řekne prostě <code>position</code>. Vzdálenost mezi robotem a cílem tak spočítáme příkazem <code><a cbot|dist>distance</a>(position, item.position)</code>. Dostřel plazmového kanónu je 40 metrů. Robot tedy musí ujet <code><a cbot|dist>distance</a>(position, item.position)-40</code> metrů vpřed, aby se dostal dost blízko. To zajistí následující řádek:

source: Just insert this line into the program before the instruction <c/>fire(1);<n/>, and the bot will start to move.
cs: Prostě tento řádek vložte do programu před příkaz <c/>fire(1);<n/> a robot začne jezdit.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
