Repository: badernageral/colobot-data
Catalog: levels/battles/chapter001/level001/po/*.po
Languages: cs

source: Code battle - vs aliens
cs: Bitva - proti vetřelcům

source: A map for begginers! Research all needed technologies and build your infrastructure to kill all the aliens on the opposite side of the river - using programming only!
cs: Mapa pro začátečníky! Vyzkoumejte všechny potřebné technologie a vybudujte svou základnu, abyste mohli zlikvidovat vetřelce na druhém břehu řeky - čistě pomocí programu!

source: Code Battle (vs Aliens)
cs: Souboj programátorů (proti vetřelcům)

source: This is a training code battle level, which purpose is to familiarize you with this <a battles>game mode</a>.
cs: Toto je cvičná mapa pro souboj programátorů, abyste se seznámili s tímto <a battles>herním režimem</a>.

source: Brief introduction
cs: Stručný úvod

source: Code battle is a completely new game mode featured in Colobot: Gold Edition. There are two or more teams and the one that survives the longest is the winner. As the name suggest, you can only use programming in this game mode.
cs: Souboj programátorů je zcela nový herní režim přidaný v Colobotu: Zlaté edici. Několik týmů v něm bojuje proti sobě a zvítězí ten, který přežije nejdéle. Jak název napovídá, v tomto herním režimu musíte vše ovládat pouze pomocí programů.

source: It is recommended to read <a %lvl%/help/help.%lng% notes>the notes section</a> below.
cs: Doporučujeme Vám přečít si <a %lvl%/help/help.%lng% notes>poznámky</a> níže.

source: Your objective
cs: Váš úkol

source: Kill all the aliens located on the other side of the river.
cs: Zlikvidujte všechny vetřelce na protějším břehu řeky.

source: Notes\m notes;
cs: Poznámky\m notes;

source: The <a object/ant>aliens</a> will not attack you, unless you come too close to them.
cs: <a object|ant>Vetřelci</a> na Vás nezaútočí, pokud se k nim moc nepřiblížíte.

source: <a cbot>The CBOT documentation</a> might come in handy.
cs: Mohla by se Vám hodit <a cbot>dokumentace jazyka CBOT</a>.

source: There is <a object/enerspot>an underground power source</a> only under the beginning base areas.
cs: V malém okruhu kolem počátečních základen jsou jediné <a object|enerspot>podzemní zdroje energie</a>.

source: If you have not played Colobot before, it is recommended to read about <a battles production>the basics of production line</a>.
cs: Pokud hrajete Colobot poprvé, doporučujeme přečíst si <a battles production>základy výrobního řetězce</a>.

source: The pre-built <a object|derrick>Derrick</a> and <a |object\radar>RadarStation</a> are indestructible.
cs: <a object|derrick>Vrtná věž</a> a <a object|radar>radar</a> stojící na mapě od začátku jsou nezničitelné.
