Repository: badernageral/colobot-data
Catalog: levels/challenges/chapter002/level004/po/*.po
Languages: cs

source: Radar and traps 1
cs: Radar a pasti 1

source: Use your radar to look for various items, but watch out for the mines.
cs: Hledejte pomocí radaru různé předměty, ale dávejte pozor na miny.

source: Traps
cs: Pasti

source: Exercise
cs: Cvičení

source: Instruct the bot to find all the <a object|waypoint>blue crosses</a> on the ground, but do not get too close to the <a object|mine>mines</a>. When the bot passes over a cross, it disappears. Here is the general principle:
cs: Pošlete robota najít všechny <a object|waypoint>modré křížky</a> na zemi, ale nepřibližujte se k <a object|mine>minám</a>. Každý křížek zmizí, když přes něj robot přejede. Zde je obecný postup:

source: Look for a mine
cs: Najít minu

source: If a mine has been found, calculate the opposite direction
cs: Pokud jste minu našli, vypočítat směr pryč od ní

source: Look for a cross
cs: Najít křížek

source: If nothing has been found, stop the program
cs: Pokud jste křížek nenašli, ukončit program

source: Calculate the direction of the cross
cs: Vypočítat směr ke křížku

source: Calculate the mean value of the two directions
cs: Vypočítat průměr obou směrů

source: Set the motor speeds in order to head towards the mean direction
cs: Nastavit výkon motorů, aby robot vyrazil zprůměrovaným směrem

source: The instruction <code>radar</code>
cs: Příkaz <code>radar</code>

source: In order to detect a mine with the <code><a cbot|radar>radar</a></code>, we recommend the following parameters: <c/><s/> radar(Mine, 0, 180, 0, 5);<n/> With the opening angle of 180 degrees, mines that are behind the bot will not be found. Mines that are at more than 5 meters are also ignored.
cs: Pro hledání min doporučujeme volat příkaz <code><a cbot|radar>radar</a></code> s následujícími parametry: <c/><s/> radar(Mine, 0, 180, 0, 5);<n/> Při šířce zorného pole 180 stupňů si robot nebude všímat min, které jsou za ním. Stejně tak si nebude všímat min vzdálených více než 5 metrů.

source: In order to find a blue cross, simply write: <c/><s/> radar(WayPoint);<n/> Blue crosses will be found everywhere.
cs: Pro hledání modrých křížků napište prostě: <c/><s/> radar(WayPoint);<n/> Modré křížky budete hledat kdekoliv na mapě.

source: In order to calculate a direction, use <code><a cbot|direct>direction</a></code>. In order to set the motor speeds, use <code><a cbot|motor>motor</a></code>.
cs: Pro výpočet směrového úhlu použijte příkaz <code><a cbot|direct>direction</a></code>. Pro nastavení výkonu motorů použijte příkaz <code><a cbot|motor>motor</a></code>.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Repeat forever:
cs: Opakovat stále dokola:
