Repository: badernageral/colobot-data
Catalog: levels/exercises/po/*.po
Languages: cs

source: Spiders and supply
cs: Pavouci a zásobování

source: Supply problems and fight against motionless targets
cs: Zásobovací úkoly a boj proti nehybným cílům

source: Ants and wasps
cs: Mravenci a vosy

source: Fight against moving targets
cs: Boj proti pohyblivým cílům

source: Fundamentals
cs: Základy

source: Motors
cs: Motory

source: Mover
cs: Přeprava

source: Move
cs: Přeprava

source: Functions
cs: Funkce

source: Classes
cs: Třídy
