Repository: badernageral/colobot-data
Catalog: levels/challenges/chapter003/level001/po/*.po
Languages: cs

source: Mover 1
cs: Přeprava 1

source: Retrieve some titanium ore in order to convert it to titanium cubes.
cs: Přivezte pár kusů titanové rudy a vyrobte z nich kostky titanu.

source: Mover
cs: Preprava

source: Exercise
cs: Cvičení

source: Convert some <a object|titanore>titanium ore</a> to <a object|titan>titanium cubes</a>, then drop 2 titanium cubes on the pads whose coordinates are:
cs: Vyrobte z <a object|titanore>titanové rudy</a> několik <a object|titan>kostek titanu</a> a 2 kostky pak položte na značky na souřadnicích:

source: The <a object|derrick>derrick</a> extracts titanium ore from the subsoil; you just have to pick it up.
cs: <a object|derrick>Vrtná věž</a> těží titanovou rudu z podzemí; stačí ji pak jen sebrat.

source: The <a object|convert>converter</a> converts titanium ore to titanium cubes. Just drop the titanium ore on the platform, move backward, and wait until it has been converted.
cs: <a object|convert>Konvertor</a> z titanové rudy vyrábí kostky titanu. Jednoduše položte titanovou rudu na plošinku, zacouvejte a počkejte na dokončení výroby.

source: General principle
cs: Obecný postup

source: Wait until there is some titanium ore.
cs: Počkat, dokud se neobjeví titanová ruda.

source: Go to the titanium ore.
cs: Dojet k titanové rudě.

source: Pick it up.
cs: Zvednout ji.

source: Go to the converter.
cs: Dojet do konvertoru.

source: Drop the titanium ore.
cs: Položit titanovou rudu.

source: Move back 2.5 meters.
cs: Zacouvat 2,5 metru.

source: Wait until there is a titanium cube.
cs: Počkat, dokud se neobjeví kostka titanu.

source: Pick up the titanium cube.
cs: Zvednout kostku titanu.

source: Go to the platform.
cs: Dojet na plošinku.

source: Drop the titanium cube.
cs: Položit kostku titanu.

source: Useful instructions
cs: Užitečné příkazy

source: <code><a cbot|for>for</a></code> to repeat some instructions <code><a cbot|do>do - while</a></code> to repeat some instructions <code><a cbot|radar>radar</a></code> to look for different objects <code><a cbot|goto>goto</a></code> to move the bot <code><a cbot|grab>grab</a></code> to grab an object <code><a cbot|drop>drop</a></code> to drop an object
cs: <code><a cbot|for>for</a></code> pro opakování několika příkazů <code><a cbot|do>do - while</a></code> pro opakování několika příkazů <code><a cbot|radar>radar</a></code> pro hledání různých objektů <code><a cbot|goto>goto</a></code> pro dojetí s robotem k cíli <code><a cbot|grab>grab</a></code> pro zvednutí předmětu <code><a cbot|drop>drop</a></code> pro položení předmětu

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Repeat two times :
cs: Opakovat dvakrát:
