Repository: badernageral/colobot-data
Catalog: levels/challenges/chapter002/level001/po/*.po
Languages: cs

source: Crazy bot 2
cs: Pomatený robot 2

source: Use the radar to put some order into a big mess left behind by a crazy bot.
cs: Použijte radar, abyste uklidili nepořádek po bláznivém robotu.

source: Exercise
cs: Cvičení

source: In this exercise, a "crazy bot" places many <a object|waypoint>blue crosses</a> on the ground. Just try to find them all.
cs: V tomto cvičení za sebou "pomatený robot" nechává na zemi spoustu <a object|waypoint>modrých křížků</a>. Prostě je všechny najděte.

source: Useful instructions
cs: Užitečné příkazy

source: <code><a cbot|radar>radar</a></code> to detect the blue crosses (category <code><a object|waypoint>WayPoint</a></code>) <code><a cbot|direct>direction</a></code> to calculate a direction <code><a cbot|if>if</a></code> to test a condition <code><a cbot|motor>motor</a></code> to set the motor speeds
cs: <code><a cbot|radar>radar</a></code> pro hledání modrých křížků (kategorie <code><a object|waypoint>WayPoint</a></code>) <code><a cbot|direct>direction</a></code> pro výpočet směrového úhlu <code><a cbot|if>if</a></code> pro testování podmínek <code><a cbot|motor>motor</a></code> pro nastavení výkonu motorů

source: Remark
cs: Poznámky

source: Do not wait too long, because the crazy bot gets down to work immediately. Fortunately, as long as you are in the program editor, the game will pause.
cs: Zbytečně neotálejte, protože pomatený robot už začal řádit. Naštěstí se hra během psaní programu pozastaví.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
