Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter004/level004/po/*.po
Languages: cs

source: Patient hunter
cs: Trpělivý lovec

source: Be patient enough not to waste your ammunitions.
cs: Buďte dost trpěliví, abyste neplýtvali střelivem.

source: Patient
cs: Trpelivost

source: Exercise
cs: Cvičení

source: You must find a way to destroy the four moving <a object|bottarg>target bots</a> without wasting one shot. Notice that after every move, the targets will stay motionless during one second.
cs: Vymyslete způsob, jak zničit čtyři pohyblivé <a object|bottarg>cvičné cíle</a> a ani jednou při tom neminout. Všimněte si, že cvičné cíle zůstanou po každém přesunu na jednu sekundu nehybně stát.

source: General principle
cs: Obecný postup

source: Detect a target with the instruction <c/><a cbot|radar>radar</a>(TargetBot);<n/>.
cs: Najděte cíl příkazem <c/><a cbot|radar>radar</a>(TargetBot);<n/>.

source: Turn towards the target with <c/><a cbot|turn>turn</a>(direction());<n/>.
cs: Otočte k cíli příkazem <c/><a cbot|turn>turn</a>(direction());<n/>.

source: After the rotation, check if the target did not move.
cs: Po otočení zkontrolujte, jestli se cíl nepohnul.

source: If it did not, wait 0.2 seconds with <c/><a cbot|wait>wait</a>(0.2);<n/>.
cs: Pokud se nepohnul, počkejte 0,2 sekundy příkazem <c/><a cbot|wait>wait</a>(0.2);<n/>.

source: Re-check if the target did not move.
cs: Znovu zkontrolujte, jestli se cíl nepohnul.

source: If it did not, shoot with <c/><a cbot|fire>fire</a>(2);<n/> and wait 2 seconds for the target to be hit by the bullets and destroyed.
cs: Pokud se nepohnul, vystřelte příkazem <c/><a cbot|fire>fire</a>(2);<n/> a počkejte 2 sekundy, než střely cíl zasáhnou a zničí.

source: There are of course other ways to achieve the goal.
cs: Samozřejmě jsou i jiné možnosti, jak úkol splnit.

source: Remark
cs: Poznámky

source: In order to increase the efficiency of your shots, aim a little downward with <c/><a cbot|aim>aim</a>(-3);<n/>.
cs: Abyste zlepšili přesnost palby, namiřte trochu dolů příkazem <c/><a cbot|aim>aim</a>(-3);<n/>.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
