Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter004/level001/po/*.po
Languages: cs

source: Dragster
cs: Sprint

source: Program a progressive deceleration in order to avoid the mines right behind the goal.
cs: Naprogramujte postupné brždění, aby robot nenajel na miny za cílem.

source: Exercise
cs: Cvičení

source: Reach the finishing pad (25m in front of you) as fast as possible, using the instruction <code>motor( , )</code>. You will have to slow down progressively at the end of the move, otherwise the bot will get blown up on the <a object|mine>mines</a>.
cs: Co nejrychleji dojeďte na cílovou značku (25m před robotem) pomocí příkazu <code>motor( , )</code>. Na konci dráhy budete muset postupně zpomalovat, jinak robot najede na <a object|mine>miny</a> za cílem.

source: You could very well write no more than <c/><a cbot|move>move</a>(25);<n/>, this would work perfectly well. However, the aim of this exercise is to learn how to use the instruction <code><a cbot|motor>motor</a></code>.
cs: Místo toho byste mohli napsat prostě jen <c/><a cbot|move>move</a>(25);<n/>, to by fungovalo stejně dobře. Jenže cílem tohoto cvičení je naučit se používat příkaz <code><a cbot|motor>motor</a></code>.

source: The speed of the left-hand motor.
cs: Výkon levého motoru.

source: The speed of the right-hand motor.
cs: Výkon pravého motoru.

source: 1 = full throttle backward
cs: 1 = plnou rychlostí couvat

source: 0 = stop 1 = full throttle forward
cs: 0 = zastavit 1 = plnou rychlostí vpřed

source: For example, <c/>motor(0.5, 0.5);<n/> will move the motor forward with half-speed, until new instructions are given to the motors.
cs: Například <c/>motor(0.5, 0.5);<n/> spustí oba motory vpřed na poloviční výkon, dokud nezměníte výkon motorů jiným příkazem.

source: With the instruction <c/>motor(0.5, 0.6);<n/>, the bot will move forward with half-speed, turning at the same time slightly to the left: the right-hand motor moves a little faster (<code>0.6</code>) than the left-hand motor (<code>0.5</code>).
cs: Po příkazu <c/>motor(0.5, 0.6);<n/> pojede robot vpřed poloviční rychlostí a bude mírně zatáčet doleva: pravý motor poběží rychleji (<code>0.6</code>) než levý motor (<code>0.5</code>).

source: General principle
cs: Obecný postup

source: In order to move forward for exactly 25 meters and not more, you must move full speed during the first 23 meters, then reduce the speed of the motors progressively during the last two meters. The <a cbot|var>variable</a> <a cbot|object>position</a> gives you at any moment the current position of the bot, and the instruction <c/><a cbot|dist>distance</a>( , );<n/> returns the distance between two points. The best way to know where you are consists in saving the current position before the start into a <a cbot|var>variable</a>, for example a variable called <code>start</code>. Then you can calculate the distance between the starting position and your current position with <code>distance(position, start)</code>.
cs: Abyste ujeli přesně 25 metrů a ne více, musíte jet plnou rychlostí jen prvních 23 metrů, a pak na posledních dvou metrech postupně snižovat rychlost. <a cbot|var>Proměnná</a> <a cbot|object>position</a> udává vždy aktuální polohu robota a příkaz <c/><a cbot|dist>distance</a>( , );<n/> vrací vzdálenost mezi dvěma body. Jakou vzdálenost jste už ujeli můžete nejlépe zjistit tak, že si na začátku uložíte startovní polohu robota do <a cbot|var>proměnné</a>, kterou nazveme například <code>start</code>. Pak můžete spočítat vzdálenost mezi startovní polohou a aktuální polohou příkazem <code>distance(position, start)</code>.

source: The program
cs: Program

source: declare the variables
cs: Deklarujte proměnné

source: save the starting position
cs: Uložte si startovní polohu

source: start full throttle :
cs: Rozjeďte se plnou rychlostí:

source: Perform an infinite <code><a cbot|while>while</a></code> loop:
cs: Opakujte v nekonečném cyklu <code><a cbot|while>while</a></code>:

source: <c/> while ( true ) { len = distance(position, start); if ( len > 25-2 ) { motor( less than before ! ); } }
cs: <c/> while ( true ) { len = distance(position, start); if ( len > 25-2 ) { motor( pomaleji než při minulém volání! ); } }

source: As long as the distance between the start and the current position is smaller than 23m, the instruction in braces after the <code><a cbot|if>if</a></code> instruction will not be executed, so the motors keep their maximum speed as they were told by the <c/><a cbot|motor>motor</a>(1,1);<n/> instruction.
cs: Dokud bude vzdálenost od startovní pozice menší než 23 metrů, příkazy ve složených závorkách za příkazem <code><a cbot|if>if</a></code> se budou přeskakovat, takže motory poběží na plný výkon dle příkazu <c/><a cbot|motor>motor</a>(1,1);<n/> na začátku programu.

source: <code>2.0</code> meters left -> speed = <code>1.00</code> (maximum)
cs: Když zbývají <code>2.0</code> metry -> rychlost = <code>1.00</code> (maximum)

source: <code>1.5</code> meters left -> speed = <code>0.75</code>
cs: Když zbývá <code>1.5</code> metru -> rychlost = <code>0.75</code>

source: <code>1.0</code> meter left -> speed = <code>0.50</code>
cs: Když zbývá <code>1.0</code> metr -> rychlost = <code>0.50</code>

source: <code>0.5</code> meter left -> speed = <code>0.25</code>
cs: Když zbývá <code>0.5</code> metru -> rychlost = <code>0.25</code>

source: <code>0.0</code> meter left -> speed = <code>0.00</code> (stop)
cs: Když zbývá <code>0.0</code> metrů -> rychlost = <code>0.00</code>

source: tdragst1
cs: tdragst1_cs

source: You can use the following <a cbot|expr>expression</a> <code>(25-len)/2</code> in order to calculate the value for the speed instruction that must be given to the motors.
cs: Potřebný výkon motorů můžete vypočítat <a cbot|expr>výrazem</a> <code>(25-len)/2</code>.

source: It is now up to you to put everything together and to test the program.
cs: Sestavit celý program a vyzkoušet ho už je na Vás.

source: Remark
cs: Poznámky

source: You can use values greater than 1 for the instruction <c/><a cbot|motor>motor</a>();<n/>, but the bot will not move any faster.
cs: Příkazu <c/><a cbot|motor>motor</a>();<n/> můžete zadat i hodnoty větší než 1, ale robot nepojede o nic rychleji.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: This instruction asks for two values:
cs: Tento příkaz vyžaduje dva parametry:

source: The values must range between -1 and 1:
cs: Hodnoty musejí být v rozsahu -1 až 1:

source: In order to slow down progressively, the speed of the motors must be proportional to the remaining distance:
cs: Abyste postupně zpomalovali, musíte výkon motorů snižovat přímo úměrně zbývající vzdálenosti:
