Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter002/level002/po/*.po
Languages: cs

source: Flying tower 1
cs: Létající věž 1

source: Make a flying defense tower out of a winged shooter.
cs: Udělejte z létajícího kanónu létající obrannou věž.

source: Move
cs: Obrana1

source: Objective
cs: Úkol

source: As a defense against ants attacking from all sides, adapt the program <code>Spider2</code> in order to fly at a given altitude.
cs: Na obranu proti mravencům útočícím ze všech stran upravte program <code>Pavouk2</code>, aby létal v zadané výšce.

source: The program necessary for this task is somewhat similar to the program <code>Spider2</code> that looks for the closest ant, turns towards it and fires:
cs: Program vhodný pro tento úkol je z části podobný jako <code>Pavouk2</code>, který najde nejbližšího mravence, otočí se k němu a vystřelí:

source: extern void object::Spider2() { object item; while (true) { item = radar(AlienSpider); turn(direction(item.position)); fire(1); } }
cs: extern void object::Pavouk2() { object item; while (true) { item = radar(AlienSpider); turn(direction(item.position)); fire(1); } }

source: You can copy-paste it to the editor, and adapt it. Replace <c/>radar(AlienSpider);<n/> by <c/>radar(AlienAnt);<n/>, and write before the <code>while</code> loop another loop that activates the jet beneath the <a object|botfj>winged shooter</a> until the bot reaches an altitude of 20 meters.
cs: Můžete si ho zkopírovat do editoru a upravit ho. Přepište <c/>radar(AlienSpider);<n/> na <c/>radar(AlienAnt);<n/> a před cyklus <code>while</code> přidejte další cyklus, který zapne tryskový motor <a object|botfj>létajícího kanónu</a>, dokud robot nevystoupá do výšky 20 metrů.

source: The instruction <code><a cbot|jet>jet</a>()</code> controls the jet beneath winged bots. The number in brackets must range between <code>-1</code> and <code>1</code>.<c/> jet(1);<n/> moves the bot upward with maximum speed.<c/> jet(-1);<n/> moves the bot downward with maximum speed, and <c/>jet(0);<n/> stabilizes the altitude. As the bot must reach a precise altitude, move it upward slowly with <c/>jet(0.2);<n/>, wait until it has reached the desired height, then stabilize the altitude with <c/>jet(0);<n/>.
cs: Příkaz <code><a cbot|jet>jet</a>()</code> ovládá tryskový motor létajících robotů. Číslo v závorkách musí být v rozsahu <code>-1</code> až <code>+1</code>. <c/>jet(1);<n/> přikazuje robotovi plnou rychlostí stoupat. <c/>jet(-1);<n/> přikazuje robotovi padat volným pádem a <c/>jet(0);<n/> znamená udržovat aktuální výšku. Protože chcete robota poslat do přesné výšky, nechte ho stoupat pomalu příkazem <c/>jet(0.2);<n/>, počkejte na dosažení zadané výšky, a pak zastavte stoupání příkazem <c/>jet(0);<n/>.

source: In order to "wait until it has reached the desired height", we need a conditional loop: the instructions inside the loop will be repeated only as long as a certain condition is true. The altitude of the bot is given by <code>position.z</code>. We already saw that <code>position</code> gives the position of the bot. And a position is given by the three coordinates x, y and z: the x-axis is the axis west-east, the y-axis is the axis south-north, and the z-axis is the vertical axis. Therefore we must wait while <code>position.z</code> is smaller than 20:
cs: Abyste "počkali na dosažení zadané výšky," budete potřebovat podmíněný cyklus: příkazy uvnitř cyklu se budou opakovat pouze dokud platí určitá podmínka. Nadmořskou výšku robota udává výraz <code>position.z</code>. Už jsme probírali, že výraz <code>position</code> udává polohu robota. A poloha se skládá ze tří složek: x, y, z. Osa X leží ve směru západ-východ, osa Y leží ve směru jih-sever a Z je svislá osa. Tedy musíme čekat, dokud <code>position.z</code> je menší než 20:

source: After waiting 0.2 seconds, the program will check if the altitude is still below 20 meters. If this is the case, it will wait a little more, if not, the program continues after the loop, i.e. after the closing brace <code>}</code>. Do not forget after the loop to stabilize the altitude with <c/>jet(0);<n/>.
cs: Program počká 0,2 sekundy a znovu se podívá, jestli je výška stále menší než 20 metrů. Pokud ano, počká ještě chvíli. Pokud ne, ukončí cyklus, t.j. začne vykonávat příkazy za pravou složenou závorkou: <code>}</code>. Nezapomeňte po skončení cyklu zastavit stoupání příkazem <c/>jet(0);<n/>.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
