Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter001/level006/po/*.po
Languages: cs

source: Spiders 2
cs: Pavouci 2

source: Use the radar to find and kill all spiders.
cs: Najděte pomocí radaru všechny pavouky a zlikvidujte je.

source: Spider2
cs: Pavouk2

source: Objective
cs: Úkol

source: Kill several spiders whose exact location we do not know. Use the bot's radar to find them.
cs: Zlikvidujte několik pavouků, jejichž přesnou polohu neznáme. Najděte je pomocí robotova radaru.

source: Find the closest spider with the instruction <c/><a cbot|radar>radar</a>(AlienSpider);<n/>, as we did it in the previous exercises with titanium ore and power cells. But do not go to the position of the spider, the bot would be destroyed before arriving there. Just turn towards the spider. The instruction <code><a cbot|direct>direction</a>(item.position)</code> calculates the angle of the rotation that the robot must perform in order to aim at the spider. In order to actually aim at the spider, just write:
cs: Najděte nejbližšího pavouka příkazem <c/><a cbot|radar>radar</a>(AlienSpider);<n/>, stejně jako jsme v předchozích cvičeních hledali titanovou rudu nebo baterie. Ale nejezděte k němu, protože pavouk by robota zničil. Jen se k pavoukovi otočte. Příkaz <code><a cbot|direct>direction</a>(item.position)</code> spočítá úhel, o jaký se robot musí otočit, aby mířil na pavouka. A aby se robot skutečně otočil, jednoduše napište:

source: Notice the two closing brackets at the end of the line, before the semicolon. There are two open brackets, so there must be two closing brackets.
cs: Všimněte si, že na konci řádku před středníkem jsou dvě pravé závorky. Na řádku jsou dvě levé závorky, takže k nim musejí být i dvě pravé závorky do páru.

source: Then shoot with the instruction <c/><a cbot|fire>fire</a>(1);<n/>.
cs: Pak vystřelte příkazem <c/><a cbot|fire>fire</a>(1);<n/>.

source: Here also, you can use a loop with <code><a cbot|while>while</a> (true)</code> in order not to have to execute the program again for every spider, as we did in the last exercise.
cs: Navíc tu můžete použít i cyklus <code><a cbot|while>while</a> (true)</code>, abyste program nemuseli spouštět pro každého pavouka zvlášť, stejně jako v předchozím cvičení.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
