Repository: badernageral/colobot-data
Catalog: levels/missions/chapter009/level001/po/*.po
Languages: cs

source: Killer Mushrooms
cs: Jedovaté houby

source: Run the gauntlet of poison-spitting mushrooms and find the first key to the vault.
cs: Projděte průsmykem plným hub chrlících kyselinu a najděte první klíč od trezoru.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: We've just received information that the first expedition designed a brand new weapon to be used on Terranova. It was safely stored away from possible enemy reach, inside a <a object|safe>vault</a> which can be accessed only by using four <a object|key>keys</a>. The keys are scattered on or under the planet surface.
cs: Právě jsme dostali zprávu, že první výprava vyvinula zcela novou zbraň pro boj na Terranově. Aby ji ochránili před nepřáteli, uložili ji do <a object|safe>trezoru</a>, který lze otevřít pouze pomocí čtyř <a object|key>klíčů</a>. Tyto klíče pak ukryli na různých místech na povrchu i pod povrchem planety.

source: The observation satellite has located one of these keys (A) north of your present position.
cs: Průzkumný satelit objevil jeden z těchto klíčů (A) na sever od Vaší současné polohy.

source: In compliance with Congress directives, our engineers have developed yet another strictly "defensive" bot : it is called a <a object|botshld>shielder</a> and it will offer adequate protection within a given perimeter. The data have been transmitted to your <a object|research>research center</a> along with a couple of relevant programs.
cs: Naši inženýři v souladu se směrnicí Kongresu vyvinuli dalšího čistě "obranného" robota: Nazýváme ho <a object|botshld>mobilní štít</a> a na omezeném prostoru dokáže vytvořit neproniknutelné ochranné pole. Poslali jsme Vám potřebná data pro <a object|research>výzkumnou stanici</a> včetně několika souvisejících programů.

source: As you may know, uranium ore in the subsoil is a powerful fertilizer, furthering the growth of a variety of mushrooms. Please also note that <a object|titanore>titanium ore</a> is often located at the bottom of lakes on this planet.
cs: Jak možná víte, podzemní ložiska uranové rudy představují vynikající hnojivo pro různé druhy hub. Dále pamatujte, že na této planetě se <a object|titanore>titanová ruda</a> nejčastěji vyskytuje na dně jezer.

source: When your mission is completed and before taking off, bring both a <a object|botshld>shielder</a> and a <a object|botsub>subber</a> aboard your spaceship.
cs: Po dokončení mise naložte před odletem do rakety také <a object|botshld>mobilní štít</a> a <a object|botsub>ponorku</a>.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of Terranova.
cs: Aktuálně na stacionární oběžné dráze Terranovy.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: 24.8C \tab;Atmosphere: oxygen \tab;Wind: 0.7 mps \tab;Titanium ore: underwater \tab;Uranium ore: none
cs: \tab;Teplota: 24,8 °C \tab;Atmosféra: kyslík \tab;Vítr: 0,7 m/s \tab;Titanová ruda: pod vodou \tab;Uranová ruda: žádná

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: at some places \tab;Titanium ore: none \tab;Uranium ore: some
cs: \tab;Zdroj energie: na některých místech \tab;Titanová ruda: žádná \tab;Uranová ruda: trocha

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>

source: \tab;Detected: giant ants \tab; - Danger: immediate \tab;Detected: giant wasps \tab; - Danger: not immediate \tab;Detected: reusable derelicts
cs: \tab;Nalezeno: obří mravenci \tab; - Nebezpečí: bezprostřední \tab;Nalezeno: obří vosy \tab; - Nebezpečí: není bezprostřední \tab;Nalezeno: recyklovatelné vraky

source: Walkthrough
cs: Návod

source: Unfortunately no walkthrough has been provided for this mission. You are on your own...
cs: Bohužel, pro tuto misi není k dispozici žádný návod. Musíte si poradit sami...

source: <a command>Controls</a>
cs: <a command>Ovládání</a>
