Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter006/level001/po/*.po
Languages: cs

source: A function
cs: Funkce

source: Create a function in order to make your program shorter.
cs: Napište funkci, abyste si zjednodušili program.

source: Move
cs: Trasa

source: Exercise
cs: Cvičení

source: The <a object|bottr>bot</a> must pass over all the <a object|waypoint>blue crosses</a> on the ground. The way that must be covered is made of two squares. The first one measures 15 meters, the second 25 meters.
cs: <a object|bottr>Robot</a> musí projet přes všechny <a object|waypoint>modré křížky</a> na zemi. Trasa se skládá ze dvou čtverců. První čtverec měří 15 metrů, druhý 25 metrů.

source: General principle
cs: Obecný postup

source: In order to solve this problem, the most efficient solution consists in creating a <a cbot|function>function</a> that instructs the bot to move on a square shape of a certain size. The main program becomes then very simple:<c/>
cs: Nejjednodušším řešením tohoto úkolu je vytvořit <a cbot|function>funkci</a>, která robota pošle objet čtverec o zadané délce. Hlavní program pak bude velmi jednoduchý:<c/>

source: extern void object::Function1( ) { Square(15); Square(25); }
cs: extern void object::Trasa( ) { Square(15); Square(25); }

source: You still have to define the function called <code>Square</code>. In order to do this, you will have to write some instructions outside the <a cbot|bloc>block</a> that until now was the frame of each one of your programs. At the very end of the program, after the last closing brace, we will define the function <code>Square</code>. The program will take the following shape:
cs: Teď ještě musíte naprogramovat funkci nazvanou <code>Square</code>. Pro vytvoření nové funkce musíte napsat několik příkazů mimo <a cbot|bloc>blok</a>, který až doteď obsahoval celý Váš program. Úplně na konci programu, až za poslední složenou závorkou, definujeme funkci <code>Square</code>. Program pak bude vypadat takto:

source: extern void object::Function1( ) { <n/>main function ...<code> } void object::Square(float length) { </code>new function ...<c/> }
cs: extern void object::Trasa( ) { <n/>hlavní funkce...<code> } void object::Square(float length) { </code>nová funkce...<c/> }

source: Let us look in detail at the different elements of the declaration of the function <code>Square</code>:
cs: Podívejme se podrobně na jednotlivé prvky definice funkce <code>Square</code>:

source: <code><a cbot|void>void</a></code> This means that this function will return no value.
cs: <code><a cbot|void>void</a></code> Toto znamená, že funkce nebude vracet žádnou hodnotu.

source: <code><a cbot|object>object</a>::</code> When you write this in front of the function name, you can have access in the function to all the characteristics of the bot, such as <code>position</code>, <code>orientation</code>, etc. In this exercise, this element is not compulsory, as we will not need the characteristics of the bot in the function.
cs: <code><a cbot|object>object</a>::</code> Když toto napíšete před název funkce, budete mít uvnitř funkce přístup ke všem vlastnostem robota, například k proměnným <code>position</code>, <code>orientation</code>, atd. V tomto cvičení můžete tento prvek vynechat, protože ve funkci <code>Square</code> nebudeme vlastnosti robota potřebovat.

source: <code>Square ( )</code> This is the name of the function. You can call it Square, or any other name.
cs: <code>Square ( )</code> Toto je název funkce. Můžete ji nazvat Square, nebo i libovolně jinak.

source: <code><a cbot|float>float</a> length</code> Here you define the parameters that the function will get when it is called. The first time the function is actually called with <code>Square(15)</code>, the variable <code>length</code> will contain the value <code>15</code>. The second time, <code>length</code> will contain <code>25</code>.
cs: <code><a cbot|float>float</a> length</code> Zde definujete parametry, které funkci musíte předat, když ji voláte. Poprvé budeme funkci volat jako <code>Square(15)</code>, takže proměnná <code>length</code> dostane hodnotu <code>15</code>. Podruhé dostane proměnná <code>length</code> hodnotu <code>25</code>.

source: First the main function <code>Function</code> will be executed.
cs: Nejprve se spustí hlavní funkce <code>Trasa</code>.

source: At the line <code>Square(15)</code>, the program will follow the red arrow and enter the function <code>Square</code> a first time, <code>length</code> containing <code>15</code>.
cs: Na řádku <code>Square(15)</code> program poprvé zavolá funkci <code>Square</code> s hodnotou <code>15</code> v proměnné <code>length</code>, jak znázorňuje červená šipka.

source: At the end of the function <code>Square</code>, the program follows the orange arrow and comes back to the main function.
cs: Na konci funkce <code>Square</code> se program vrátí po oranžové šipce zpět do hlavní funkce.

source: At the line <code>Square(25)</code>, the program will follow the blue arrow and enter the function <code>Square</code> a second time.
cs: Na řádku <code>Square(25)</code> program zavolá funkci <code>Square</code> podruhé, jak znázorňuje modrá šipka.

source: At the end of the function <code>Square</code>, the program follows the light blue arrow and comes back to the main function.
cs: Na konci funkce <code>Square</code> se program opět vrátí do hlavní funkce po světle modré šipce.

source: tproc1b
cs: tproc1b_cs

source: In the function <code>Square</code>, use the instructions <code><a cbot|move>move</a></code> and <code><a cbot|turn>turn</a></code>. In order to make it shorter, you can use a <code><a cbot|for>for</a></code> loop, that will repeat the instructions <code><a cbot|move>move</a></code> and <code><a cbot|turn>turn</a></code> 4 times; however, this is not compulsory.
cs: Ve funkci <code>Square</code> použijte příkazy <code><a cbot|move>move</a></code> a <code><a cbot|turn>turn</a></code>. Pro zjednodušení můžete použít i cyklus <code><a cbot|for>for</a></code>, abyste příkazy <code><a cbot|move>move</a></code> a <code><a cbot|turn>turn</a></code> zopakovali čtyřikrát. Ale pokud nechcete, nemusíte.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Here is in detail what will happen when the program is executed:
cs: Program bude po spuštění fungovat takto:
