Repository: badernageral/colobot-data
Catalog: levels/challenges/chapter002/level003/po/*.po
Languages: cs

source: Help
cs: Obrana

source: Defend yourself agains all alien attacks.
cs: Ubraňte se útoku vetřelců.

source: Defense
cs: Obrana

source: Exercise
cs: Cvičení

source: Defend against all enemy attacks
cs: Ubraňte se útoku vetřelců.

source: General idea
cs: Obecný postup

source: The range of your cannon is about 40m. The category of the enemies is <code>AlienAnt</code>. Turn towards the closest ant, even if it is still more than 40m away. But shoot only when it is closer than 40m, in order not to waste your energy.
cs: Dostřel Vašeho kanónu je 40m. Všichni nepřátelé jsou z kategorie <code>AlienAnt</code>. Otočte se vždy k nejbližšímu mravenci, i když je pořád ještě více než 40m daleko. Ale střílejte jen když je blíže než 40m, abyste neplýtvali energií.

source: Useful instructions
cs: Užitečné příkazy

source: <code><a cbot|radar>radar</a></code> to detect your enemies (category <code><a object|ant>AlienAnt</a></code>) <code><a cbot|direct>direction</a></code> to calculate a direction <code><a cbot|dist>distance</a></code> to calculate a distance <code><a cbot|fire>fire</a></code> to fire your cannon <code><a cbot|wait>wait</a></code> to wait
cs: <code><a cbot|radar>radar</a></code> pro hledání nepřátel (kategorie <code><a object|ant>AlienAnt</a></code>) <code><a cbot|direct>direction</a></code> pro výpočet směrového úhlu <code><a cbot|dist>distance</a></code> pro výpočet vzdálenosti <code><a cbot|fire>fire</a></code> pro výstřel z kanónu <code><a cbot|wait>wait</a></code> pro čekání

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
