Repository: badernageral/colobot-data
Catalog: help/object/po/*.po
Languages: cs

source: This huge insect is the mother of them all. It lays <a object|egg>eggs</a> and from these eggs will hatch all the various kinds of insects <a object|human>you</a>'re likely to encounter. All of them are extremely hazardous to yourself and your mission. The queen's protective shell is particularly resistant to attack.
cs: Tento obří hmyz je matkou všech vetřelců. Klade <a object|egg>vajíčka</a>, ze kterých se pak líhnou všechny ostatní druhy hmyzu, na které během své výpravy narazíte. Veškerý hmyz představuje vážné nebezpečí pro <a object|human>Vás</a> i Vaši misi. Královnin krunýř je zvláště odolný vůči zbraním.

source: <a object|ant>ants</a>
cs: <a object|ant>mravenci</a>

source: <a object|spider>spiders</a>
cs: <a object|spider>pavouci</a>

source: <a object|wasp>wasps</a>
cs: <a object|wasp>vosy</a>

source: <a object|worm>worms</a>
cs: <a object|worm>červi</a>

source: Nest
cs: Hnízdo

source: The alien nest is an odd structure out of which <a object|bullet>organic matter</a> erupts on a regular basis. <a object|wasp>Wasps</a> visit nests regularly to collect ammunition that they will use to bombard your bots, buildings and yourself.
cs: Vetřelčí hnízdo je podivná struktura, která v pravidelných intervalech produkuje <a object|bullet>organickou hmotu</a>. <a object|wasp>Vosy</a> se pravidelně vracejí do hnízda, aby si nabraly čerstvou munici na bombardování Vašich robotů, budov i Vás osobně.

source: <button 170/> Nuclear Plant
cs: <button 170/> Jaderná elektrárna

source: The nuclear plant is a <a object|atomic>nuclear power cell</a> factory. It transforms a chunk of <a object|uranore>uranium ore</a> into a <a object|atomic>nuclear power cell</a> fully charged and ready for use.
cs: Jaderná elektrárna je továrna na <a object|atomic>jaderné baterie</a>. Z kusu <a object|uranore>uranové rudy</a> vyrobí plně nabitou <a object|atomic>jadernou baterii</a> připravenou k okamžitému použití.

source: Uranium ore.
cs: Uranová ruda.

source: Nuclear power cell.
cs: Jaderná baterie.

source: 30 seconds.
cs: 30 sekund.

source: Regular Power Cell
cs: Běžná baterie

source: A power cell supplies the bots and a few buildings with energy.
cs: Baterie slouží jako zdroj energie pro roboty a některé budovy.

source: An entirely red power cell is empty. The green section indicates the remaining capacity. A power cell can be recharged using a <a object|station>power station</a>. A <a object|energy>power plant</a> is needed to produce a new and fully charged power cell.
cs: Úplně červená baterie je zcela vybitá. Zelená plocha znázorňuje množství zbývající energie. Baterii lze dobít na <a object|station>nabíječce</a>. Pro výrobu nových plně nabitých baterií je potřeba <a object|energy>továrna na baterie</a>.

source: The capacity of a regular power cell is 100 times smaller than that of a <a object|atomic>nuclear power cell</a> produced by a <a object|nuclear>nuclear plant</a> using <a object|uranore>uranium ore</a>.
cs: Běžné baterie mají stokrát menší kapacitu než <a object|atomic>jaderné baterie</a>, které se vyrábí v <a object|nuclear>jaderné elektrárně</a> z <a object|uranore>uranové rudy</a>.

source: The radar indicates the direction of the nearest <a object|mother>enemy</a>. Moreover, the information given by the radar allows the mini-map at the bottom right corner of your screen to show the position of all bots, buildings and enemies as small squares and triangles of different colors.
cs: Radar ukazuje směr k nejbližšímu <a object|mother>nepříteli</a>. Informace z radaru navíc umožňují zobrazit na minimapě v pravém dolním rohu obrazovky polohu všech robotů, budov a nepřátel v podobě různobarevných čtverečků a trojúhelníčků.

source: Radar stations also act as relays for communication with the Earth from distant planets.
cs: Radarové stanice také slouží pro přenos komunikačního signálu mezi Zemí a vzdálenými planetami.

source: Information for the mini-map.
cs: Informace pro minimapu.

source: Constant.
cs: Neustálá.

source: <button 169/> Repair Center
cs: <button 169/> Opravna

source: The repair center regenerates the shield on damaged bots. A bot's shield will absorb a certain amount of <a object|mother>enemy</a> hits. If there is no shield left, this means that the bot itself, when hit next, will be destroyed.
cs: Opravna obnovuje ochranný štít poškozených robotů. Štíty robotů dokáží pohltit určitý počet <a object|mother>nepřátelských</a> útoků. Když robotům štít dojde, další zásah je zničí.

source: Damaged bot.
cs: Poškozený robot.

source: Repaired bot with regenerated shield.
cs: Opravený robot s obnoveným štítem.

source: A few seconds depending on the repair job to be done.
cs: Několik sekund v závislosti na rozsahu opravy.

source: <button 163/> Research Center
cs: <button 163/> Výzkumná stanice

source: The research center is an enormous computer. Its most useful feature is its ability to come up with new technologies as well as improvements on existing ones regarding buildings and bots in particular.
cs: Výzkumná stanice je obrovský počítač. Její nejužitečnější funkcí je vytváření nových a vylepšování již známých technologií týkajících se budov a zvláště robotů.

source: The 65'536 processors it contains use up a large amount of energy. Each research program necessitates a brand new and fully charged <a object|power>power cell</a>
cs: Uvnitř je 65 536 procesorů, které mají značnou spotřebu energie. Na spuštění každého výzkumného programu je třeba nová plně nabitá <a object|power>baterie</a>.

source: Any flat surface of at least 5 meters wide.
cs: Libovolná rovná plocha široká alespoň 5 metrů.

source: Request for research.
cs: Požadavek na výzkum.

source: Regular or nuclear power cell.
cs: Bežná nebo jaderná baterie.

source: Between 9 seconds and 1 minute depending on the research.
cs: 9 sekund až 1 minuta v závislosti na výzkumném programu.

source: Ruin
cs: Trosky

source: A ruin is what's left of a building after it has been disabled by a <a object|spider>spider</a> or by friendly fire.
cs: Trosky jsou zbytek budovy, která byla zničena <a object|spider>pavouky</a> nebo palbou do vlastních řad.

source: It can't be converted back into a reusable <a object|titan>titanium cube</a>.
cs: Nelze je zrecyklovat na znovu použitelnou <a object|titan>kostku titanu</a>.

source: <button 175/> Vault
cs: <button 175/> Trezor

source: This dome-shaped building was conceived by the first expedition. Its purpose was to offer protection to a new type of advanced bot. To protect it from insect attacks, the vault was locked by 4 <a object|key>keys</a>. Only after you find the 4 keys and place each one of them on their corresponding slots will you be given access to the bot.
cs: Tuto kopulovitou budovu vytvořila první výprava. Jejím účelem je chránit nový typ pokročilého robota před útoky vetřelců. Trezor byl proto uzamčen pomocí 4 <a object|key>klíčů</a>. K robotu uvnitř získáte přístup teprve až najdete všechny 4 klíče a umístíte je na příslušné podstavce.

source: Spider
cs: Pavouk

source: Spiders work like suicide commandoes: whenever a spider gets within a close enough range of its target, it inflates its abdomen and bursts into a multitude of tiny burning fragments. These fragments will set fire to everything they get in contact with. Luckily the spider won't survive.
cs: Pavouci útočí jako sebevražedné komando: když se pavouk dostane dost blízko k cíli, nafoukne břicho a vybuchne ve spršku drobných žhavých úlomků. Tyto úlomky zapálí vše, čeho se dotknou. Pavouk sám naštěstí nepřežije.

source: Starting Pad
cs: Startovní značka

source: The starting pad is a platform used in some exercises.
cs: Startovní značka je plošinka používaná v některých cvičeních.

source: <button 164/> Power Station
cs: <button 164/> Nabíječka

source: The power station extracts energy from the underground and recharges <a object|power>regular power cells</a> through induction. To recharge a power cell loaded at the back of a bot, just move the bot to the center of the platform and wait a few seconds. A <a object|power>power cell</a> carried at arm's length can also be recharged. <a object|atomic>Nuclear power cells</a> are non-rechargeable.
cs: Nabíječka čerpá energii z podzemních zdrojů a nabíjí <a object|power>běžné baterie</a> pomocí indukce. Pro nabití baterie ve zdířce v zadní části robota jednoduše dojeďte doprostřed plošinky a počkejte několik sekund. Nabíjet lze i <a object|power>baterie</a>, které roboti drží v drapáku. <a object|atomic>Jaderné baterie</a> nabíjet nelze.

source: A power plant needs some energy in the subsoil. If the satellite report says that energy is available only at some places, you will need a <a object|botsr>sniffer bot</a> to prospect the subsoil. The marks it lays down provide information about the specifics of its findings: a <a object|enerspot>green cross</a> means that there is an energy deposit at this location beneath the surface, which is indispensable to the construction of a power station or a <a object|energy>power plant</a>.
cs: Nabíječka vyžaduje podzemní zdroj energie. Pokud satelitní průzkum hlásí, že se zdroje energie vyskytují jen v omezeném prostoru, budete je muset najít pomocí <a object|botsr>detektoru</a>. Detektor za sebou nechává značky, podle kterých zjistíte druh nalezených podzemních zdrojů: <a object|enerspot>zelený křížek</a> znamená, že na daném místě je pod povrchem zdroj energie, který je nezbytný pro stavbu nabíječky nebo <a object|energy>továrny na baterie</a>.

source: The large power cell at the top of the station remaining red after the construction is completed can only mean that the site is not geologically adequate.
cs: Pokud po postavení této budovy zůstane velká zabudovaná baterie natrvalo červená, znamená to, že nabíječka stojí na geologicky nevhodném místě.

source: Any flat and geologically adequate surface at least 6 meters wide.
cs: Libovolná rovná plocha s vhodným geologickým podložím široká alespoň 6 metrů.

source: Empty power cell.
cs: Prázdná baterie.

source: Recharged power cell.
cs: Nabitá baterie.

source: A few seconds, depending on the capacity to be recharged.
cs: Několik sekund v závislosti na stavu nabíjené baterie.

source: Underground Titanium Deposit
cs: Podzemní titanové ložisko

source: A red cross reveals the presence of a stratum of <a object|titanore>titanium ore</a> in the subsoil. It will be possible to extract it using a <a object|derrick>derrick</a>.
cs: Červený křížek značí přítomnost podzemní vrstvy <a object|titanore>titanové rudy</a>. Lze ji vytěžit pomocí <a object|derrick>vrtné věže</a>.

source: A <a object|botsr>sniffer</a> will lay down a red cross each time it uncovers a deposit. <a object|botsr>Sniffer bots</a> can also detect the presence of <a object|uranore>uranium ore</a> as indicated by a <a object|uranspot>yellow circle</a> and of energy as indicated by a <a object|enerspot>green cross</a>.
cs: Kdykoliv <a object|botsr>detektor</a> objeví titanové ložisko, označí ho červeným křížkem. <a object|botsr>Detektory</a> dále mohou zjistit přítomnost <a object|uranore>uranové rudy</a> označované <a object|uranspot>žlutým kolečkem</a> nebo zdroje energie označovaného <a object|enerspot>zeleným křížkem</a>.

source: Titanium
cs: Titan

source: Titanium is indispensable for the construction of buildings, <a object|factory>bots</a> and <a object|energy>regular power cells</a>. There is usually some left on the <a object|base>spaceship</a> when you embark on a new mission.
cs: Titan je nezbytný pro stavbu budov a výrobu <a object|factory>robotů</a> a <a object|energy>běžných baterií</a>. Na začátku většiny misí budete mít pár kusů v <a object|base>raketě</a>.

source: If more is needed, you'll have to <a object|convert>convert</a> chunks of <a object|titanore>titanium ore</a> into usable titanium cubes.
cs: Pokud budete potřebovat více, budete muset z hrud <a object|titanore>titanové rudy</a> <a object|convert>vyrobit</a> použitelné kostky titanu.

source: Titanium Ore
cs: Titanová ruda

source: <a object|titan>Titanium</a> is indispensable for the construction of buildings, <a object|factory>bots</a> and <a object|energy>regular power cells</a>. The titanium <a object|human>you</a> see in its usable, cube shaped form has been <a object|convert>converted</a> from raw chunks of titanium ore.
cs: <a object|titan>Titan</a> je nezbytný pro stavbu budov a výrobu <a object|factory>robotů</a> a <a object|energy>běžných baterií</a>. Čistý titan, se kterým se setkáte v podobě snadno použitelné krychle, byl <a object|convert>vyroben</a> z hrud surové titanové rudy.

source: Titanium ore can be found either directly on the surface or in the subsoil. In the latter case, it needs to be first located and identified by a <a object|botsr>sniffer</a>, then extracted using a <a object|derrick>derrick</a>. If a sniffer identifies a titanium ore deposit, it lays down a <a object|stonspot>red cross</a>.
cs: Titanovou rudu můžete najít buď přímo na povrchu, nebo pod povrchem. V druhém případě ji budete muset nejprve najít pomocí <a object|botsr>detektoru</a>, a pak vytěžit pomocí <a object|derrick>vrtné věže</a>. Když detektor objeví ložisko titanové rudy, označí ho <a object|stonspot>červeným křížkem</a>.

source: Explosive (TNT)
cs: Výbušniny (TNT)

source: A TNT charge is extremely sensitive. You should approach it with caution so as not to hit it or give it any kind of shock. The risk is minimized once the explosive is within a <a object|botgr>grabber</a>'s grasp.
cs: Nálož TNT je extrémně citlivá. Musíte s ní zacházet zvláště opatrně a dávat si pozor na nárazy a otřesy. Výbušnina v pevném sevření drapáku <a object|botgr>robotického ramena</a> není příliš nebezpečná.

source: <button 165/> Defense Tower
cs: <button 165/> Obranná věž

source: The tower constitutes the best defense against <a object|mother>enemy</a> attacks, whether they originate on the ground or from the skies.
cs: Tato věž představuje nejlepší obranu proti <a object|mother>nepřátelským</a> útokům, jak po zemi, tak ze vzduchu.

source: The tower requires either a <a object|power>regular</a> or a <a object|atomic>nuclear</a> power cell. A regular power cell provides a capacity for 8 shots. A nuclear power cell is of course preferable. The tower starts blinking when it runs out of power.
cs: Věž vyžaduje buď <a object|power>běžnou</a>, nebo <a object|atomic>jadernou</a> baterii. Běžná baterie vystačí na 8 výstřelů. Jaderná baterie je samozřejmě vhodnější. Když věži dochází energie, začne blikat.

source: The range is 40 meters. To visualize it, select the tower then hit the <range> button <button 41/>. Red dots outline the circular zone for 20 seconds.
cs: Dostřel je 40 metrů. Pro jeho zobrazení vyberte věž a stiskněte tlačítko Dosah <button 41/>. Kruhová oblast se na 20 sekund vyznačí pomocí malých červených teček.

source: Any flat surface of at least 3.5 meters wide.
cs: Libovolná rovná plocha široká alespoň 3,5 metru.

source: Uranium Ore
cs: Uranová ruda

source: Uranium ore is essential to the production of <a object|atomic>nuclear power cells</a>.
cs: Uranová ruda je nezbytná pro výrobu <a object|atomic>jaderných baterií</a>.

source: It is to be found on the surface or in the subsoil. In the latter case, it needs to be first located and identified by a <a object|botsr>sniffer</a>, then extracted using a <a object|derrick>derrick</a>. If a sniffer identifies a deposit of uranium ore, it lays down a <a object|uranspot>yellow circle</a>.
cs: Můžete ji najít na povrchu nebo pod povrchem. V druhém případě ji budete muset nejprve najít pomocí <a object|botsr>detektoru</a>, a pak vytěžit pomocí <a object|derrick>vrtné věže</a>. Když detektor objeví ložisko uranové rudy, označí ho <a object|uranspot>žlutým kolečkem</a>.

source: A <a object|nuclear>nuclear plant</a> will then take care of converting the chunk into a new and fully charged <a object|atomic>nuclear power cell</a>.
cs: <a object|nuclear>Jaderná elektrárna</a> pak z kusu rudy vyrobí novou plně nabitou <a object|atomic>jadernou baterii</a>.

source: All <a object|botgr>grabbers</a>. Due to its radioactivity, the <a object|human>astronaut</a> can not transport it.
cs: Všechna <a object|botgr>robotická ramena</a>. Kvůli radioaktivitě ji nemůže nosit <a object|human>kosmonaut</a>.

source: Underground Uranium Deposit
cs: Podzemní uranové ložisko

source: A yellow circle reveals the presence of a stratum of <a object|uranore>uranium ore</a> in the subsoil. It will be possible to extract it using a <a object|derrick>derrick</a>.
cs: Žluté kolečko značí přítomnost podzemní vrstvy <a object|uranore>uranové rudy</a>. Lze ji vytěžit pomocí <a object|derrick>vrtné věže</a>.

source: A <a object|botsr>sniffer</a> will lay down a yellow circle each time it uncovers a deposit. <a object|botsr>Sniffer bots</a> can also detect the presence of <a object|titanore>titanium ore</a> as indicated by a <a object|stonspot>red cross</a> and of energy as indicated by a <a object|enerspot>green cross</a>.
cs: Kdykoliv <a object|botsr>detektor</a> objeví uranové ložisko, označí ho žlutým kolečkem. <a object|botsr>Detektory</a> dále mohou zjistit přítomnost <a object|titanore>titanové rudy</a> označované <a object|stonspot>červeným křížkem</a> nebo zdroje energie označovaného <a object|enerspot>zeleným křížkem</a>.

source: Wasp
cs: Vosa

source: The wasp is a formidable enemy, very hard to shoot down since its flying is particularly swift. Wasps carry balls of <a object|bullet>organic matter</a> that they will hurl at your bots and buildings and at yourself from above.
cs: Vosa je obávaný nepřítel, který velmi obratně létá, takže ji je těžké trefit. Vosy sbírají kusy <a object|bullet>organické hmoty</a>, které pak z výšky vrhají na Vaše roboty, budovy i Vás osobně.

source: The <a object|tower>defense tower</a> is the easiest way to get rid of them.
cs: Nejlepší ochranu proti nim představuje <a object|tower>obranná věž</a>.

source: Checkpoint
cs: Kontrolní bod

source: In the exercises, blue crosses indicate positions that have to be crossed. They disappear as soon as a <a object|bottr>practice bot</a> crosses them.
cs: Ve cvičných misích označují modré křížky místa, přes která musíte přejet. Když přes ně <a object|bottr>cvičný robot</a> přejede, modré křížky zmizí.

source: Worm
cs: Červ

source: Worms transmit viruses to programmed bots. The virus alters the programming to such an extent that the bot either functions in a very erratic way or stops functioning altogether.
cs: Červi přenášejí viry, kterými se mohou nakazit naprogramovaní roboti. Virus přepíše část programu robota tak, že se robot začne chovat nepředvídatelně nebo úplně přestane fungovat.

source: Worms live in the subsoil but sometimes emerge and crawl on the surface. When they are underground they are undetectable and indestructible.
cs: Červi žijí v zemi, ale čas od času vylezou na povrch a plazí se po zemi. Když jsou pod povrchem, nelze je zaměřit radarem ani zranit.

source: Derelict bot
cs: Vrak robota

source: A derelict bot is what's left of a bot after it has been disabled by a <a object|spider>spider</a> or by friendly fire.
cs: Vrak je zbytek robota, který byl zničen <a object|spider>pavouky</a> nebo palbou do vlastních řad.

source: A <a object|botrecy>recycler</a> can convert a derelict bot back into a reusable <a object|titan>titanium cube</a>.
cs: <a object|botrecy>Recyklátor</a> může z vraku vyrobit znovu použitelnou <a object|titan>kostku titanu</a>.

source: It gives birth to the following insects :
cs: Z jejích vajec se líhnou následující druhy hmyzu:

source: <button 169/> Destroyer
cs: <button 169/> Drtič

source: This building was designed to destroy objects. The object just needs to be placed at the center of the platform and the button can be pressed. The destroyer takes care of the rest.
cs: Tato budova byla vytvořena k ničení předmětů. Stačí jen položit předmět doprostřed plošinky a stiknout tlačítko. Drtič zařídí zbytek.

source: Object that is no longer needed.
cs: Nepotřebný předmět.

source: Satisfaction.
cs: Uspokojení.

source: 5 seconds.
cs: 5 sekund.

source: <a cbot>CBOT Language</a>, <a cbot|type>variables</a> and <a cbot|category>categories</a>.
cs: <a cbot>Jazyk CBOT</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Target2
cs: Kontrolní bod pro létající roboty

source: Target1
cs: Cvičná brána pro létající roboty

source: These buildings appear in the flying exercise missions and their height can vary. In the center <a object|target2>Target2</a> is placed.
cs: S těmito budovami se setkáte ve cvičných misích při nácviku létání. Mají nastavitelnou výšku a uprostřed kruhové brány bývá umístěn <a object|target2>kontrolní bod</a>.

source: In the flying exercise missions, brown crosses indicate positions that have to be crossed by a winged bot. They disappear as soon as a bot flies through them. They are placed in the center of the <a object|target1>Target1</a> building.
cs: Hnědé křížky ve cvičných misích označují bod, kterým musí proletět létající robot. Když se jich robot dotkne, hnědé křížky zmizí. Bývají umístěny uprostřed <a object|target1>cvičné brány</a>.
