Repository: badernageral/colobot-data
Catalog: help/object/po/*.po
Languages: cs

source: Ant
cs: Mravenec

source: Ants shoot tiny corrosive balls that eventually gnaw into the protective shielding of bots and buildings, causing them to explode.
cs: Mravenci střílí malé žíravé kuličky, které postupně poškozují ochranný štít robotů a budov, až nakonec způsobí jejich výbuch.

source: <a object|human>You</a> can resist their attack much longer than most buildings and bots, and your protective shield will be restored as your wounds heal. However, if you stay too long in their range or if there are too many of them, your life is in great danger.
cs: <a object|human>Vy</a> jste proti jejich útoku mnohem odolnější než většina budov a robotů a Váš ochranný štít se sám doplní stejně, jako se Vám hojí zranění. Jenže když v dostřelu mravenců zůstanete příliš dlouho nebo jich kolem bude příliš mnoho, Váš život bude ve velkém nebezpečí.

source: Object <a cbot|category>Category</a>
cs: <a cbot|category>Kategorie</a> objektu

source: See also
cs: Užitečné odkazy

source: <a cbot>CBOT Language</a>, <a cbot|type>Variables</a> and <a cbot|category>Categories</a>.
cs: <a cbot>Jazyk CBOT</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Nuclear Power Cell
cs: Jaderná baterie

source: A nuclear power cell supplies the bots and some buildings with energy. Its capacity is 100 times that of a <a object|power>regular power cell</a>.
cs: Jaderná baterie slouží jako zdroj energie pro roboty a některé budovy. Má stokrát větší kapacitu než <a object|power>běžná baterie</a>.

source: Nuclear power cells cannot be recharged or recycled. A <a object|nuclear>nuclear plant</a> and some <a object|uranore>uranium ore</a> is needed to produce a new and fully charged nuclear power cell.
cs: Jaderné baterie nelze nabíjet ani recyklovat. Pro výrobu nové plně nabité jaderné baterie potřebujete <a object|nuclear>jadernou elektrárnu</a> a trochu <a object|uranore>uranové rudy</a>.

source: Transport
cs: Přeprava

source: All <a object|botgr>grabbers</a> and the <a object|human>astronaut</a>.
cs: Všechna <a object|botgr>robotická ramena</a> a <a object|human>kosmonaut</a>.

source: Barrier
cs: Zátaras

source: The barrier is nothing more than an obstacle used in the exercises.
cs: Zátaras není nic víc než překážka používaná ve cvičných misích.

source: <button 171/> Spaceship
cs: <button 171/> Raketa

source: <a object|human>Your</a> means of transportation from one planet to the next, the only way to travel safely across the cosmos and accomplish your missions.
cs: <a object|human>Váš</a> meziplanetární dopravní prostředek, jediná možnost, jak bezpečně cestovat vesmírem a dokončit všechny mise.

source: In addition to yourself, the spaceship can carry bots and raw materials. Whenever a mission is completed, you must select the spaceship, then click on the <takeoff> command <button 28/>.
cs: Kromě Vás mohou v raketě cestovat i roboti a suroviny. Když dokončíte misi, musíte vybrat raketu a kliknout na tlačítko Odlet <button 28/>.

source: Black Box
cs: Černá skříňka

source: A black box is actually orange so as to be easier to identify and locate. Each <a object|base>spaceship</a> is equipped with a black box that records and stores information about the flight.
cs: Černá skříňka je ve skutečnosti oranžová, aby ji šlo snáze najít. Každá <a object|base>raketa</a> je vybavena černou skříňkou, která zaznamenává informace o letu.

source: A black box can also be used to leave important information. On every planet the first expedition has left a black box containing the coordinates of the planet it was heading towards next.
cs: Černou skříňku lze také využít jako schránku na důležité informace. První výprava nechala na každé planetě černou skříňku obsahující souřadnice další planety, kterou letěla prozkoumat pak.

source: Organic Matter
cs: Organická hmota

source: The organic matter is the insects' secretion. <a object|wasp>Wasps</a> often use balls of organic matter to bombard you. You should perhaps try to get hold of some since it could allow you, given the necessary <a object|labo>analysis</a>, to discover new and strange technologies that will improve the efficiency of your bots.
cs: Organická hmota je výměšek hmyzu. <a object|wasp>Vosy</a> na Vás často budou házet kuličky organické hmoty jako bomby. Možná byste se měli pokusit získat vzorek, protože její <a object|labo>analýzou</a> třeba objevíte nečekané nové technologie, které zvýší efektivitu Vašich robotů.

source: <button 174/> Power Captor
cs: <button 174/> Hromosvod

source: The power captor acts as both a lightning conductor and a power converter. It offers protection within a radius of 50 meters against the perilous lightning bolts of magnetic storms. Additionally, when the captor is hit by lightning, all bots and <a object|power>power cells</a> placed underneath, with the exception of the <a object|atomic>nuclear power cells</a>, are recharged.
cs: Hromosvod funguje zároveň jako ochrana před blesky i jako kolektor energie. Poskytuje ochranu před nebezpečnými blesky magnetických bouří v okruhu 50 metrů. Když je navíc hromosvod zasažen bleskem, <a object|power>baterie</a> všech robotů uvnitř (kromě <a object|atomic>jaderných baterií</a>) se nabijí.

source: To visualize the zone shielded by a power captor, select it then hit the <range> button <button 41/>. Red dots outline the circular zone for 20 seconds.
cs: Pro zobrazení oblasti chráněné hromosvodem stiskněte tlačítko Dosah <button 41/>. Kruhová oblast se na 20 sekund vyznačí pomocí malých červených teček.

source: In the vastness of space, few planets suffer from magnetic storms. Among the ones you'll be visiting, only Orpheon is subject to this phenomenon.
cs: V hlubinách vesmíru zuří magnetické bouře jen na několika málo planetách. Orfeon bude na Vaší výpravě jedinou planetou, kde se s tímto jevem setkáte.

source: Note that your <a object|base>spaceship</a> can also act as a lightning conductor. However it will not recharge power cells.
cs: Pamatujte, že Vaše <a object|base>raketa</a> také funguje jako hromosvod. Bohužel ale nedobíjí baterie.

source: Requirements for building
cs: Požadavky pro stavbu

source: Any flat surface of at least 10 meters wide.
cs: Libovolná rovná plocha široká alespoň 10 metrů.

source: Power source
cs: Zdroj energie

source: Lightning bolts.
cs: Blesky.

source: Duration of operation
cs: Doba činnosti

source: 1 second.
cs: 1 sekunda.

source: <button 162/> Converter
cs: <button 162/> Konvertor

source: This building was designed to convert chunks of <a object|titanore>titanium ore</a> into usable <a object|titan>titanium cubes</a>. All <a object|human>you</a> need to do is place a chunk at the center of the platform and step back. The converter takes care of the rest.
cs: Tato budova byla vytvořena pro zpracování kusů <a object|titanore>titanové rudy</a> na snadněji využitelné <a object|titan>kostky titanu</a>. <a object|human>Vy</a> musíte pouze položit kus rudy doprostřed plošinky a ustoupit stranou. Konvertor zařídí zbytek.

source: Any flat surface of at least 6 meters wide.
cs: Libovolná rovná plocha široká alespoň 6 metrů.

source: Input
cs: Vstup

source: Titanium ore.
cs: Titanová ruda.

source: Output
cs: Výstup

source: Titanium.
cs: Titan.

source: None.
cs: Žádný.

source: 15 seconds.
cs: 15 sekund.

source: <button 161/> Derrick
cs: <button 161/> Vrtná věž

source: The derrick is intended for the extraction of raw materials.
cs: Vrtná věž slouží k těžbě surovin.

source: In order to determine the best site on which to erect a derrick, a <a object|botsr>sniffer</a> should be used to prospect the subsoil. The marks it lays down provide information about the specifics of what the derrick will be able to extract:
cs: Pro nalezení nejvhodnějšího místa pro stavbu vrtné věže prozkoumejte podzemní zdroje pomocí <a object|botsr>detektoru</a>. Detektor za sebou nechává značky, podle kterých zjistíte, jaké suroviny bude moci vrtná věž těžit:

source: a <a object|stonspot>red cross</a> -> <a object|titanore>titanium ore</a>.
cs: <a object|stonspot>červený křížek</a> -> <a object|titanore>titanová ruda</a>.

source: a <a object|uranspot>yellow circle</a> -> <a object|uranore>uranium ore</a>.
cs: <a object|uranspot>žluté kolečko</a> -> <a object|uranore>uranová ruda</a>.

source: Any flat and geologically adequate surface of at least 2.5 meters wide.
cs: Libovolná rovná plocha s vhodným geologickým podložím široká alespoň 2,5 metru.

source: Titanium or uranium ore in the subsoil.
cs: Titanová nebo uranová ruda pod povrchem.

source: Chunks of titanium or uranium ore.
cs: Kusy titanové nebo uranové rudy.

source: 10 seconds for titanium and 30 for uranium.
cs: 10 sekund při těžbě titanu, 30 sekund při těžbě uranu.

source: Alien Egg
cs: Vetřelčí vejce

source: The alien eggs are laid by the <a object|mother>Alien Queen</a>. After a short time, they will hatch and an <a object|ant>ant</a>, a <a object|wasp>wasp</a>, a <a object|spider>spider</a> or a <a object|worm>worm</a> will come out.
cs: Vetřelčí vejce klade <a object|mother>královna vetřelců</a>. Po chvíli se z nich vylíhne <a object|ant>mravenec</a>, <a object|wasp>vosa</a>, <a object|spider>pavouk</a>, nebo <a object|worm>červ</a>.

source: <button 167/> Power Plant
cs: <button 167/> Továrna na baterie

source: The power plant is a <a object|power>power cell</a> factory. It transforms a <a object|titan>titanium cube</a> into a regular power cell fully charged and ready for use.
cs: Továrna na baterie vyrábí z <a object|titan>kostek titanu</a> plně nabité <a object|power>běžné baterie</a> připravené k okamžitému použití.

source: A power plant requires some energy in the subsoil. If the satellite report says that energy is available only at some places, you will need a <a object|botsr>sniffer bot</a> to prospect the subsoil. The marks it lays down provide information about the specifics of its findings: a <a object|enerspot>green cross</a> means that there is an energy deposit at this location beneath the surface, which is indispensable for the construction of a power plant or a <a object|station>power station</a>.
cs: Továrna na baterie vyžaduje podzemní zdroj energie. Pokud satelitní průzkum hlásí, že se zdroje energie vyskytují jen v omezeném prostoru, budete je muset najít pomocí <a object|botsr>detektoru</a>. Detektor za sebou nechává značky, podle kterých zjistíte druh nalezených podzemních zdrojů: <a object|enerspot>zelený křížek</a> znamená, že na daném místě je pod povrchem zdroj energie, který je nezbytný pro stavbu továrny na baterie nebo <a object|station>nabíječky</a>.

source: If the large power cell at the base of the plant remains red after the construction is completed, this means that the site is not geologically adequate.
cs: Pokud po postavení této budovy zůstane velká zabudovaná baterie natrvalo červená, znamená to, že továrna stojí na geologicky nevhodném místě.

source: Any flat and geologically adequate surface of at least 4 meters wide.
cs: Libovolná rovná plocha s vhodným geologickým podložím široká alespoň 4 metry.

source: Regular power cell.
cs: Běžná baterie.

source: Subsoil energy.
cs: Podzemní zdroj energie.

source: 12 seconds.
cs: 12 sekund.

source: Underground Energy Deposit
cs: Podzemní zdroj energie

source: Whenever a <a object|botsr>sniffer</a> uncovers a source of energy in the subsoil, it lays down a green cross. The following buildings can be erected nearby :
cs: Kdykoliv <a object|botsr>detektor</a> objeví podzemní zdroj energie, označí ho zeleným křížkem. Kolem něj pak můžete postavit následující budovy:

source: <a object|station>Power station</a>
cs: <a object|station>Nabíječku</a>

source: <a object|energy>Power plant</a>
cs: <a object|energy>Továrnu na baterie</a>

source: In order to prospect the subsoil you need a <a object|botsr>sniffer bot</a>, which can also discover <a object|titanore>titanium ore</a> deposits (indicated by a <a object|stonspot>red cross</a>) or <a object|uranore>uranium ore</a> deposits (indicated by a <a object|uranspot>yellow circle</a>).
cs: Pro hledání podzemních zdrojů potřebujete <a object|botsr>detektor</a>, který dále dokáže najít ložiska <a object|titanore>titanové rudy</a> (označované <a object|stonspot>červeným křížkem</a>) nebo <a object|uranore>uranové rudy</a> (označované <a object|uranspot>žlutým kolečkem</a>).

source: Impossible.
cs: Nelze.

source: <button 172/> Information Exchange Post
cs: <button 172/> Komunikační stanice

source: This building stores digital information. A post can contain up to 10 pieces of information, each one referenced by a name. For example, a post can contain 3 informations:<c/> \tab;"Position.x" 23.45 \tab;"Position.y" -102.70 \tab;"Quantity" 3.00
cs: Tato budova slouží jako úložiště digitálních informací. Každá stanice může obsahovat až 10 různých informací označených názvem. Komunikační stanice například může obsahovat následující 3 informace:<c/> \tab;"Pozice.x" 23.45 \tab;"Pozice.y" -102.70 \tab;"Mnozstvi" 3.00

source: To put new information, you must execute the command <code><a cbot|send>send</a></code>. To read information from a post, you must execute the command <code><a cbot|receive>receive</a></code>.
cs: Pro uložení nové informace musíte zavolat příkaz <code><a cbot|send>send</a></code>. Pro přečtení informace z komunikační stanice musíte zavolat příkaz <code><a cbot|receive>receive</a></code>.

source: Any flat surface of at least 2.5 meters wide.
cs: Libovolná rovná plocha široká alespoň 2,5 metru.

source: Digital information.
cs: Digitální informace.

source: <button 160/> Bot Factory
cs: <button 160/> Továrna na roboty

source: This building is intended for the manufacturing of bots using <a object|titan>titanium</a>.
cs: Tato budova slouží k výrobě robotů z <a object|titan>titanu</a>.

source: Place the titanium cube inside the factory.
cs: Vložte do továrny kostku titanu.

source: Step back out.
cs: Ustupte ven.

source: Select the factory.
cs: Vyberte továrnu.

source: Click on the button showing the diagram of the bot you want the factory to assemble (e.g. <button 137/> for a <a object|botgr>wheeled grabber</a>).
cs: Klikněte na tlačítko s ikonou robota, kterého chcete v továrně nechat vyrobit (např. <button 137/> pro <a object|botgr>pojízdné rameno</a>).

source: The finished bot does not include an onboard <a object|power>power cell</a>. You'll need to supply it with one for it to be able to leave the factory.
cs: Čerstvě vyrobený robot nebude mít ve zdířce žádnou <a object|power>baterii</a>. Tu mu budete muset donést, aby vůbec mohl vyjet ven z továrny.

source: The list of feasible bots will depend upon the research your <a object|research>research center</a> has completed at this time.
cs: Seznam vyrobitelných robotů bude záviset na již vyzkoumaných technologiích z <a object|research>výzkumné stanice</a>.

source: Any flat surface of at least 7.5 meters wide.
cs: Libovolná rovná plocha široká alespoň 7,5 metru.

source: Completed bot.
cs: Hotový robot.

source: Colored Flag
cs: Barevná vlajka

source: The colored flags are helpful to mark strategic locations or positions that <a object|human>you</a> will need to find again. Flags appear on the mini-map in the shape of a cross of the same color as the flag.
cs: Barevné vlajky se hodí k označování strategických oblastí nebo bodů, které budete potřebovat znovu najít. Vlajky se na minimapě zobrazují jako křížek stejné barvy jako vlajka.

source: Use the buttons <button 118/> and <button 119/> to plant and remove flags, the colors of which you can choose with the buttons above.
cs: Vlajku umístíte nebo odstraníte tlačítky <button 118/> a <button 119/>. Barvu vlajky zvolíte barevnými tlačítky nad nimi.

source: When your mini-map is out of order, the fact that flags follow the direction of the wind can help you to find your way and not to walk around in circles.
cs: Když Vám z nějakého důvodu nebude fungovat minimapa, vlajky Vám mohou pomoci s orientací, abyste se nemotali v kruhu, protože vždy směřují po větru.

source: When programming, you can use flags to give a bot a reference to a certain position: the instruction <code><a cbot|radar>radar</a></code> allows bots to know the exact position of a flag of a given color.
cs: Při programování můžete vlajky využít k označení určitého bodu: Příkaz <code><a cbot|radar>radar</a></code> umožňuje robotům zjistit přesnou polohu vlajky zadané barvy.

source: Finishing Pad
cs: Cílová značka

source: The finishing pad is an objective to be reached in some exercises.
cs: Cílová značka je místo, kam máte dojet v některých cvičeních.

source: <button 136/> Astronaut
cs: <button 136/> Kosmonaut

source: The astronaut is you within the game.
cs: Kosmonaut jste Vy v herním světě.

source: If you die, the mission immediately fails.
cs: Pokud zemřete, mise okamžitě skončí neúspěchem.

source: You can construct buildings with the help of the neutron gun holstered to your survival kit. The survival kit allows you, in most missions, to fly, thanks to the reactor placed underneath, or to swim with no time limit. You can carry most objects but the weight will slow down your movements considerably. Flying, swimming and walking underwater are also made impossible if you are carrying an object. The use of a <a object|botgr>grabber</a> or a <a object|botsub>subber</a> is advised for tasks such as these.
cs: Pomocí neutronové pistole, která je součástí Vašeho vybavení pro přežití, můžete stavět budovy. Vaše vybavení pro přežití Vám navíc umožňuje plavat bez omezení nebo létat ve většině misí díky tryskovému motoru ve spodní části. Můžete nosit většinu předmětů, ale jejich váha Vás značně zpomalí. S plnýma rukama dále nemůžete létat, plavat, ani chodit pod vodou. Pro dopravu předmětů je doporučeno využít <a object|botgr>robotická ramena</a> nebo <a object|botsub>ponorku</a>.

source: You cannot carry <a object|uranore>uranium ore</a> because of the risks attached to radioactivity.
cs: Kvůli nebezpečnému radioaktivnímu záření nemůžete nosit <a object|uranore>uranovou rudu</a>.

source: A special button <button 111/> allows you to ensure that the ground around you is flat. This is important since building is only possible on a flat surface. A flat surface is designated green while a sloping one is red.
cs: Speciální tlačítko <button 111/> Vám umožňuje zjistit, jestli je okolní terén dostatečně rovný. Budete to potřebovat, protože budovy lze stavět pouze na rovném povrchu. Rovný terén se zvýrazní zeleně, zatímco nakloněný terén se zvýrazní červeně.

source: A button <button 118/> allows you to mark a location with <a object|flag>flags</a> of various colors. This can help you not to get lost, to find important positions again, or to indicate a position to a bot. 5 flags of 5 different colors are at your disposal. You can remove a flag by using the next button <button 119/> and store it for further use.
cs: Tlačítko <button 118/> Vám umožňuje označit vybrané místo barevnou <a object|flag>vlajkou</a>. Díky tomu se můžete lépe orientovat, znovu najít důležitá místa nebo robotům označit určitý bod. Máte k dispozici vlajky 5 různých barev. Vlajku můžete odstranit sousedním tlačítkem <button 119/> a schovat si ji pro další použití.

source: <button 176/> Mission Control
cs: <button 176/> Řídící středisko

source: Earth control center for all <a object|human>your</a> space missions. Though still named after the well-known mission control of the old days, "Houston" is actually located in the middle of the Nevada Desert, the new center for space exploration activities.
cs: Pozemské řídící středisko pro celou <a object|human>Vaši</a> vesmírnou misi. Přestože se stále jmenuje "Houston" po slavném řídícím středisku z minulosti, ve skutečnosti se nachází v Nevadské poušti, novém centru vesmírného výzkumu.

source: The Mission Control Center watches over you day and night, and a whole team of scientists and engineers are working hard trying to find a solution to all the problems that you encounter.
cs: Řídící středisko na Vás dohlíží dnem i nocí a celý tým vědců a inženýrů tvrdě pracuje na řešení všech problémů, na které narazíte.

source: Keys A, B, C and D
cs: Klíče A, B, C a D

source: The keys give <a object|human>you</a> access to the <a object|safe>vault</a>. You'll need 4 of them.
cs: Klíče <a object|human>Vám</a> otevřou přístup do <a object|safe>trezoru</a>. Budete potřebovat celkem 4 klíče.

source: Key A, blue and triangle-shaped
cs: Klíč A, modrý ve tvaru trojúhelníku

source: Key B, red and pentagon-shaped
cs: Klíč B, červený ve tvaru pětiúhelníku

source: Key C, green and shaped like a 6-pointed star
cs: Klíč C, zelený ve tvaru šesticípé hvězdy

source: Key D, yellow and circular
cs: Klíč D, žlutý kulatý

source: Objects <a cbot|category>Category</a>
cs: <a cbot|category>Kategorie</a> objektů

source: <code>KeyA</code>, <code>KeyB</code>, <code>KeyC</code> and <code>KeyD</code>
cs: <code>KeyA</code>, <code>KeyB</code>, <code>KeyC</code> a <code>KeyD</code>

source: <button 166/> Autolab
cs: <button 166/> Laboratoř

source: The lab is intended for the analysis of <a object|bullet>organic matter</a>. It will help <a object|human>you</a> become familiar with the insects' very own technology and perhaps even use it to your advantage. Place a chunk of <a object|bullet>organic matter</a> on the platform, select the lab, and click the button corresponding to the desired research program.
cs: Laboratoř slouží k analýze <a object|bullet>organické hmoty</a>. Pomůže <a object|human>Vám</a> pochopit technologie vetřelců a možná je i využít ve Váš prospěch. Položte kus <a object|bullet>organické hmoty</a> na podstavec, vyberte laboratoř a klikněte na tlačítko představující požadovaný výzkumný program.

source: Organic matter.
cs: Organická hmota.

source: New and improved technologies.
cs: Nové a vylepšené technologie.

source: 20 seconds.
cs: 20 sekund.

source: <code>< no archive picture available ></code>
cs: <code>< archivní obrázek není dostupný ></code>

source: The Lunar Jeep (LRV) was brought to the moon on July 30th 1971 by the astronauts David Scott and Jim Irwin from Apollo mission 15. Its batteries are still partly charged, which allows you to remote control it. But this old-fashioned technology will be of no use to you.
cs: Měsíční buginu (LRV) přivezli na Měsíc 30. července 1971 kosmonauté David Scott a Jim Irwin v rámci mise Apollo 15. V bateriích má stále trochu energie, takže ji můžete dálkově ovládat. Tento muzejní exponát pro Vás však nebude mít praktické využití.

source: Mine
cs: Mina

source: Mines were a defensive weapons system used by the first expedition. Because of the dangers this system causes for the mission itself, they are no longer used in your expedition. In some exercises mines are used to learn how to avoid obstacles. There is no way to remove them or to create new ones.
cs: Miny jsou obranný prostředek využívaný první výpravou. Jenže vzhledem k tomu, jaké představují riziko pro vlastní misi, byly z vybavení Vaší výpravy vyškrtnuty. V některých cvičeních se miny používají pro nácvik vyhýbání se překážkám. Miny nemůžete nijak zneškodnit ani vyrábět nové.

source: With a <a object|bottr>practice bot</a>, don't get any closer than 2 meters to the position given by the instruction <a cbot|radar>radar</a>.
cs: S <a object|bottr>cvičným robotem</a> se k souřadnicím miny vráceným příkazem <a cbot|radar>radar</a> nepřibližujte na méně než dva metry.

source: Alien Queen
cs: Královna vetřelců
