Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter002/level005/po/*.po
Languages: cs

source: Fighter Jet 2
cs: Stíhačka 2

source: Adapt the program to a mountainous terrain.
cs: Upravte program pro kopcovitý terén.

source: Move
cs: Stihacka2

source: Objective
cs: Úkol

source: Adapt the flying height of the <a object|botfj>winged shooter</a> to the terrain.
cs: Přizpůsobte letovou výšku <a object|botfj>létajícího kanónu</a> okolnímu terénu.

source: Here is one more time the program of the previous exercise that hunts ants:
cs: Zde je opět program na likvidaci mravenců z předchozího cvičení:

source: extern void object::JetFighter1() { object item; aim(-20); jet(0.2); while (position.z < 10) { wait(0.2); } jet(0); while (true) { while (radar(AlienAnt, 0, 360, 0, 20) == null) { item = radar(AlienAnt); turn(direction(item.position)); motor(1,1); wait(0.2); } fire(1); } }
cs: extern void object::Stihacka1() { object item; aim(-20); jet(0.2); while (position.z < 10) { wait(0.2); } jet(0); while (true) { while (radar(AlienAnt, 0, 360, 0, 20) == null) { item = radar(AlienAnt); turn(direction(item.position)); motor(1,1); wait(0.2); } fire(1); } }

source: The bot always stays at an altitude of 10m above sea level. This is not adapted to the mountainous terrain of the present exercise, the bot has got to adapt to the terrain. The best way to do so is to insert just before the <c/>wait(0.2);<n/> a test to see if the height above ground is too low or too high, and to react accordingly.
cs: Robot celou dobu poletí v nadmořské výšce 10 metrů. Kopcovitý terén v tomto cvičení ale neumožňuje let v této výšce, takže se robot musí terénu přizpůsobit. Nejjednodušší řešení je vložit před příkaz <c/>wait(0.2);<n/> kontrolu, jestli robot neletí příliš nízko nebo vysoko, a podle toho ovládat tryskový motor.

source: We already saw that <code>position.z</code> gives the altitude above sea level. <code><a cbot|topo>topo</a>(position)</code> gives the altitude of the ground at the position of the bot. If we want the bot to stay at an altitude between 6 and 9m above ground, we must treat the following cases: if <code>position.z-topo(position)</code> is smaller than 6, the bot must climb with <c/>jet(1);<n/>. If <code>position.z-topo(position)</code> is greater than 9, the bot must go down with <c/>jet(-1);<n/>. In order to program these tests, use the instruction <code><a cbot|if>if</a></code>, that executes the instructions in braces only once if the condition is true:
cs: Už jsme probírali, že <code>position.z</code> udává nadmořskou výšku robota. <code><a cbot|topo>topo</a>(position)</code> udává nadmořskou výšku terénu přímo pod robotem. Pokud chceme, aby robot létal ve výšce 6 až 9 metrů nad zemí, musíme ošetřit následující případy: pokud je <code>position.z-topo(position)</code> menší než 6, robot musí stoupat příkazem <c/>jet(1);<n/>. Pokud je <code>position.z-topo(position)</code> větší než 9, robot musí klesat příkazem <c/>jet(-1);<n/>. Pro naprogramování těchto podmínek použijte příkaz <code><a cbot|if>if</a></code>, který provede příkazy ve složených závorkách pouze jednou, pokud platí daná podmínka:

source: Before starting the testing, stabilize the altitude with <c/>jet(0);<n/>: in case the height above ground lies between 6 and 9m, the bot must neither climb nor go down. If afterwards either <c/>jet(1);<n/> or <c/>jet(-1);<n/> is executed, it will cancel the previous <c/>jet(0);<n/>.
cs: Před oběma podmínkami vyrovnejte výšku příkazem <c/>jet(0);<n/>: pokud je aktuální výška mezi 6 a 9 metry nad zemí, robot nesmí stoupat ani klesat. Když se hned poté provede příkaz <c/>jet(1);<n/> nebo <c/>jet(-1);<n/>, předchozí příkaz <c/>jet(0);<n/> se tím zruší.

source: Just insert these lines before the <code>wait(0.2)</code>, and the bot will adapt to the terrain. You can then delete the first lines of the program that set the initial altitude at 10m.
cs: Jednoduše vložte výše uvedený kód před příkaz <code>wait(0.2)</code> a robot bude za letu kopírovat terén. Pak můžete smazat cyklus na začátku programu, který robotovi přikazuje vystoupat do výšky 10m.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
