Repository: badernageral/colobot-data
Catalog: help/bots/po/*.po
Languages: cs

source: <button 144/> Tracked Shooter
cs: <button 144/> Pásový kanón

source: Tracked bot equipped with a fireball cannon.
cs: Pásový robot vybavený plazmovým kanónem.

source: The fireball cannon is an efficient weapon against most kinds of <a object|mother>enemies</a>. Use it sparingly though for it requires large amounts of energy. A <a object|power>regular power cell</a> will only allow you to shoot 4 fireball bursts.
cs: Plazmový kanón je účinná zbraň proti většině druhů <a object|mother>nepřátel</a>. Střílejte ale s rozmyslem, protože má značnou spotřebu energie. <a object|power>Běžná baterie</a> vystačí jen na 4 dávky plazmy.

source: Tip : it is possible to move the mouse while shooting, so as to sweep a larger area.
cs: Tip: Během palby můžete hýbat myší, abyste pokropili větší oblast.

source: Tracked bots can ascend steep inclinations but they are quite slow and use a lot of energy. On flat ground for short distances, a <a object|botfr>wheeled shooter</a> is a better option. When it is possible to build <a object|botfj>winged bots</a>, these represent the best solution for long distances.
cs: Pásoví roboti mohou vyjet i příkré svahy, ale jsou pomalí a mají velkou spotřebu energie. Na kratší vzdálenosti v rovném terénu se více hodí <a object|botfr>pojízdné kanóny</a>. Na velké vzdálenosti jsou pak ideální <a object|botfj>létající roboti</a>, pokud je můžete stavět.

source: Programming
cs: Programování

source: To program the bot's movements, use the following commands : <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|goto>goto</a></code>.
cs: Pro ovládání pohybu robota používejte následující příkazy: <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|goto>goto</a></code>.

source: To program the fireball cannon, use <code><a cbot|fire>fire</a></code>. To raise or lower the aim, use <code><a cbot|aim>aim</a></code>.
cs: Pro střelbu z kanónu používejte příkaz <code><a cbot|fire>fire</a></code>. Pro míření používejte příkaz <code><a cbot|aim>aim</a></code>.

source: Object <a cbot|category>Category</a>
cs: <a cbot|category>Kategorie</a> objektu

source: See also
cs: Užitečné odkazy

source: <a cbot>CBOT Language</a>, <a cbot|type>Variables</a> and <a cbot|category>Categories</a>.
cs: <a cbot>Jazyk CBOT</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: <button 145/> Winged Shooter
cs: <button 145/> Létající kanón

source: Jet propelled flying bot equipped with a fireball cannon.
cs: Létající robot s tryskovým pohonem vybavený plazmovým kanónem.

source: The display at the bottom of your screen indicates the temperature of the reactor. Keep an eye on it. If the reactor overheats, the engine will stop and the bot will crash.
cs: Měřič v dolní části obrazovky ukazuje teplotu reaktoru. Dávejte na ni pozor. Když se reaktor přehřeje, tryskový motor přestane fungovat a robot se zřítí na zem.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply is used up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botfr>wheeled shooter</a> instead.
cs: Létající roboti mohou létat přes přírodní překážky jako například hory nebo jezera, ale brzy jim dochází energie. Na zemi jsou pomalí. Na kratší vzdálenosti, kdy nemá cenu létat, se více hodí <a object|botfr>pojízdné kanóny</a>.

source: To program the bot's movements, use the following commands : <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|jet>jet</a></code>, <code><a cbot|goto>goto</a></code>.
cs: Pro ovládání pohybu robota používejte následující příkazy: <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|jet>jet</a></code>, <code><a cbot|goto>goto</a></code>.

source: <button 143/> Wheeled Shooter
cs: <button 143/> Pojízdný kanón

source: Wheeled bot equipped with a fireball cannon.
cs: Pojízdný robot na kolečkách vybavený plazmovým kanónem.

source: Wheels constitute a standard, fast and energy-saving mode of propulsion, which is perfectly adapted for a relatively flat terrain. Whenever the terrain gets sloped, it is advised to use a <a object|botfj>winged shooter</a> instead, or, if this is impossible, a <a object|botfc>tracked shooter</a>.
cs: Kolečka představují nejběžnější pohon s dobrou rychlostí a nízkou spotřebou energie, který se skvěle hodí do relativně rovného terénu. V hornatém terénu je doporučeno používat <a object|botfj>létající kanóny</a>, případně <a object|botfc>pásové kanóny</a>, pokud létající roboti nejsou k dispozici.

source: <button 151/> Legged Shooter
cs: <button 151/> Chodící kanón

source: Ant-legged creeping bot equipped with a fireball cannon.
cs: Šestinohý chodící robot vybavený plazmovým kanónem.

source: A moving legged shooter uses up half as much energy as a <a object|botfr>wheeled shooter</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
cs: Chodící kanón při pohybu spotřebovává jen polovinu energie oproti <a object|botfr>pojízdnému kanónu</a>. Chodící roboti navíc dokáží vyšplhat i po nejpříkřejších svazích.

source: <button 138/> Tracked Grabber
cs: <button 138/> Pásové rameno

source: Tracked bot equipped with an operating arm.
cs: Pásový robot vybavený manipulačním ramenem.

source: <button 32/> Grabs an object or lays it down again, at a position that is determined by one of the following options : <button 33/> The object is lying in front of the bot, on the ground or on the back of a second bot. <button 35/> The object is the bot's own power cell. <button 34/> The object is lying behind the bot, on the ground.
cs: <button 32/> Zvedne nebo položí předmět na místě určeném jedním z následujících přepínačů: <button 33/> Předmět leží před robotem na zemi nebo ve zdířce jiného robota. <button 35/> Předmět je robotova vlastní baterie. <button 34/> Předmět leží na zemi za robotem.

source: <a object|titanore>Titanium ore</a>.
cs: <a object|titanore>Titanová ruda</a>.

source: <a object|uranore>Uranium ore</a>.
cs: <a object|uranore>Uranová ruda</a>.

source: <a object|titan>Cube of titanium</a>.
cs: <a object|titan>Kostka titanu</a>.

source: <a object|power>Regular power cell</a>.
cs: <a object|power>Běžná baterie</a>.

source: <a object|atomic>Nuclear power cell</a>.
cs: <a object|atomic>Jaderná baterie</a>.

source: <a object|bbox>Black box</a>.
cs: <a object|bbox>Černá skříňka</a>.

source: <a object|key>Keys A, B, C, and D</a>.
cs: <a object|key>Klíče A, B, C a D</a>.

source: <a object|bullet>Organic matter</a>.
cs: <a object|bullet>Organická hmota</a>.

source: Tracked bots can ascend steep inclinations but they are quite slow and use much energy. On flat ground for short distances, a <a object|botgr>wheeled grabber</a> is a better option. When it is possible to build <a object|botgj>winged bots</a>, these represent the best solution for long distances.
cs: Pásoví roboti mohou vyjet i příkré svahy, ale jsou pomalí a mají velkou spotřebu energie. Na kratší vzdálenosti v rovném terénu se více hodí <a object|botgr>pojízdná ramena</a>. Na velké vzdálenosti jsou pak ideální <a object|botgj>létající roboti</a>, pokud je můžete stavět.

source: A grabber won't function underwater. What you'll need instead is a <a object|botsub>subber</a>.
cs: Robotická ramena nefungují pod vodou. Pro obojživelné operace budete potřebovat <a object|botsub>ponorku</a>.

source: To program the operating arm, use <code><a cbot|grab>grab</a></code> and <code><a cbot|drop>drop</a></code>.
cs: Pro ovládání manipulačního ramena používejte příkazy <code><a cbot|grab>grab</a></code> a <code><a cbot|drop>drop</a></code>.

source: <button 139/> Winged Grabber
cs: <button 139/> Létající rameno

source: Jet propelled flying bot equipped with an operating arm.
cs: Létající robot s tryskovým pohonem vybavený manipulačním ramenem.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply is used up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botgr>wheeled grabber</a> instead.
cs: Létající roboti mohou létat přes přírodní překážky jako například hory nebo jezera, ale brzy jim dochází energie. Na zemi jsou pomalí. Na kratší vzdálenosti, kdy nemá cenu létat, se více hodí <a object|botgr>pojízdná ramena</a>.

source: <button 137/> Wheeled Grabber
cs: <button 137/> Pojízdné rameno

source: Wheeled bot equipped with an operating arm.
cs: Pojízdný robot na kolečkách vybavený manipulačním ramenem.

source: <a object|titan>Converted titanium</a>.
cs: <a object|titan>Zpracovaný titan</a>.

source: <button 150/> Legged Grabber
cs: <button 150/> Chodící rameno

source: Ant-legged creeping bot equipped with an operating arm.
cs: Šestinohý chodící robot vybavený manipulačním ramenem.

source: A moving legged grabber uses up half as much energy as a <a object|botgr>wheeled grabber</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
cs: Chodící rameno při pohybu spotřebovává jen polovinu energie oproti <a object|botgr>pojízdnému ramenu</a>. Chodící roboti navíc dokáží vyšplhat i po nejpříkřejších svazích.

source: <button 154/> Tracked Orga Shooter
cs: <button 154/> Pásový biokanón

source: Tracked bot equipped with an orgaball cannon.
cs: Pásový robot vybavený biokanónem.

source: The orgaball cannon is more effective than the <a object|botfc>fireball cannon</a>. It shoots small spheres of corrosive <a object|bullet>organic matter</a>. A <a object|power>regular power cell</a> will allow you to shoot 11 orgaball bursts.
cs: Biokanón je účinnější než <a object|botfc>plazmový kanón</a>. Střílí malé kuličky žíravé <a object|bullet>organické hmoty</a>. <a object|power>Běžná baterie</a> vystačí na 11 dávek.

source: Tracked bots can ascend steep inclinations but they are quite slow and use a lot of energy. On flat ground for short distances, a <a object|botor>wheeled orga shooter</a> is a better option. When it is possible to build <a object|botoj>winged bots</a>, these represent the best solution for long distances.
cs: Pásoví roboti mohou vyjet i příkré svahy, ale jsou pomalí a mají velkou spotřebu energie. Na kratší vzdálenosti v rovném terénu se více hodí <a object|botor>pojízdné biokanóny</a>. Na velké vzdálenosti jsou pak ideální <a object|botoj>létající roboti</a>, pokud je můžete stavět.

source: To program the orgaball cannon, use <code><a cbot|fire>fire</a></code>. To raise or lower the aim, use <code><a cbot|aim>aim</a></code>.
cs: Pro střelbu z biokanónu používejte příkaz <code><a cbot|fire>fire</a></code>. Pro míření používejte příkaz <code><a cbot|aim>aim</a></code>.

source: <button 155/> Winged Orga Shooter
cs: <button 155/> Létající biokanón

source: Jet propelled flying bot equipped with an orgaball cannon.
cs: Létající robot s tryskovým pohonem vybavený biokanónem.

source: The orgaball cannon is more effective than the <a object|botfj>fireball cannon</a>. It shoots small spheres of corrosive <a object|bullet>organic matter</a>. A <a object|power>regular power cell</a> will allow you to shoot 11 orgaball bursts.
cs: Biokanón je účinnější než <a object|botfj>plazmový kanón</a>. Střílí malé kuličky žíravé <a object|bullet>organické hmoty</a>. <a object|power>Běžná baterie</a> vystačí na 11 dávek.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply is used up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botor>wheeled orga shooter</a> instead.
cs: Létající roboti mohou létat přes přírodní překážky jako například hory nebo jezera, ale brzy jim dochází energie. Na zemi jsou pomalí. Na kratší vzdálenosti, kdy nemá cenu létat, se více hodí <a object|botor>pojízdné biokanóny</a>.

source: <button 153/> Wheeled Orga Shooter
cs: <button 153/> Pojízdný biokanón

source: Wheeled bot equipped with an orgaball cannon.
cs: Pojízdný robot na kolečkách vybavený biokanónem.

source: The orgaball cannon is more effective than the <a object|botfr>fireball cannon</a>. It shoots small spheres of corrosive <a object|bullet>organic matter</a>. A <a object|power>regular power cell</a> will allow you to shoot 11 orgaball bursts.
cs: Biokanón je účinnější než <a object|botfr>plazmový kanón</a>. Střílí malé kuličky žíravé <a object|bullet>organické hmoty</a>. <a object|power>Běžná baterie</a> vystačí na 11 dávek.

source: Wheels constitute a standard, fast and energy-saving mode of propulsion, which is perfectly adapted for a relatively flat terrain. Whenever the terrain gets sloped, it is advised to instead use a <a object|botoj>winged orga shooter</a>, or, if this is impossible, a <a object|botoc>tracked orga shooter</a>.
cs: Kolečka představují nejběžnější pohon s dobrou rychlostí a nízkou spotřebou energie, který se skvěle hodí do relativně rovného terénu. V hornatém terénu je doporučeno používat <a object|botoj>létající biokanóny</a>, případně <a object|botoc>pásové biokanóny</a>, pokud létající roboti nejsou k dispozici.

source: <button 156/> Legged Orga Shooter
cs: <button 156/> Chodící biokanón

source: Ant-legged creeping bot equipped with an orgaball cannon.
cs: Šestinohý chodící robot vybavený biokanónem.

source: The orgaball cannon is more effective than the <a object|botfs>fireball cannon</a>. It shoots small spheres of corrosive <a object|bullet>organic matter</a>. A <a object|power>regular power cell</a> will allow you to shoot 11 orgaball bursts.
cs: Biokanón je účinnější než <a object|botfs>plazmový kanón</a>. Střílí malé kuličky žíravé <a object|bullet>organické hmoty</a>. <a object|power>Běžná baterie</a> vystačí na 11 dávek.

source: A moving legged orga shooter uses up half as much energy as a <a object|botor>wheeled orga shooter</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
cs: Chodící biokanón při pohybu spotřebovává jen polovinu energie oproti <a object|botor>pojízdnému biokanónu</a>. Chodící roboti navíc dokáží vyšplhat i po nejpříkřejších svazích.

source: <button 147/> Phazer Shooter
cs: <button 147/> Fázové dělo

source: Tracked bot equipped with a very powerful phazer cannon, efficient against most kinds of enemies. When you aim upward, it can shoot up to 60 meters. It is the only weapon that can kill the <a object|mother>Alien Queen</a>.
cs: Pásový robot vybavený velmi ničivým fázový dělem, které je účinné na většinu druhů nepřátel. Když zamíříte vzhůru, dokáže dostřelit až 60 metrů daleko. Je to jediná zbraň, která dokáže zabít <a object|mother>královnu vetřelců</a>.

source: To program the phazer cannon, use <code><a cbot|fire>fire</a></code>. To raise or lower the aim, use <code><a cbot|aim>aim</a></code>.
cs: Pro střelbu z fázového děla používejte příkaz <code><a cbot|fire>fire</a></code>. Pro míření používejte příkaz <code><a cbot|aim>aim</a></code>.

source: <button 148/> Recycler
cs: <button 148/> Recyklátor

source: Tracked bot designed to convert a <a object|wreck>derelict bot</a> back into a reusable <a object|titan>titanium cube</a>.
cs: Pásový robot vytvořený pro recyklaci <a object|wreck>vraků robotů</a> zpět na znovu použitelnou <a object|titan>kostku titanu</a>.

source: To program the recycling of a derelict bot, use <code><a cbot|recycle>recycle</a></code>.
cs: Pro recyklaci vraku robota v programu používejte příkaz <code><a cbot|recycle>recycle</a></code>.

source: <code>RecyclerBot</code>
cs: <code>Recycler</code>

source: <button 141/> Tracked Sniffer
cs: <button 141/> Pásový detektor

source: Tracked bot equipped to prospect the geological structure of the subsoil. Whenever it locates something of use, the sniffer lays down the following marks:
cs: Pásový robot vybavený zařízením pro hledání podzemních surovin. Kdykoliv detektor najde něco užitečného, položí na zem jednu z následujících značek:

source: a <a object|stonspot>red cross</a> -> <a object|titanore>titanium ore</a>.
cs: <a object|stonspot>červený křížek</a> -> <a object|titanore>titanová ruda</a>.

source: a <a object|uranspot>yellow circle</a> -> <a object|uranore>uranium ore</a>.
cs: <a object|uranspot>žluté kolečko</a> -> <a object|uranore>uranová ruda</a>.

source: a <a object|enerspot>green cross</a> -> energy deposit, useful for a <a object|station>power station</a> or a <a object|energy>power plant</a>.
cs: <a object|enerspot>zelený křížek</a> -> podzemní zdroj energie pro <a object|station>nabíječku</a> nebo <a object|energy>továrnu na baterie</a>.

source: Tracked bots can ascend steep inclinations but they are quite slow and use a lot of energy. On flat ground for short distances, a <a object|botsr>wheeled sniffer</a> is a better option. When it is possible to build <a object|botsj>winged bots</a>, these represent the best solution for long distances.
cs: Pásoví roboti mohou vyjet i příkré svahy, ale jsou pomalí a mají velkou spotřebu energie. Na kratší vzdálenosti v rovném terénu se více hodí <a object|botsr>pojízdné detektory</a>. Na velké vzdálenosti jsou pak ideální <a object|botsj>létající roboti</a>, pokud je můžete stavět.

source: To program the sniffing arm, use <code><a cbot|sniff>sniff</a></code>.
cs: Pro ovládání sondy detektoru používejte příkaz <code><a cbot|sniff>sniff</a></code>.

source: <button 157/> Shielder
cs: <button 157/> Mobilní štít

source: Tracked bot designed to protect and defend against all <a object|mother>enemy</a> attacks within a perimeter of 10 to 25 meters. The individual shields of bots and buildings are re-energized through the shielder's defensive actions. This bot is the only way to get through narrow passages adorned with poisonous green mushrooms.
cs: Pásový robot vytvořený na ochranu oblasti velké 10 až 25 metrů proti všem <a object|mother>nepřátelským</a> útokům. Aktivní silové pole dobíjí štíty robotů a budov v dosahu. Tento robot představuje jedinou možnost, jak se bezpečně dostat skrz úzké průsmyky plné jedovatých zelených hub.

source: A <a object|power>regular power cell</a> allows for a 20-second activity span with a radius of 25 meters, much too short in most cases. A <a object|atomic>nuclear power cell</a> is of course more suited to this bot.
cs: <a object|power>Běžná baterie</a> dokáže štít o poloměru 25 metrů napájet po dobu 20 sekund, což je většinou moc krátká doba. Pro tohoto robota jsou vhodnější <a object|atomic>jaderné baterie</a>.

source: The energy consumption is proportional to the radius of the protective sphere. With a radius of 10 meters, the bot can work 2.5 times longer than with the maximum radius of 25 meters.
cs: Spotřeba energie je přímo úměrná poloměru silového pole. Štít o poloměru 10 metrů vydrží fungovat 2,5krát déle než štít o maximálním poloměru 25 metrů.

source: To program the deployment of the shield, use <code><a cbot|shield>shield</a></code>.
cs: Pro ovládání generátoru silového pole používejte příkaz <code><a cbot|shield>shield</a></code>.

source: <button 142/> Winged Sniffer
cs: <button 142/> Létající detektor

source: Jet propelled flying bot equipped to prospect the geological structure of the subsoil. Whenever it locates something of use, the sniffer lays down the following marks:
cs: Létající robot s tryskovým pohonem vybavený zařízením pro hledání podzemních surovin. Kdykoliv detektor najde něco užitečného, položí na zem jednu z následujících značek:

source: The display at the bottom of your screen indicates the temperature of the reactor. Keep an eye on it. If the reactor overheats, the engine stops and the bot crashes.
cs: Měřič v dolní části obrazovky ukazuje teplotu reaktoru. Dávejte na ni pozor. Když se reaktor přehřeje, tryskový motor přestane fungovat a robot se zřítí na zem.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply uses up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botsr>wheeled sniffer</a> instead.
cs: Létající roboti mohou létat přes přírodní překážky jako například hory nebo jezera, ale brzy jim dochází energie. Na zemi jsou pomalí. Na kratší vzdálenosti, kdy nemá cenu létat, se více hodí <a object|botsr>pojízdné detektory</a>.

source: <button 140/> Wheeled Sniffer
cs: <button 140/> Pojízdný detektor

source: Wheeled bot equipped to prospect the geological structure of the subsoil. Whenever it locates something of use, the sniffer lays down the following marks:
cs: Pojízdný robot na kolečkách vybavený zařízením pro hledání podzemních surovin. Kdykoliv detektor najde něco užitečného, položí na zem jednu z následujících značek:

source: Wheels constitute a standard, fast and energy-saving mode of propulsion, which is perfectly adapted for a relatively flat terrain. Whenever the terrain gets sloped, it is advised to use a <a object|botsj>winged sniffer</a> instead, or, if this is impossible, a <a object|botsc>tracked sniffer</a>.
cs: Kolečka představují nejběžnější pohon s dobrou rychlostí a nízkou spotřebou energie, který se skvěle hodí do relativně rovného terénu. V hornatém terénu je doporučeno používat <a object|botsj>létající detektory</a>, případně <a object|botsc>pásové detektory</a>, pokud létající roboti nejsou k dispozici.

source: <button 152/> Legged Sniffer
cs: <button 152/> Chodící detektor

source: Ant-legged creeping bot equipped to prospect the geological structure of the subsoil. Whenever it locates something of use, the sniffer lays down the following marks:
cs: Šestinohý chodící robot vybavený zařízením pro hledání podzemních surovin. Kdykoliv detektor najde něco užitečného, položí na zem jednu z následujících značek:

source: A moving legged shooter uses up half as much energy as a <a object|botsr>wheeled sniffer</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
cs: Chodící detektor při pohybu spotřebovává jen polovinu energie oproti <a object|botsr>pojízdnému detektoru</a>. Chodící roboti navíc dokáží vyšplhat i po nejpříkřejších svazích.

source: <button 149/> Subber
cs: <button 149/> Ponorka

source: Amphibious tracked bot equipped with an operating claw. The subber is the only bot capable of moving and running operations underwater.
cs: Obojživelný pásový robot vybavený manipulačním klepetem. Ponorka je jediný robot, který se dokáže pohybovat a pracovat pod vodou.

source: It is best to check the <a object|power>power cell</a> readings prior to immersion since replacing or recharging it underwater is impossible. The subber can only pick up objects from the ground, as opposed to, for example, a battery from the back of another bot.
cs: Před ponořením nezapomeňte zkontrolovat stav <a object|power>baterie</a>, protože pod vodou ji nelze dobít ani vyměnit. Ponorka dokáže zvedat předměty pouze ze země, ne ze zdířky jiného robota.

source: To program the operating claw, use <code><a cbot|grab>grab</a></code> and <code><a cbot|drop>drop</a></code>.
cs: Pro ovládání manipulačního klepeta používejte příkazy <code><a cbot|grab>grab</a></code> a <code><a cbot|drop>drop</a></code>.

source: <button 173/> Target Bot
cs: <button 173/> Cvičný cíl

source: Wheeled bot intended solely for target practice. It is autonomous and its trajectory is dependant upon the nature of the exercise.
cs: Pojízdný robot na kolečkách sloužící pouze jako cíl pro cvičnou střelbu. Je naprogramovaný předem pro potřeby příslušného cvičení.

source: Note that target bots, loaded as they are with <a object|tnt>TNT</a>, are extremely sensitive to shocks.
cs: Mějte na paměti, že cvičné cíle jsou naložené <a object|tnt>výbušninami</a>, takže jsou extrémně citlivé na nárazy.
