Repository: badernageral/colobot-data
Catalog: help/bots/po/*.po
Languages: cs

source: <button 158/> Practice Bot
cs: <button 158/> Cvičný robot

source: Wheeled bot intended solely for training and practice. Its only purpose is to help you get accustomed to the programming of the bots' various ground movements.
cs: Pojízdný robot na kolečkách určený pouze pro výcvik. Jeho jediným účelem je naučit Vás ovládat pohyb robotů po zemi pomocí programu.

source: Instructions
cs: Příkazy

source: To program the bot's movements, use the following commands: <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|goto>goto</a></code>.
cs: Pro ovládání pohybu robota používejte následující příkazy: <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|goto>goto</a></code>.

source: <button 146/> Thumper
cs: <button 146/> Buchar

source: Tracked bot designed to hit the ground with enormous force. The purpose of the thumping is to turn <a object|ant>ants</a> and <a object|spider>spiders</a> belly up within a radius of 100 meters. An insect on its back is not dead but will struggle to get right side up again. After approximately 60 seconds of effort, it will usually succeed.
cs: Pásový robot, který dokáže obrovskou silou udeřit do země. Cílem tohoto úderu je převrátit <a object|ant>mravence</a> a <a object|spider>pavouky</a> v okruhu 100 metrů na záda. Vetřelci převrácení na záda nejsou mrtví, ale bude jim chvíli trvat, než se opět postaví na nohy. Většinou se jim to podaří zhruba po 60 sekundách.

source: To visualize the zone of impact, hit the <range> button <button 41/>. Little red dots outline the circular zone for 20 seconds.
cs: Pro zobrazení účinné oblasti stiskněte tlačítko Dosah <button 41/>. Kruhová oblast účinku se na 20 sekund vyznačí pomocí malých červených teček.

source: The bot uses up a large amount of power. A thump will drain 2/5ths of a <a object|power>regular power cell</a>.
cs: Tento robot má značnou spotřebu energie. Jeden úder spotřebuje 2/5 kapacity <a object|power>běžné baterie</a>.

source: To program the thumping, use <code><a cbot|thump>thump</a></code>.
cs: Pro provedení úderu v programu používejte příkaz <code><a cbot|thump>thump</a></code>.

source: The following objects can be transported :
cs: Následující objekty lze převážet:

source: TODO
cs: Dodělat

source: <button 193/> Tracked Builder
cs: <button 193/> Pásový stavitel

source: Tracked bot equipped with a neutron gun.
cs: Pásový robot vybavený neutronovou pistolí.

source: <button 196/> Opens a build menu with the following options : <button 160/> <code><a object|factory>BotFactory</a> </code>Robot Factory <button 163/> <code><a object|research>ResearchCenter</a> </code>Research Center <button 168/> <code><a object|radar>RadarStation</a> </code>Radar <button 172/> <code><a object|exchange>ExchangePost</a> </code>Information Exchange Post <button 169/> <code><a object|repair>RepairCenter</a> </code>Repair Center <button 165/> <code><a object|tower>DefenseTower</a> </code>Defense Tower <button 166/> <code><a object|labo>AutoLab</a> </code>Organic Matter Analyzer <button 164/> <code><a object|station>PowerStation</a> </code>Power Station <button 167/> <code><a object|energy>PowerPlant</a> </code>Power Cell Factory <button 170/> <code><a object|nuclear>NuclearPlant</a> </code>Nuclear Plant <button 162/> <code><a object|convert>Converter</a> </code>Titanium Converter <button 161/> <code><a object|derrick>Derrick</a> </code>Derrick <button 174/> <code><a object|captor>PowerCaptor</a> </code>Parabolic Lightning Conductor <button 175/> <code><a object|safe>Vault</a> </code>Vault
cs: <button 196/> Otevře stavební menu s následujícími možnostmi: <button 160/> <code><a object|factory>BotFactory</a> </code>Továrna na roboty <button 163/> <code><a object|research>ResearchCenter</a> </code>Výzkumná stanice <button 168/> <code><a object|radar>RadarStation</a> </code>Radar <button 172/> <code><a object|exchange>ExchangePost</a> </code>Komunikační stanice <button 169/> <code><a object|repair>RepairCenter</a> </code>Opravna <button 165/> <code><a object|tower>DefenseTower</a> </code>Obranná věz <button 166/> <code><a object|labo>AutoLab</a> </code>Laboratoř <button 164/> <code><a object|station>PowerStation</a> </code>Nabíječka <button 167/> <code><a object|energy>PowerPlant</a> </code>Továrna na baterie <button 170/> <code><a object|nuclear>NuclearPlant</a> </code>Jaderná elektrárna <button 162/> <code><a object|convert>Converter</a> </code>Konvertor titanu <button 161/> <code><a object|derrick>Derrick</a> </code>Vrtná věž <button 174/> <code><a object|captor>PowerCaptor</a> </code>Parabolický hromosvod <button 175/> <code><a object|safe>Vault</a> </code>Trezor

source: Tracked bots can ascend steep inclinations but they are quite slow and use a lot of energy. On flat ground for short distances, a <a object|botbr>wheeled builder</a> is a better option. When it is possible to build <a object|botbj>winged bots</a>, these represent the best solution for long distances.
cs: Pásoví roboti mohou vyjet i příkré svahy, ale jsou pomalí a mají velkou spotřebu energie. Na kratší vzdálenosti v rovném terénu se více hodí <a object|botbr>pojízdní stavitelé</a>. Na velké vzdálenosti jsou pak ideální <a object|botbj>létající roboti</a>, pokud je můžete stavět.

source: To program the neutron gun, use <code><a cbot|build>build</a></code>.
cs: Pro ovládání neutronové pistole používejte příkaz <code><a cbot|build>build</a></code>.

source: <button 194/> Winged Builder
cs: <button 194/> Létající stavitel

source: Jet propelled flying bot equipped with a neutron gun.
cs: Létající robot s tryskovým pohonem vybavený neutronovou pistolí.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply is used up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botbr>wheeled builder</a> instead.
cs: Létající roboti mohou létat přes přírodní překážky jako například hory nebo jezera, ale brzy jim dochází energie. Na zemi jsou pomalí. Na kratší vzdálenosti, kdy nemá cenu létat, se více hodí <a object|botbr>pojízdní stavitelé</a>.

source: <button 192/> Wheeled Builder
cs: <button 192/> Pojízdný stavitel

source: Wheeled bot equipped with a neutron gun.
cs: Pojízdný robot na kolečkách vybavený neutronovou pistolí.

source: Wheels constitute a standard, fast and energy-saving mode of propulsion, which is perfectly adapted for a relatively flat terrain. Whenever the terrain gets sloped, it is advised to use a <a object|botbj>winged builder</a> instead, or, if this is impossible, a <a object|botbc>tracked builder</a>.
cs: Kolečka představují nejběžnější pohon s dobrou rychlostí a nízkou spotřebou energie, který se skvěle hodí do relativně rovného terénu. V hornatém terénu je doporučeno používat <a object|botbj>létající stavitele</a>, případně <a object|botbc>pásové stavitele</a>, pokud létající roboti nejsou k dispozici.

source: <button 195/> Legged Builder
cs: <button 195/> Chodící stavitel

source: Ant-legged creeping bot equipped with a neutron gun.
cs: Šestinohý chodící robot vybavený neutronovou pistolí.

source: A moving legged builder uses up half as much energy as a <a object|botbr>wheeled builder</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
cs: Chodící stavitel při pohybu spotřebovává jen polovinu energie oproti <a object|botbr>pojízdnému staviteli</a>. Chodící roboti navíc dokáží vyšplhat i po nejpříkřejších svazích.
