Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter001/level005/po/*.po
Languages: cs

source: Power Cell 2
cs: Baterie 2

source: Power all the winged shooters.
cs: Rozdejte baterie všem létajícím kanónům.

source: Spider2
cs: Pavouk2

source: Objective
cs: Úkol

source: Power the <a object|botfj>winged shooters</a> with <a object|power>power cells</a>, so that they can kill the ants in the ant nest located in a hole north of your position.
cs: Rozdejte <a object|botfj>létajícím kanónům</a> <a object|power>baterie</a>, aby mohly zlikvidovat mravenčí hnízdo na sever od Vaší pozice.

source: The <a object|botgr>wheeled grabber</a> must go to a <a object|power>power cell</a>, grab it, go to a <a object|botfj>winged shooter</a>, and drop the cell. This task is very similar to the task performed in the previous exercise. Here is this program again:
cs: <a object|botgr>Pojízdné rameno</a> musí dojet k <a object|power>baterii</a>, zvednout ji, odjet k <a object|botfj>létajícímu kanónu</a> a položit baterii. Tento úkol je velmi podobný jako v předchozím cvičení. Zde je opět program z minula:

source: extern void object::Titanium2() { object item; item = radar(TitaniumOre); goto(item.position); grab(); item = radar(Converter); goto(item.position); drop(); }
cs: extern void object::Titan2() { object item; item = radar(TitaniumOre); goto(item.position); grab(); item = radar(Converter); goto(item.position); drop(); }

source: The best way to solve the present exercise is to copy <button 61/> the program above into the clipboard (from <code>object</code> to <c/>drop();<n/>), and paste <button 62/> it into the program editor. Then you just have to make the necessary changes in order to adapt it to the new task.
cs: Nejjednodušší způsob, jak toto cvičení vyřešit, je zkopírovat <button 61/> výše uvedený program do schránky (od slova <code>object</code> až po <c/>drop();<n/>) a vložit <button 62/> ho do editoru programu. Pak stačí jen udělat potřebné úpravy, aby plnil trochu jiný úkol.

source: Instead of looking for titanium ore (<code>TitaniumOre</code>), look for a power cell (<code>PowerCell</code>). Instead of going to a converter (<code>Converter</code>), go to a winged shooter (<code>WingedShooter</code>). As soon as the winged shooter has got a new power cell, it will get down to work.
cs: Místo titanové rudy (<code>TitaniumOre</code>) hledejte baterii (<code>PowerCell</code>). Místo ke konvertoru (<code>Converter</code>) jeďte k létajícímu kanónu (<code>WingedShooter</code>). Hned jak kanóny dostanou novou baterii, pustí se do práce.

source: If you want to know more about the "names" of the different objects in the programming language, please refer to the <a cbot|category>text about categories</a>.
cs: Pokud se chcete dozvědět více o "názvech" různých druhů objektů v tomto programovacím jazyce, přečtěte si <a cbot|category>popis kategorií</a>.

source: Further improvement: loops
cs: Další vylepšení: cykly

source: Once the program explained above works properly, you can improve it in order to repeat the task over and over again. Like this you will not have to execute the program several times in order to power several bots.
cs: Až bude výše popsaný program správně fungovat, můžete ho ještě dále vylepšit, aby svůj úkol prováděl pořád dokola. Pak ho nebudete muset ručně spouštět několikrát za sebou, aby obsloužil více robotů.

source: All programs written until now execute all instructions only once, one after another, from the beginning to the end of the program. You can also tell the bot to repeat some instructions: just write <code>while (true)</code>, an open brace, the instructions to be repeated, and a closing brace. Repeating some instructions several times in this way is called a loop. Here is an example of a program that repeats over and over the instructions that look for a power cell, grab it, and drop it on a winged shooter:
cs: Všechny předchozí programy prováděly každý příkaz pouze jednou, jeden po druhém od začátku do konce programu. Robotovi ale můžete říct, aby některé příkazy opakoval: prostě napište <code>while (true)</code>, levou složenou závorku, příkazy, které se mají opakovat, a pravou složenou závorku. Tomuto opakování příkazů se říká cyklus. Tady je příklad pogramu, který pořád dokola opakuje příkazy na vyhledání baterie, její zvednutí a položení do létajícího kanónu:

source: Of course the variable declaration <c/>object item;<n/> must not be inside the loop, but just before: declare a variable only once.
cs: Deklarace proměnné <c/>object item;<n/> je před cyklem, ale mohla by být i na jeho začátku. Ale pozor, pokud ji deklarujete uvnitř cyklu, pak se při každém opakování její obsah na začátku vymaže, a po skončení cyklu už nebude dostupná vůbec.

source: Remark
cs: Poznámky

source: A bot can execute a program perfectly well on his own. Meantime you can for example select the astronaut and take a look at what is happening at the nest, the show is worth it. But be careful not to get shot by your own bots...
cs: Robot může svůj program stejně dobře vykonávat i bez Vašeho dohledu. Mezitím můžete přepnout na kosmonauta a jít se podívat, co se bude dít v hnízdě, ta podívaná za to stojí. Ale dávejte pozor, aby Vás netrefili Vaši vlastní roboti...

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
