Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter003/level008/po/*.po
Languages: cs

source: The gold digger
cs: Zlatokop

source: Instruct your bot to search a zone for subsoil resources.
cs: Naprogramujte svého robota, aby v zadané oblasti hledal podzemní zdroje.

source: Digger
cs: Prospektor

source: Exercise
cs: Cvičení

source: Search the whole zone inside the barriers with the <a object|botsr>sniffer bot</a> for adequate locations for a derrick. When the bot sounds the subsoil and discovers an adequate location for a derrick, it will mark it with a red cross.
cs: Prozkoumejte celou oblast mezi zátarasy pomocí <a object|botsr>pojízdného detektoru</a> a najděte vhodná místa pro vrtnou věž. Když robot během zkoumání podzemí objeví vhodné místo pro vrtnou věž, označí ho červeným křížkem.

source: Description
cs: Popis

source: The zone inside the barriers is a square of 25 meters. The most efficient way is to check every 5 meters.
cs: Oblast mezi zátarasy je čtverec 25x25 metrů. Nejefektivnější postup je prozkoumávat vždy po 5 metrech.

source: One way to achieve this is to fit two <code><a cbot|for>for</a></code> loops one into another:
cs: Jednou z možností je vnořit do sebe dva <code><a cbot|for>for</a></code> cykly:

source: for ( int y=0 ; y<6 ; y=y+1 ) { for ( int x=0 ; x<5 ; x=x+1 ) { <n/>sound the subsoil<code> </code>move 5m forward<code> } </code>sound the subsoil<code> </code>quarter turn left<code> </code>move 5m forward<code> </code>quarter turn left<c/> }
cs: for ( int y=0 ; y<6 ; y=y+1 ) { for ( int x=0 ; x<5 ; x=x+1 ) { <n/>prozkoumat podzemí<code> </code>popojet 5 metrů vpřed<code> } </code>prozkoumat podzemí<code> </code>půlobrat doleva<code> </code>popojet 5 metrů vpřed<code> </code>půlobrat doleva<c/> }

source: This program works well only at the beginning. After the first line, the bot turns correctly left and sounds the second line. But after the second line, it must turn right! You will have noticed that if <code>y</code> is even, the bot must turn left, and if <code>y</code> is odd, the bot must turn right. The <a cbot|expr>expression</a> <code>y%2</code> returns the rest of the division of <code>y</code> by <code>2</code>. For example, if <code>y=3</code>, the expression returns <code>1</code>. The test <code><a cbot|if>if</a> { }</code> can be followed by a <code>else { }</code>. If the test is true, the first <a cbot|bloc>block</a> <code>{ }</code> will be executed. Otherwise, the second block <code>{ }</code> will be executed.
cs: Tento program bude fungovat správně jen zezačátku. Na konci prvního řádku se robot správně otočí doleva a začne prozkoumávat druhý řádek. Jenže na konci druhého řádku se musí otočit doprava! Určitě jste si všimli, že když je <code>y</code> sudé, robot se musít otočit doleva, a když je <code>y</code> liché, robot se musí otočit doprava. <a cbot|expr>Výraz</a> <code>y%2</code> vrací zbytek po dělení <code>y</code> dvěmi. Například pokud <code>y=3</code>, zmíněný výraz vrátí <code>1</code>. Za podmínkou <code><a cbot|if>if</a> { }</code> může následovat příkaz <code>else { }</code>. Pokud podmínka platí, provede se první <a cbot|bloc>blok</a> <code>{ }</code>. Jinak se provede druhý blok <code>{ }</code>.

source: if ( y%2 == 0 ) { y <n/>is even<code> } else { y </code>is uneven<c/> }
cs: if ( y%2 == 0 ) { y <n/>je sudé<code> } else { y </code>je liché<c/> }

source: It is up to you to finish the program.
cs: Dopsat zbytek programu už je na Vás.

source: Remark
cs: Poznámky

source: Use the instruction <code><a cbot|sniff>sniff</a>( )</code> to sound the subsoil, and <code><a cbot|move>move</a>( )</code> and <code><a cbot|turn>turn</a>( )</code> to move the bot.
cs: Použijte příkaz <code><a cbot|sniff>sniff</a>( )</code> k prozkoumání podzemí a příkazy <code><a cbot|move>move</a>( )</code> a <code><a cbot|turn>turn</a>( )</code> k ovládání robota.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
