Repository: badernageral/colobot-data
Catalog: levels/battles/chapter001/level003/po/*.po
Languages: cs

source: Code battle - vs other player
cs: Bitva - proti jinému hráči

source: Challenge your friend!
cs: Vyzvěte na souboj své přátele!

source: Code Battle (vs Player)
cs: Souboj programátorů (proti jinému hráči)

source: This is <a battles>a code battle</a> level, where you fight against an other program, presumably written by some other player.
cs: Toto je mapa pro <a battles>souboj programátorů</a>, kde budete bojovat proti jinému programu, třeba napsanému dalším hráčem.

source: Objective
cs: Úkol

source: Destroy the other team located on the opposite side of the river.
cs: Zničte druhý tým nacházející se na protějším břehu řeky.

source: Notes\m notes;
cs: Poznámky\m notes;

source: There is <a object/enerspot>an underground power source</a> only under the beginning base areas.
cs: V malém okruhu kolem počátečních základen jsou jediné <a object|enerspot>podzemní zdroje energie</a>.

source: You can try to find a program to fight against in the International Colobot Community (<code>http://colobot.info</code>).
cs: Na stránkách Mezinárodní komunity Colobotu (<code>http://colobot.info</code>) se můžete poohlédnout po programech od jiných hráčů, se kterými můžete změřit své síly.

source: The pre-built <a object|derrick>Derricks</a> and <a |object\radar>RadarStations</a> are indestructible.
cs: <a object|derrick>Vrtné věže</a> a <a object|radar>radary</a> stojící na mapě od začátku jsou nezničitelné.
