Repository: badernageral/colobot-data
Catalog: help/generic/po/*.po
Languages: cs

source: Contributors on GitHub: https://github.com/colobot/colobot/graphs/contributors
cs: Přispěvatelé na GitHubu: https://github.com/colobot/colobot/graphs/contributors

source: Programming - the CBOT language
cs: Programování - jazyk CBOT

source: The CBOT language is very close in structure and syntax to C++ and Java. It has been adapted for the specific purposes of COLOBOT, and for an efficient pedagogical approach. This language is made up of instructions (see below), <a cbot|bloc>blocks</a>, <a cbot|function>functions</a>, <a cbot|class>classes</a>, <a cbot|var>variables</a>, <a cbot|array>arrays</a>, <a cbot|expr>expressions</a> and <a cbot|cond>conditions</a>.
cs: Jazyk CBOT se strukturou a syntaxí velmi podobá C++ a Javě. Byl vytvořen speciálně pro potřeby COLOBOTu a snadnou výuku programování. Tento jazyk se skládá z příkazů (viz níže), <a cbot|bloc>bloků</a>, <a cbot|function>funkcí</a>, <a cbot|class>tříd</a>, <a cbot|var>proměnných</a>, <a cbot|array>polí</a>, <a cbot|expr>výrazů</a> a <a cbot|cond>podmínek</a>.

source: <code><format type>Type</format></code>
cs: <code><format type>Datové typy</format></code>

source: <code><format const>Constants</format></code>
cs: <code><format const>Konstanty</format></code>

source: Instructions in the CBOT language:
cs: Příkazy v jazyce CBOT:

source: Specific instructions for bots:
cs: Příkazy pro ovládání robotů:

source: Instructions about topology:
cs: Příkazy týkající se terénu:

source: Instructions specific to some bots:
cs: Příkazy vyhrazené jen pro některé roboty:

source: Specific instructions for exchange posts:
cs: Příkazy pro komunikační stanice:

source: <code><a cbot|receive>receive</a> </code>Receives an information <code><a cbot|send>send</a> </code>Sends a new information <code><a cbot|testinfo>testinfo</a> </code>Tests if an information exists <code><a cbot|delinfo>deleteinfo</a> </code>Deletes an existing information
cs: <code><a cbot|receive>receive</a> </code>Načte informaci <code><a cbot|send>send</a> </code>Uloží informaci <code><a cbot|testinfo>testinfo</a> </code>Zjistí, jestli informace existuje <code><a cbot|delinfo>deleteinfo</a> </code>Smaže existující informaci

source: Specific instructions for classes:
cs: Příkazy pro práci s třídami:

source: Specific instructions for strings:
cs: Příkazy pro práci s textovými řetězci:

source: <code><a cbot|strlen>strlen</a> </code>Gets string length <code><a cbot|strleft>strleft</a> </code>Extracts left part <code><a cbot|strright>strright</a> </code>Extracts right part <code><a cbot|strmid>strmid</a> </code>Extracts center part <code><a cbot|strfind>strfind</a> </code>Finds a substring. <code><a cbot|strval>strval</a> </code>Converts string to number <code><a cbot|strupper>strupper</a> </code>Converts to upper case <code><a cbot|strlower>strlower</a> </code>Converts to lower case
cs: <code><a cbot|strlen>strlen</a> </code>Zjistí délku řetězce <code><a cbot|strleft>strleft</a> </code>Vrátí podřetězec na začátku <code><a cbot|strright>strright</a> </code>Vrátí podřetězec na konci <code><a cbot|strmid>strmid</a> </code>Vrátí podřetězec uprostřed <code><a cbot|strfind>strfind</a> </code>Hledá podřetězec <code><a cbot|strval>strval</a> </code>Převede řetězec na číslo <code><a cbot|strupper>strupper</a> </code>Změní řetězec na velká písmena <code><a cbot|strlower>strlower</a> </code>Změní řetězec na malá písmena

source: Specific instructions for files:
cs: Příkazy pro práci se soubory:

source: <code><a cbot|open>open</a> </code>Opens a file <code><a cbot|close>close</a> </code>Closes a file <code><a cbot|writeln>writeln</a> </code>Writes line to a file <code><a cbot|readln>readln</a> </code>Reads line from a file <code><a cbot|eof>eof</a> </code>Tests if end of file <code><a cbot|deletef>deletefile</a> </code>Deletes a file
cs: <code><a cbot|open>open</a> </code>Otevře soubor <code><a cbot|close>close</a> </code>Uzavře otevřený soubor <code><a cbot|writeln>writeln</a> </code>Zapíše řádek do souboru <code><a cbot|readln>readln</a> </code>Načte řádek ze souboru <code><a cbot|eof>eof</a> </code>Zjistí, jestli je kurzor na konci souboru <code><a cbot|deletef>deletefile</a> </code>Smaže soubor

source: See also
cs: Užitečné odkazy

source: <a cbot|type>Types</a> and <a cbot|category>categories</a>.
cs: <a cbot|type>Datové typy</a> a <a cbot|category>kategorie</a>.

source: Controls
cs: Ovládání

source: You are advised to play with one hand on the arrow keys and the other hand on the mouse.
cs: Doporučujeme hrát s jednou rukou na myši a druhou na šipkách na klávesnici.

source: Bots
cs: Roboti

source: <format key><key left/></format> = turn left <format key><key right/></format> = turn right <format key><key up/></format> = move forward <format key><key down/></format> = move back These controls are unavailable when working with the <a object|bottr>practice bots</a>.
cs: <format key><key left/></format> = otočit vlevo <format key><key right/></format> = otočit vpravo <format key><key up/></format> = jet kupředu <format key><key down/></format> = couvat Tyto klávesy nefungují u <a object|bottr>cvičných robotů</a>.

source: <format key><key gup/></format> = take off and climb <button 28/> <format key><key gdown/></format> = descend and land <button 29/> These controls are of course restricted to the <a object|human>astronaut</a> as well as the various <a object|botgj>winged bots</a> and in selected missions only.
cs: <format key><key gup/></format> = vzlétnout a stoupat <button 28/> <format key><key gdown/></format> = klesat a přistát <button 29/> Tyto klávesy samozřejmě fungují pouze u <a object|human>kosmonauta</a> a různých <a object|botgj>létajících robotů</a>, a to pouze v některých misích.

source: mouse forward = higher aim mouse backward = lower aim mouse right = aim right mouse left = aim left These controls are only available to the <a object|botfr>shooters</a>, the <a object|botor>orga shooters</a> and the <a object|botphaz>phazer shooter</a>.
cs: myš od sebe = mířit nahoru myš k sobě = mířit dolů myš vpravo = mířit vpravo myš vlevo = mířit vlevo Míření funguje pouze u <a object|botfr>kanónů</a>, <a object|botor>biokanónů</a> a <a object|botphaz>fázových děl</a>.

source: <format key><key action/></format> = main action for a given selection (human or bot) This control will for example operate the arm of a <a object|botgr>grabber</a> or fire a <a object|botfr>shooter</a> <button 42/>.
cs: <format key><key action/></format> = speciální akce vybraného robota nebo kosmonauta Tato klávesa například ovládá drapák <a object|botgr>pojízdného ramene</a> nebo střílí z <a object|botfr>kanónu</a> <button 42/>.

source: Selections
cs: Výběr objektů

source: <format key><key next/></format> = selects next object <format key><key human/></format> = selects astronaut <format key><key desel/></format> = previous selection <button 10/>
cs: <format key><key next/></format> = vybere následující objekt <format key><key human/></format> = vybere kosmonauta <format key><key desel/></format> = vybere předchozí objekt <button 10/>

source: Camera
cs: Kamera

source: <format key><key camera/></format> = shifts between onboard and following cameras <button 13/> <format key><key near/></format> = zoom in <format key><key away/></format> = zoom out <format key><key visit/></format> = pauses the game and shows where the latest message originated. Press again to show origin of previous message.
cs: <format key><key camera/></format> = přepíná mezi kamerou na robotu a za robotem <button 13/> <format key><key near/></format> = přiblížit <format key><key away/></format> = oddálit <format key><key visit/></format> = pozastaví hru a zobrazí zdroj poslední zprávy. Dalším stiskem přejdete na zdroj předchozí zprávy.

source: Help
cs: Nápověda

source: <format key><key help/></format> = mission instructions <format key><key prog/></format> = programming help
cs: <format key><key help/></format> = instrukce k misi <format key><key prog/></format> = programátorská nápověda

source: Game
cs: Hra

source: All these commands can be redefined in the options/controls menu.
cs: Všechny tyto klávesy lze přenastavit v nabídce Nastavení/Ovládání.

source: Objective
cs: Úkol

source: Here you can play around without any definite objective. You can do whatever you want, explore the region, build a base camp and several bots, run various research programs, kill the insects if you find some, etc.
cs: Zde si můžete volně hrát bez předepsaného cíle. Můžete si dělat, co se Vám zachce. Prozkoumejte okolí, postavte základnu a několik robotů, zkoumejte různé technologie, zlikvidujte vetřelce, pokud na nějaké narazíte, atd.

source: <a command>Controls</a>.
cs: <a command>Ovládání</a>.

source: The photograph of the nebula NGC3606 illuminating the sky on Orpheon and the installation program was taken with the Hubble space telescope. It is used with the permission of the authors Wolfgang Brandner (JPL/IPAC), Eva K. Grebel (Washington University), You-Hua Chu (Illinois Urbana-Champaign University) and NASA.
cs: Fotografie mlhoviny NGC3606 zářící na nebi na Orfeonu a v instalačním programu byla pořízena Hubbleovým vesmírným dalekohledem. Je použita se souhlasem autorů: Wolfgang Brandner (JPL/IPAC), Eva K. Grebelová (Washingtonská univerzita), You-Hua Chu (Univerzita Illinois v Urbana Champaign) a NASA.

source: The thunder sound on Orpheon is used by limited permission from CREATIVE.
cs: Zvuk hromu na Orfeonu je použit s omezeným souhlasem od CREATIVE.

source: Navigation
cs: Navigace

source: The three buttons on the upper left-hand corner of the screen allow you to navigate in the different texts of the help file:
cs: V levém horním rohu jsou tři tlačítka pro navigaci mezi stránkami nápovědy:

source: <button 30/> Home Get back to the home page, i.e. the first page that was displayed, for example when you hit the <format key><key help/></format> or <format key><key prog/></format> key.
cs: <button 30/> Domů Zpět na domovskou stránku, t.j. na první zobrazenou stránku například po stisku klávesy <format key><key help/></format> nebo <format key><key prog/></format>.

source: <button 55/> Previous Get back to the previous page, i.e. the page that was displayed before you clicked on a link.
cs: <button 55/> Předchozí Návrat na předchozí stránku, t.j. na stránku zobrazenou před kliknutím na některý odkaz.

source: <button 48/> Next Get again to the next page, after you used the "Home" or "Previous" button.
cs: <button 48/> Následující Návrat na následující stránku, kterou jste opustili tlačítkem "Domů" nebo "Předchozí".

source: Remark
cs: Poznámky

source: When a button is gray, this means that it can not be used at this precise moment. For example, when you are in the home page, the "Home" button is gray, because it does not make sense to use it. This remark is valid for all buttons in COLOBOT.
cs: Když je tlačítko šedivé, tak ho v danou chvíli nelze použít. Například když jste na úvodní stránce, tak bude tlačítko "Domů" šedé, protože nemá smysl na něj klikat. Totéž platí pro všechna tlačítka v COLOBOTu.

source: Text scrolling
cs: Posouvání textu

source: If your mouse is equipped with a wheel, you can use it to scroll the text up and down. Otherwise, use the arrow keys and the scroll bar on the right-hand side of the screen.
cs: Pokud máte myš s kolečkem, můžete jím posouvat text nahoru a dolů. Jinak k posunu používejte šipky na klávesnici nebo posuvník na pravém kraji obrazovky.

source: Font size
cs: Velikost textu

source: The cursor on the upper side of the screen allows you to change the font size of the text.
cs: Posuvník v horní části obrazovky umožňuje měnit velikost textu.

source: Houston congratulates you in the name of mankind for the success of your mission. The Great Migration to Terra Nova will start very soon.
cs: Houston Vám jménem lidstva gratuluje k úspěchu Vaší mise. Stěhování národů na Terra Novu začne již brzy.

source: Developers and internal betatesters of Original COLOBOT game from EPSITEC
cs: Vývojáři a testeři původního COLOBOTu od EPSITECu

source: Colobot: Gold Edition developers
cs: Vývojáři Colobotu: Zlaté edice

source: Code battles
cs: Souboj programátorů

source: Code battle is a completely new game mode featured in Colobot: Gold Edition. The idea is that you set up two programs (yours and the opponent's) to fight with each other. The player can't interact with the world manually.
cs: Souboj programátorů je zcela nový režim hry přidaný v Colobotu: Zlaté edici. Hlavní myšlenkou je, že spustíte dva programy (Váš a Vašeho protivníka), které budou bojovat proti sobě. Hráči pak už do hry nebudou moci zasahovat přímo.

source: With the new functions provided in the Gold Edition, you can create a fully automatised base, which does not need any influence from <a object|human>human</a>. All of them are described in the <a cbot>CBOT documentation</a>.
cs: Díky novým funkcím přidaným ve Zlaté edici můžete vytvořit plně automatickou základnu, která se obejde bez zásahu <a object|human>člověka</a>. Všechny potřebné funkce jsou popsané v <a cbot>dokumentaci CBOTu</a>.

source: Production line is explained in Missions and Exercises, but you may want to jump into code battles right away without beating the whole game. So here is a brief description of how the things works in Colobot.
cs: Výrobní proces je popsaný v kampani a cvičných úlohách. Pokud se ale chcete vrhnout na souboje programátorů bez dohrání zbytku hry, zde je stručný popis, jak funguje stavba základny v Colobotu.

source: What you want to achieve
cs: Čeho chcete dosáhnout

source: Basically, you want to destroy the opponent. To do that, you will need something lethal, for example, a robot, specifically, a <a object|botfr>shooter</a>. But you will probably be losing them quite often, so maybe you should keep the production going on. For example, more <a object|botgr>grabbers</a> or more <a object|factory>factories</a>, <a object|convert>converters</a> and so on would be helpful in that. Remember that robots needs <a object|power>batteries</a>. Anyway, before you can start, you must also do some <a object|research>researches</a> to get better technologies. And here we are at the beginning, with a single <a object|botgr>robot</a> and a <a object|titan>Titanium</a>.
cs: Prostě a jednoduše, Vaším cílem je zničit protivníka. K tomu budete potřebovat nějakou zbraň, nejlépe robota, konkrétně <a object|botfr>kanón</a>. Jenže protivník Vám bude roboty a budovy ničit, takže byste měli stavět pořád další. Například se vám budou hodit další <a object|botgr>ramena</a>, další <a object|factory>továrny</a> a další <a object|convert>konvertory</a>. Pamatujte, že roboti potřebují <a object|power>baterie</a>. Každopádně na začátku musíte <a object|research>vyzkoumat</a> nové technologie. A začnete pouze s jedním <a object|botgr>robotem</a> a kostkou <a object|titan>titanu</a>.

source: Titanium production
cs: Výroba titanu

source: 1. <a cbot|radar>Find</a> a <a object|titan>Titanium</a>. 2. <a cbot|build>Build</a> a <a object|convert>Converter</a>. 3. Find a <a object|titanore>TitaniumOre</a>. 4. Place it in the converter. Move back and wait until the converter is done. 5. Use or move somewhere your new Titanium. Repeat steps 3-5 in order to keep your production going.
cs: 1. <a cbot|radar>Najděte</a> <a object|titan>titan</a>. 2. <a cbot|build>Postavte</a> <a object|convert>konvertor</a>. 3. Najděte <a object|titanore>titanovou rudu</a>. 4. Odvezte ji do konvertoru, zacouvejte a počkejte, až ji konvertor zpracuje. 5. Kostku titanu dále zpracujte nebo ji odložte někam stranou. Opakováním kroků 3-5 vyrábějte další titan.

source: Researches
cs: Výzkum

source: 1. <a cbot|build>Build</a> a <a object|research>ResearchCenter</a>. 2. Power it with a <a object|power>PowerCell</a>. 3. <a cbot|research>Request</a> a <a cbot|researches>research</a> and wait until the research center is done.
cs: 1. <a cbot|build>Postavte</a> <a object|research>výzkumnou stanici</a>. 2. Vložte <a object|power>baterii</a>. 3. <a cbot|research>Zahajte</a> <a cbot|researches>výzkum</a> a počkejte na jeho dokončení.

source: Robot production
cs: Výroba robotů

source: 1. <a cbot|build>Build</a> a <a object|factory>BotFactory</a>. 2. Place a <a object|titan>Titanium</a> inside and move back. 3. <a cbot|factory>Request</a> a construction of a robot and wait until the bot factory is done. 4. Power the robot with a <a object|power>PowerCell</a>.
cs: 1. <a cbot|build>Postavte</a> <a object|factory>továrnu na roboty</a>. 2. Vložte dovnitř <a object|titan>titan</a> a zacouvejte. 3. <a cbot|factory>Zahajte</a> výrobu robota a počkejte na její dokončení. 4. Dejte robotovi <a object|power>baterii</a>.

source: Power cell production
cs: Výroba baterií

source: 1. <a cbot|build>Build</a> a <a object|energy>PowerPlant</a>. 2. Place a <a object|titan>Titanium</a> in it and wait until the power plant is done.
cs: 1. <a cbot|build>Postavte</a> <a object|energy>továrnu na baterie</a>. 2. Vložte <a object|titan>titan</a> a počkejte na dokončení výroby.

source: There is more
cs: To není vše

source: There is much more options, but this is the basis. Read documentation, play the game and think creatively to come up with new ideas. Good luck and have fun!
cs: Máte spoustu dalších možností, ale tohle je základ. Přečtěte si nápovědu, hrajte různé mise a popusťte uzdu fantazii. Hodně štěstí a dobře se bavte!

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: <code><a cbot|extern>extern</a> </code>Indicate the main function <code><a cbot|if>if</a> </code>Choice structure <code><a cbot|if>else</a> </code>Alternative choice structure <code><a cbot|switch>switch</a> </code>Multiple choice structure <code><a cbot|switch>case</a> </code>One choice <code><a cbot|switch>default</a> </code>Default choice <code><a cbot|for>for</a> </code>Loop structure <code><a cbot|while>while</a> </code>Control structure <code><a cbot|do>do</a> </code>Control structure <code><a cbot|break>break</a> </code>Exit from a loop <code><a cbot|continue>continue</a> </code>Continues the loop <code><a cbot|return>return</a> </code>Exit from a function <code><a cbot|sizeof>sizeof</a> </code>Size of an array
cs: <code><a cbot|extern>extern</a> </code>Označení hlavní funkce programu <code><a cbot|if>if</a> </code>Podmíněné zpracování <code><a cbot|if>else</a> </code>Druhá varianta podmíněného zpracování <code><a cbot|switch>switch</a> </code>Podmíněné zpracování s více možnostmi <code><a cbot|switch>case</a> </code>Jedna z předepsaných možností <code><a cbot|switch>default</a> </code>Souhrnná možnost pro ostatní hodnoty <code><a cbot|for>for</a> </code>Druh cyklu <code><a cbot|while>while</a> </code>Druh cyklu <code><a cbot|do>do</a> </code>Druh cyklu <code><a cbot|break>break</a> </code>Ukončení cyklu <code><a cbot|continue>continue</a> </code>Skok na další kolo cyklu <code><a cbot|return>return</a> </code>Návrat z funkce <code><a cbot|sizeof>sizeof</a> </code>Počet prvků v poli

source: <code><a cbot|space>space</a> </code>Calculates a free space <code><a cbot|flatspace>flatspace</a> </code>Calculates a free, flat space <code><a cbot|topo>topo</a> </code>Returns the altitude of a point <code><a cbot|flatgrnd>flatground</a> </code>Returns radius of a flat area
cs: <code><a cbot|space>space</a> </code>Hledá volné místo požadované velikosti <code><a cbot|flatspace>flatspace</a> </code>Hledá volný rovný terén požadované velikosti <code><a cbot|topo>topo</a> </code>Vrací nadmořskou výšku terénu <code><a cbot|flatgrnd>flatground</a> </code>Vrací poloměr rovného terénu

source: <code><a cbot|grab>grab</a> </code>Picks up an object <code><a cbot|drop>drop</a> </code>Puts down an object <code><a cbot|sniff>sniff</a> </code>Sounds the subsoil <code><a cbot|thump>thump</a> </code>Overturns alien insects <code><a cbot|recycle>recycle</a> </code>Recycles a derelict bot <code><a cbot|shield>shield</a> </code>Extends or withdraws the shield <code><a cbot|fire>fire</a> </code>Fires the cannon <code><a cbot|aim>aim</a> </code>Rotates the cannon <code><a cbot|build>build</a> </code>Builds a building <code><a cbot|canbuild>canbuild</a> </code>Checks if a building can be built <code><a cbot|buildingenabled>buildingenabled</a> </code>Checks if a building can be built in the level
cs: <code><a cbot|grab>grab</a> </code>Zvedne předmět <code><a cbot|drop>drop</a> </code>Položí předmět <code><a cbot|sniff>sniff</a> </code>Detekce podzemních zdrojů <code><a cbot|thump>thump</a> </code>Převalí mimozemský hmyz na záda <code><a cbot|recycle>recycle</a> </code>Zrecykluje vrak robota <code><a cbot|shield>shield</a> </code>Zapne nebo vypne mobilní štít <code><a cbot|fire>fire</a> </code>Vystřelí z kanónu <code><a cbot|aim>aim</a> </code>Zamíří kanón <code><a cbot|build>build</a> </code>Postaví budovu <code><a cbot|canbuild>canbuild</a> </code>Zjistí, jestli lze budovu postavit <code><a cbot|buildingenabled>buildingenabled</a> </code>Zjistí, jestli je stavba dané budovy v aktuální misi povolena

source: Instructions specific for some <a cbot|object>objects</a>:
cs: Příkazy vyhrazené jen pro některé <a cbot|object>objekty</a>:

source: <code><a cbot|factory>factory</a> </code>Starts construction of a bot <code><a cbot|research>research</a> </code>Starts a research <code><a cbot|takeoff>takeoff</a> </code>Takes off a spaceship <code><a cbot|busy>busy</a> </code>Checks if object is busy
cs: <code><a cbot|factory>factory</a> </code>Zahájí výrobu robota <code><a cbot|research>research</a> </code>Zahájí výzkum <code><a cbot|takeoff>takeoff</a> </code>Pokyn raketě k odletu <code><a cbot|busy>busy</a> </code>Zjistí, jestli je daný objekt zaneprázdněný

source: Mathematical functions:
cs: Matematické funkce:

source: <code><a cbot|rand>rand</a> </code>Returns a random value <code><a cbot|pow>pow</a> </code>Returns a power <code><a cbot|sqrt>sqrt</a> </code>Returns a square root <code><a cbot|floor>floor</a> </code>Returns the largest previous integer <code><a cbot|ceil>ceil</a> </code>Returns the smallest following integer <code><a cbot|round>round</a> </code>Returns a rounded number <code><a cbot|trunc>trunc</a> </code>Returns a truncated number <code><a cbot|sin>sin</a> </code>Returns a sine <code><a cbot|cos>cos</a> </code>Returns a cosine <code><a cbot|tan>tan</a> </code>Returns a tangent <code><a cbot|asin>asin</a> </code>Returns an arcus sine <code><a cbot|acos>acos</a> </code>Returns an arcus cosine <code><a cbot|atan>atan</a> </code>Returns an arcus tangent <code><a cbot|atan2>atan2</a> </code>Returns an arcus tangent, has two arguments
cs: <code><a cbot|rand>rand</a> </code>Vrátí náhodné číslo <code><a cbot|pow>pow</a> </code>Spočítá mocninu <code><a cbot|sqrt>sqrt</a> </code>Spočítá druhou odmocninu <code><a cbot|floor>floor</a> </code>Zaokrouhlí číslo dolů <code><a cbot|ceil>ceil</a> </code>Zaokrouhlí číslo nahoru <code><a cbot|round>round</a> </code>Zaokrouhlí číslo <code><a cbot|trunc>trunc</a> </code>Usekne desetinnou část čísla <code><a cbot|sin>sin</a> </code>Spočítá sinus úhlu <code><a cbot|cos>cos</a> </code>Spočítá kosinus úhlu <code><a cbot|tan>tan</a> </code>Spočítá tangens úhlu <code><a cbot|asin>asin</a> </code>Spočítá arkus sinus <code><a cbot|acos>acos</a> </code>Spočítá arkus kosinus <code><a cbot|atan>atan</a> </code>Spočítá arkus tangens <code><a cbot|atan2>atan2</a> </code>Spočítá arkus tangens, vyžaduje dva argumenty

source: The <a cbot|type>type</a> of a variable appears like that: <format type>type</format>.
cs: <a cbot|type>Datový typ</a> proměnné je vždy zvýrazněn takto: <format type>typ</format>.
