Repository: badernageral/colobot-data
Catalog: help/generic/po/*.po
Languages: cs

source: Constants like <a cbot|category>categories</a> are displayed like that: <format const>constant</format>.
cs: Konstanty, například <a cbot|category>kategorie</a>, jsou vždy zvýrazněny takto: <format const>konstanta</format>.

source: <a cheats>o</a> |c;<format token>Instructions</format><n/> In the program editor, an instruction in the CBOT language is always displayed like that: <format token>instruction</format>. If an instruction is not highlighted, this means that it has been misspelled. Instruction names are always written in lower case.
cs: <a cheats>o</a> |c;<format token>Příkazy</format><n/> V editoru programu jsou příkazy jazyka CBOT vždy zvýrazněny takto: <format token>příkaz</format>. Pokud některý příkaz zvýrazěný není, znamená to, že je v něm překlep. Názvy příkazů se vždy píší malými písmeny.

source: Cheats
cs: Cheaty

source: Great, you have found this secret page. We hope you will use informations contained here only for other than cheating purposes. Like testing the game or recording a cool video about Colobot.
cs: Gratulujeme, objevili jste tajnou stránku. Doufáme, že níže uvedené informace budete používat ke vznešenějším účelům než k podvádění. Například k testování chyb ve hře nebo k vytvoření zajímavého videa o Colobotu.

source: Console
cs: Konzole

source: You can open the console by pressing the <key/><code>~</code><norm/> button on your keyboard. Press <key/><code>ENTER</code><norm/> to hide it or pass one of the commands below.
cs: Konzoli otevřete klávesou <key/><code>~</code><norm/>. Pak můžete zadat jeden z níže uvedených příkazů nebo ji zavřít klávesou <key/><code>ENTER</code><norm/>.

source: Missions
cs: Mise

source: Gameplay
cs: Hra

source: Debug
cs: Testování chyb

source: Aesthetic
cs: Pohled

source: <code><a cbot|produce>produce</a> </code>Immediately creates an object
cs: <code><a cbot|produce>produce</a> </code>Okamžitě vytvoří zadaný objekt

source: <code>winmission </code>Immediately win the current mission
cs: <code>winmission </code>Okamžitě vyhrajete aktuální misi

source: <code>lostmission </code>Immediately lose the current mission
cs: <code>lostmission </code>Okamžitě prohrajete aktuální misi

source: <code>allresearch </code>All researches are done
cs: <code>allresearch </code>Zpřístupní všechny technologie

source: <code>allbuildings </code>All buildings are enabled
cs: <code>allbuildings </code>Zpřístupní všechny budovy

source: <code>fullenergy </code>Restore energy in the currently selected bot
cs: <code>fullenergy </code>Dobije baterii aktuálně vybraného robota

source: <code>fullshield </code>Restore shield in the currently selected object
cs: <code>fullshield </code>Plně opraví štít aktuálně vybraného objektu

source: <code>fullrange </code>Flying reactor is cold
cs: <code>fullrange </code>Zchladí tryskový motor

source: <code>fly </code>You can fly even if flying is disabled in the current mission
cs: <code>fly </code>Umožní létání, i když je v aktuální misi zakázané

source: <code>addfreezer </code>Flying reactor heats more slowly
cs: <code>addfreezer </code>Zpomalí zahřívání tryskového motoru

source: <code>addhusky </code>You take less damage than usual
cs: <code>addhusky </code>Zvýší odolnost vůči zranění nebo poškození

source: <code>nolimit </code>You can fly higher
cs: <code>nolimit </code>Umožní létat ve větší výšce

source: <code>trainerpilot </code>You can drive robots which could be previously controlled only by programs
cs: <code>trainerpilot </code>Umožní ruční ovládání robotů, které předtím šlo ovládat pouze programem

source: <code>photo1 </code>Free camera, you can change angle with <key/><code>+</code><norm/> and <key/><code>-</code><norm/> keys, type again to set it off
cs: <code>photo1 </code>Volná kamera, náklon můžete měnit klávesami <key/><code>+</code><norm/> a <key/><code>-</code><norm/>, pro pokračování ve hře zadejte tento příkaz znovu

source: <code>photo2 </code>Same as <code>photo1</code>, except it hides interface, type again to set it off
cs: <code>photo2 </code>Podobné jako <code>photo1</code>, ale navíc skryje uživatelské rozhraní, pro pokračování ve hře zadejte znovu

source: <code>delete </code>Damages the object, <code>1</code>: object's ID, <code>2</code>: magnifyDamage multiplier, without <code>2</code> the object explodes
cs: <code>delete </code>Poškodí objekt, <code>1</code>: ID objektu, <code>2</code>: násobitel poškození, bez argumentu <code>2</code> objekt vybuchne

source: <code>setbuild </code>Sets buildings bitmask, <code>1</code>: new bitmask
cs: <code>setbuild </code>Nastaví bitovou masku dostupných budov, <code>1</code>: nová bitová maska

source: <code>setresearchenable </code>Sets researches bitmask, <code>1</code>: new bitmask
cs: <code>setresearchenable </code>Nastaví bitovou masku zkoumatelných technologií, <code>1</code>: nová bitová maska

source: <code>setresearchdone </code>Sets done researches bitmask, <code>1</code>: new bitmask
cs: <code>setresearchdone </code>Nastaví bitovou masku vyzkoumaných technologií, <code>1</code>: nová bitová maska

source: <code>getbuild </code>Returns buildings bitmask
cs: <code>getbuild </code>Vrátí bitovou masku dostupných budov

source: <code>getresearchenable </code>Returns researches bitmask
cs: <code>getresearchenable </code>Vrátí bitovou masku zkoumatelných technologií

source: <code>getresearchdone </code>Returns done researches bitmask
cs: <code>getresearchdone </code>Vrátí bitovou masku vyzkoumaných technologií

source: <code>playmusic </code>Plays music, <code>1</code>: file name, <code>2</code>: repeat
cs: <code>playmusic </code>Přehraje hudební soubor, <code>1</code>: název souboru, <code>2</code>: opakování

source: <code>stopmusic </code>Stops music
cs: <code>stopmusic </code>Zastaví přehrávání hudby

source: <code>allmission </code>All missions are unlocked, works also in main menu
cs: <code>allmission </code>Odemkne všechny mise, funguje i v hlavním menu

source: <code>showsoluce </code>All solutions are unlocked, works also in main menu
cs: <code>showsoluce </code>Odemkne řešení všech misí, funguje i v hlavním menu

source: <code>selectinsect </code>You can select and control aliens, works also in main menu, type again to disable
cs: <code>selectinsect </code>Umožní vybrat a ovládat vetřelce, funguje i v hlavním menu, pro vypnutí zadejte podruhé

source: <code>invradar </code>Mini-map works like you would have built a <a object|radar>radar</a>, works also in main menu, type again to disable
cs: <code>invradar </code>Minimapa bude vždy zobrazovat stejné informace jako po postavení <a object|radar>radaru</a>, funguje i v hlavním menu, pro vypnutí zadejte podruhé

source: <code>noclip </code>The currently selected object can pass through objects
cs: <code>noclip </code>Aktuálně vybraný objekt bude moci procházet skrz ostatní objekty

source: <code>clip </code>Disable <code>noclip</code> on the currently selected object
cs: <code>clip </code>Zruší <code>noclip</code> pro aktuálně vybraný objekt

source: <code>speed </code>Set the speed of the game to the given number, for example <code>speed 2</code> - two times faster, <code>speed 0.5</code> - two times slower, works also in main menu
cs: <code>speed </code>Nastaví rychlost hry na zadané číslo, například <code>speed 2</code> - dvojnásobná rychlost, <code>speed 0.5</code> - poloviční rychlost, funguje i v hlavním menu

source: These commands work also in main menu. Type them again to set them off.
cs: Tyto příkazy fungují i v hlavním menu. Pro vypnutí je zadejte podruhé.

source: <code>showstat </code>Show debug statistics on the screen, <format key>F12</format> keyboard key has the same effect
cs: <code>showstat </code>Zobrazí na obrazovce technické statistiky, klávesa <format key>F12</format> dělá totéž

source: <code>debugmode </code>Enable debug mode (useful for the game developers): the verbose debugging of events and other things; make sure you run the game with <code>-loglevel trace</code> to see the effect; see also <code>-debug</code> commandline parameter
cs: <code>debugmode </code>Zapne ladící režim (pomůcka pro vývojáře hry): podrobný výpis událostí a dalších informací; pro použití musíte hru spustit s parametrem <code>-loglevel trace</code>; viz také parametr <code>-debug</code>

source: There are hidden commands in CBOT that are not even highlighted in the editor. They are considered cheating, so do not use them for "legal" programs. It should be fine to use them for level creation though if there is no other way. Numbers mean order of parameters.
cs: V CBOTu jsou navíc tajné příkazy, které se v editoru nezvýrazňují. Používat je ve hře ale znamená podvod, takže je nepište do "opravdových" programu. Můžete je ale použít pro tvorbu misí, pokud to nejde jinak. Čísla znamenají pořadí parametrů.

source: <code>ipf </code>Sets the number of instructions per frame, <code>1</code>: the number, default is <code>100</code>
cs: <code>ipf </code>Nastaví počet příkazů vykonaných za jeden snímek, <code>1</code>: číslo, výchozí hodnota je <code>100</code>

source: Basics of production line\m production;
cs: Základy výrobního procesu\m production;

source: How to control the level
cs: Jak hrát v tomto režimu

source: Starting a code battle
cs: Zahájení souboje programátorů

source: Controlling the spectator's view
cs: Ovládání diváckého pohledu

source: After a code battle is started, the camera is put into a special mode:
cs: Po zahájení souboje programátorů se kamera přepne do zvláštního režimu:

source: In order to start a code battle you need to: 1. Run all the necessary programs for your/all team(s). 2. Press the <button 21/> button above the mini-map.
cs: Pro zahájení souboje programátorů musíte: 1. Spustit všechny potřebné programy pro jednotlivé týmy 2. Kliknout na tlačítko <button 21/> nad minimapou.

source: One can select objects as a player normally would, but one will not see their interface and the camera does not rotate when the object rotates. One can also use numerical keyboard instead of mouse in order to rotate the object-centered camera.
cs: Budete moci vybírat objekty jako během normální hry, ale neuvidíte jejich ovládací prvky a kamera se nebude otáčet spolu s objekty. Kromě myši můžete kameru otáčet kolem vybraného objektu i pomocí numerické klávesnice.

source: One can return to the normal view by pressing the <button 13/> button above the mini-map.
cs: Do běžného pohledu se můžete vrátit kliknutím na tlačítko <button 13/> nad minimapou.

source: One can also switch to the free camera view by clicking somewhere on the map. One can move around in this view by using the numerical keyboard and <format key>PageUp</format>/<format key>PageDown</format> keys.
cs: Dále můžete přepnout na volnou kameru kliknutím někam na mapu. V tomto pohledu se můžete pohybovat pomocí numerické klávesnice a kláves <format key>Page Up</format>/<format key>Page Down</format>.

source: <code><a cbot|detect>detect</a> </code>Simple object detection <code><a cbot|radar>radar</a> </code>Advanced object detection <code><a cbot|radarall>radarall</a> </code>Advanced multiple objects detection <code><a cbot|search>search</a> </code>Object detection from a specific point <code><a cbot|direct>direction</a> </code>Calculates a rotation angle <code><a cbot|dist>distance</a> </code>Calculates a distance <code><a cbot|dist2d>distance2d</a> </code>Calculates a distance <code><a cbot|wait>wait</a> </code>Waits <code><a cbot|move>move</a> </code>Moves forward or backward <code><a cbot|turn>turn</a> </code>Turns <code><a cbot|goto>goto</a> </code>Goes to a given position <code><a cbot|motor>motor</a> </code>Direct motor control <code><a cbot|jet>jet</a> </code>Direct jet engine control <code><a cbot|message>message</a> </code>Displays a message <code><a cbot|retobj>retobject</a> </code>Returns an object from a function <code><a cbot|errmode>errmode</a> </code>Error treatement control <code><a cbot|abstime>abstime</a> </code>Returns the absolute time <code><a cbot|pendown>pendown</a> </code>Starts drawing <code><a cbot|penup>penup</a> </code>Stops drawing <code><a cbot|pencolor>pencolor</a> </code>Changes the pen color <code><a cbot|penwidth>penwidth</a> </code>Changes the pen width <code><a cbot|canresearch>canresearch</a> </code>Checks if a technology can be researched <code><a cbot|researched>researched</a> </code>Checks if a technology is researched
cs: <code><a cbot|detect>detect</a> </code>Zjednodušené hledání objektů <code><a cbot|radar>radar</a> </code>Pokročilé hledání objektů <code><a cbot|radarall>radarall</a> </code>Pokročilé hledání více objektů <code><a cbot|search>search</a> </code>Hledání objektů poblíž jiného bodu <code><a cbot|direct>direction</a> </code>Spočítá úhel pro otočení <code><a cbot|dist>distance</a> </code>Spočítá vzdálenost <code><a cbot|dist2d>distance2d</a> </code>Spočítá vzdálenost <code><a cbot|wait>wait</a> </code>Čekání <code><a cbot|move>move</a> </code>Pohyb vpřed nebo vzad <code><a cbot|turn>turn</a> </code>Otočení <code><a cbot|goto>goto</a> </code>Přesun na zadanou pozici <code><a cbot|motor>motor</a> </code>Přímé ovládání motoru <code><a cbot|jet>jet</a> </code>Přímé ovládání tryskového motoru <code><a cbot|message>message</a> </code>Zobrazí zprávu <code><a cbot|retobj>retobject</a> </code>Hledání objektu podle ID <code><a cbot|errmode>errmode</a> </code>Nastavení oznamování chyb <code><a cbot|abstime>abstime</a> </code>Vrací absolutní čas <code><a cbot|pendown>pendown</a> </code>Zahájí kreslení <code><a cbot|penup>penup</a> </code>Ukončí kreslení <code><a cbot|pencolor>pencolor</a> </code>Změní barvu tužky <code><a cbot|penwidth>penwidth</a> </code>Změní tloušťku čáry <code><a cbot|canresearch>canresearch</a> </code>Zjistí, jestli se daná technologie dá zkoumat <code><a cbot|researched>researched</a> </code>Zjistí, jestli už je daná technologie vyzkoumaná

source: <code><a cbot|class>class</a> </code>Class declararion <code><a cbot|public>public</a> </code>Declares a public class member <code><a cbot|private>private</a> </code>Declares a private class member <code><a cbot|protected>protected</a> </code>Declares a protected class member <code><a cbot|static>static</a> </code>Declares a static class member <code><a cbot|synchro>synchronized</a> </code>Prevents simultaneous execution <code><a cbot|new>new</a> </code>Creates a new instance <code><a cbot|this>this</a> </code>Reference to the current instance <code><a cbot|extends>extends</a> </code>Extends a class <code><a cbot|super>super</a> </code>Grants access to the parent class
cs: <code><a cbot|class>class</a> </code>Deklarace třídy <code><a cbot|public>public</a> </code>Deklaruje veřejný prvek třídy <code><a cbot|private>private</a> </code>Deklaruje soukromý prvek třídy <code><a cbot|protected>protected</a> </code>Deklaruje chráněný prvek třídy <code><a cbot|static>static</a> </code>Deklaruje statický prvek třídy <code><a cbot|synchro>synchronized</a> </code>Blokuje paralelní spouštění funkce <code><a cbot|new>new</a> </code>Vytvoří novou instanci třídy <code><a cbot|this>this</a> </code>Ukazatel na aktuální instanci třídy <code><a cbot|extends>extends</a> </code>Vytvoří odvozenou třídu <code><a cbot|super>super</a> </code>Ukazatel na rodičovskou třídu

source: <format key><key speed_dec/></format> = slow down speed by half <format key><key speed_reset/></format> = normal speed x1 <format key><key speed_inc/></format> = increase speed twice <format key><key quicksave/></format> = quick save <format key><key quickload/></format> = quick load <format key><key quit/></format> = exits mission <button 11/>
cs: <format key><key speed_dec/></format> = zpomalit hru na polovinu <format key><key speed_reset/></format> = normální rychlost x1 <format key><key speed_inc/></format> = zdvojnásobit rychlost hry <format key><key quicksave/></format> = rychlé uložení <format key><key quickload/></format> = rychlé načtení <format key><key quit/></format> = ukončit misi <button 11/>
