Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter006/level002/po/*.po
Languages: cs

source: Spiral
cs: Spirála

source: Create a procedure in order to teach your bot to perform a spiral.
cs: Napište funkci, aby robot projel spirálovou dráhu.

source: Move
cs: Trasa

source: Exercise
cs: Cvičení

source: Function
cs: Funkce

source: You will have noticed that the way is made of "L"-shaped parts that are fit one into another. The first one (dark blue) measures two times 25 meters. The second one (light blue) measures 5 meters less. Let us start with writing the <a cbot|function>function</a> that will move the bot on a "L"-shaped part whose length will be given as a parameter:
cs: Jistě jste si všimli, že se trasa skládá ze segmentů ve tvaru "L" poskládaných do sebe. Rovné úseky prvního segmentu (tmavě modrý) měří 25 metrů. V druhém segmentu (světle modrý) měří o 5 metrů méně. Nejprve napíšeme <a cbot|function>funkci</a>, která robota pošle projet dráhu ve tvaru "L" s úseky zadané délky:

source: void object::Part(float length) { for ( int i=0 ; i<2 ; i=i+1 ) { move(length); turn(90); } }
cs: void object::Segment(float length) { for ( int i=0 ; i<2 ; i=i+1 ) { move(length); turn(90); } }

source: Now you just need to write the main function, that will call the function <code>Part</code>. At the beginning the variable <code>rest</code> will be set to 25m. The <code>while</code> loop will then repeat the instructions inside the block as long as <code>rest</code> is greater than zero. Inside the loop, first call the function <code>Part</code> (see above), then subtract 5m to the length of the L.
cs: Dále už zbývá jen napsat hlavní funkci, která bude volat funkci <code>Segment</code>. Na začátku se do proměnné <code>rest</code> uloží hodnota 25. Cyklus <code>while</code> pak bude příkazy uvnitř bloku opakovat, dokud proměnná <code>rest</code> bude větší než nula. Uvnitř cyklu nejprve zavolejte funkci <code>Segment</code> (viz výše), a pak odečtěte 5m z délky úseku.

source: extern void object::Function2( ) { float rest = 25; while ( rest > 0 ) { Part(rest); rest = rest-5; } }
cs: extern void object::Trasa( ) { float rest = 25; while ( rest > 0 ) { Segment(rest); rest = rest-5; } }

source: The function <code>Part</code> will be called a last time with the value <code>5</code>. Then the expression <code>rest-5</code> will set the value of the variable <code>rest</code> to zero, and the <code>while</code> loop will stop.
cs: Funkce <code>Segment</code> se bude naposledy volat s hodnotou <code>5</code>. Pak výraz <code>rest-5</code> sníží hodnotu proměnné <code>rest</code> na nulu a cyklus <code>while</code> skončí.

source: Remark
cs: Poznámky

source: You will have noticed that in the previous exercise, the main function was at the beginning of the program, whereas in this exercise, it is at the end of the program, after the function <code>Part</code>. The rank order of the functions in the program does not matter, you can write a program either way.
cs: Jistě jste si všimli, že v předchozím cvičení byla hlavní funkce na začátku programu, zatímco v tomto cvičení je až na konci za funkcí <code>Segment</code>. Na pořadí funkcí v programu nezáleží, fungovat budou obě možnosti.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Follow the way in form of a spiral. The bot must move 2 times 25m forward and turn, then move 2 times 20m forward and turn, and so on.
cs: Projeďte spirálovou dráhu. Robot musí dvakrát popojet 25m vpřed a zatočit, pak dvakrát 20m vpřed a zatočit, a tak dále.
