Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter003/level003/po/*.po
Languages: cs

source: Massacre
cs: Ohňostroj

source: Use a loop in order to destroy six targets.
cs: Zničte šest cílů pomocí cyklu.

source: Go
cs: Ohnostroj

source: Exercise
cs: Cvičení

source: Destroy the six <a object|bottarg>targets</a> with a program using a loop. The bot must move 5m forward to get from one target to the next.
cs: Zničte šest <a object|bottarg>cílů</a> pomocí programu s cyklem. Robot musí od jednoho cíle k dalšímu popojet vždy 5 metrů vpřed.

source: General principle
cs: Obecný postup

source: move 5m forward
cs: popojet 5m vpřed

source: turn 90 degrees left
cs: otočit o 90 stupňů vlevo

source: shoot
cs: vystřelit

source: turn 90 degrees right
cs: otočit o 90 stupňů vpravo

source: Instruction <code>for ( )</code>
cs: Příkaz <code>for ( )</code>

source: Initialize the counting variable.
cs: Inicializaci řídící proměnné cyklu.

source: The end <a cbot|cond>condition</a>.
cs: Koncovou <a cbot|cond>podmínku</a>.

source: The counting <a cbot|expr>expression</a>.
cs: <a cbot|expr>Výraz</a> na počítání běhů cyklu.

source: Here is the loop once it is integrated into the program frame:
cs: Zde je příklad cyklu vloženého do základu programu:

source: <c/>extern void object::Massacre( ) { for ( int i=0 ; i<6 ; i=i+1 ) { <n/>instructions repeated 6 times ...<c/> } }
cs: <c/>extern void object::Ohnostroj( ) { for ( int i=0 ; i<6 ; i=i+1 ) { <n/>příkazy, které se mají šestkrát opakovat...<c/> } }

source: ATTENTION: The line <code>for ( )</code> must not be followed by a <a cbot|term>semicolon</a> !
cs: POZOR: Na konci řádku za příkazem <code>for ( )</code> nesmí být <a cbot|term>středník</a>!

source: Explanation of the instruction <code>for ( )</code>
cs: Vysvětlení příkazu <code>for ( )</code>

source: The <a cbot|var>variable</a> i is set to zero before the beginning of the loop.
cs: Před začátkem cyklu se <a cbot|var>proměnná</a> "i" nastaví na nulu.

source: The loop will be executed as long as i is smaller than 6.
cs: Cyklus se bude opakovat, dokud bude proměnná "i" menší než 6.

source: At the end of every loop, add 1 to the variable i.
cs: Na konci každého opakování cyklus se k proměnné "i" přičte 1.

source: Blocks
cs: Bloky

source: Use braces <code>{ }</code> in order to create a <a cbot|bloc>block</a>. All the instructions that must be executed in the <code>for</code> loop are held together by a block. The whole program itself is made up of a block:
cs: Pomocí složených závorek <code>{ }</code> můžete vytvořit <a cbot|bloc>blok příkazů</a>. Příkazy, které se mají opakovat ve <code>for</code> cyklu, jsou uzavřené do bloku. I tělo samotného programu je uzavřené do bloku:

source: extern void object::massacre( ) { <n/>fill in here ...<c/> }
cs: extern void object::Ohnostroj( ) { <n/>sem pište příkazy...<c/> }

source: Never change these characters. Just add the instructions of the program between the braces. You can fit several blocks one into the other. For example the <code>for</code> block is fitted into the block of the whole program. In order to improve readability, the editor lines up the braces belonging to the different blocks.
cs: Tyto znaky nikdy nemažte. Pouze dopište příkazy svého programu mezi složené závorky. Můžete také zanořit více bloků do sebe. Například blok <code>for</code> cyklu je zanořený do bloku hlavního programu. Editor programu pro lepší čitelnost zarovnává složené závorky, které patří k sobě.

source: Remember
cs: Pamatujte

source: The instruction used to move forward is <c/><a cbot|move>move</a>();<n/>. The instruction used to turn the bot is <c/><a cbot|turn>turn</a>();<n/>. A positive angle turns left. The instruction used to fire the cannon is <c/><a cbot|fire>fire</a>(1);<n/>. A one-second burst allows to destroy all six <a object|bottarg>targets</a>.
cs: Příkaz pro jízdu vpřed je <c/><a cbot|move>move</a>();<n/>. Příkaz pro otočení robota je <c/><a cbot|turn>turn</a>();<n/>. Kladný úhel otáčí doleva. Příkaz pro výstřel z kanónu je <c/><a cbot|fire>fire</a>(1);<n/>. Dávka dlouhá jednu sekundu je na zničení všech šesti <a object|bottarg>cílů</a> tak akorát.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: The program must execute the following scheme: Repeat 6 times :
cs: Program musí provést následující plán: Opakovat šestkrát:

source: The instruction <code><a cbot|for>for</a></code> asks for 3 expressions:
cs: Příkaz <code><a cbot|for>for</a></code> vyžaduje 3 výrazy:
