Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter004/level005/po/*.po
Languages: cs

source: Shadow
cs: Ocásek

source: Follow a bot, as if you were its shadow.
cs: Jezděte za jiným robotem jako jeho ocásek.

source: Follow
cs: Ocasek

source: Exercise
cs: Cvičení

source: You must follow the <a object|bottr>target bot</a> with the explosive device, but without touching it, otherwise it will blow up. Every time the target bot stops, you must be close to it (less than 10m). After you managed to stay close to the target bot at 10 successive stops, it will lead you to the finishing pad, and the exercise is over. At every stop, the target bot checks that you are there. If you are not there, you must start over again.
cs: Držte se blízko <a object|bottarg>cvičného cíle</a> naloženého výbušninami, ale nesmíte se ho dotknout, jinak vybuchne. Pokaždé, když se cvičný cíl zastaví, musíte k němu být blíže než 10 metrů. Když s ním udržíte krok 10 zastávek po sobě, zavede Vás na cílovou značku a cvičení skončí. Cvičný cíl při každé zastávce kontroluje, kde jste. Pokud budete moc daleko, budete muset začít znovu od začátku.

source: General principle
cs: Obecný postup

source: Look for the target bot.
cs: Najít cvičný cíl.

source: Calculate the distance to the bot.
cs: Vypočítat vzdálenost k cíli.

source: if the distance to the target bot is less than 5m, move backward.
cs: Pokud je vzdálenost menší než 5m, zacouvat.

source: Otherwise, calculate the direction of the target bot, and move towards it.
cs: Jinak spočítat směrový úhel a popojet k cvičnému cíli.

source: As many times before, use <code><a cbot|while>while</a> (true)</code> in order to perform the infinite loop:
cs: Stejně jako mnohokrát předtím, použijte cyklus <code><a cbot|while>while</a> (true)</code> k vytvoření nekonečné smyčky:

source: <code>while (true) { </code>instructions to be repeated ...<c/> }
cs: <code>while (true) { </code>příkazy, které se mají opakovat...<c/> }

source: Look for the target bot with the instruction <code><a cbot|radar>radar</a></code>:
cs: Cvičný cíl najděte příkazem <code><a cbot|radar>radar</a></code>:

source: You do not have to test if the radar found a target bot: there must be one.
cs: Nemusíte kontrolovat, jestli radar něco našel, protože jeden cvičný cíl v tomto cvičení být musí.

source: Use the instruction <code><a cbot|dist>distance</a>( , )</code> to calculate the distance between two points. The first point will be the position of your own bot, given by <code>position</code>. The second point is the position of the target bot, given by <code>target.position</code>.
cs: Pro výpočet vzdálenosti mezi dvěma body použijte příkaz <code><a cbot|dist>distance</a>( , )</code>. První bod bude poloha vašeho robota daná výrazem <code>position</code>. Druhý bod bude poloha cvičného cíle daná výrazem <code>target.position</code>.

source: If the distance to the target bot is smaller than 5m, move backward with a speed inversely proportional to the distance: the closer you are to the bot, the faster you must move backward. Distance = 5.0 meters -> speed = 0.0 Distance = 2.5 meters -> speed = -0.5 Distance = 0.0 meters -> speed = -1.0 You can use the <a cbot|expr>expression</a> <code>distance/5-1</code> in order to achieve this, together with the <code><a cbot|if>if</a></code> to test if the target is closer than 5m:
cs: Pokud jste od cvičného cíle méně než 5m daleko, couvejte rychlostí nepřímo úměrnou vzdálenosti: čím blíže k němu jste, tím rychleji musíte couvat. Vzdálenost = 5.0 metrů -> výkon = 0.0 Vzdálenost = 2.5 metru -> výkon = -0.5 Vzdálenost = 0.0 metrů -> výkon = -1.0 Vhodný výkon motorů můžete vypočítat <a cbot|expr>výrazem</a> <code>distance/5-1</code> a vzdálenost od cvičného cíle kontrolujte příkazem <code><a cbot|if>if</a></code>:

source: <c/>if ( len < 5 ) // too close ? { motor(len/5-1, len/5-1); // moves backward }
cs: <c/>if ( len < 5 ) // moc blízko? { motor(len/5-1, len/5-1); // zacouvat }

source: If the distance to the target is greater than 5m, move towards the target. First calculate the angle necessary to face the target with the instruction <code><a cbot|direct>direction</a></code>. You can then adjust the speed of the right-hand and left-hand motor in order to follow the target:
cs: Pokud je vzdálenost od cvičného cíle větší než 5m, jeďte k němu. Nejprve příkazem <code><a cbot|direct>direction</a></code> spočítejte směrový úhel, o který se k němu musíte otočit. Pak můžete nastavit výkon motorů a vyjet k cíli:

source: <c/>else { dir = direction(target.position); if ( dir >= 0 ) // target on the left side? { motor(1-dir/90, 1); } else // target on the right side? { <n/>it is up to you to fill in<c/> } }
cs: <c/>else { dir = direction(target.position); if ( dir >= 0 ) // cíl je nalevo? { motor(1-dir/90, 1); } else // cíl je napravo? { <n/>zbytek dopište sami<c/> } }

source: When the target is on your left, <code>dir</code> takes a positive value, ranging between 0 and 180. The <a cbot|expr>expression</a> <code>1-dir/90</code> returns a speed ranging between 1 and -1, according to the direction: direction = 0 -> speed = 1.0 direction = 45 -> speed = 0.5 direction = 90 -> speed = 0.0 direction = 135 -> speed = -0.5 direction = 180 -> speed = -1.0
cs: Když bude cíl nalevo od robota, proměnná <code>dir</code> bude obsahovat kladnou hodnotu od 0 do 180. <a cbot|expr>Výraz</a> <code>1-dir/90</code> vrátí hodnotu výkonu od -1 do 1 v závislosti na směrovém úhlu: úhel = 0 -> výkon = 1.0 úhel = 45 -> výkon = 0.5 úhel = 90 -> výkon = 0.0 úhel = 135 -> výkon = -0.5 úhel = 180 -> výkon = -1.0

source: radar2
cs: radar2_cs

source: When the target is on the right side, <code>dir</code> is negative, ranging between 0 and -180.
cs: Když bude cíl napravo od robota, <code>dir</code> bude obsahovat zápornou hodnotu od 0 do -180.

source: The only task left for you now is to declare the <a cbot|var>variables</a> that you use in the program. <code>target</code> is of type <code>object</code>, whereas <code>dir</code> and <code>len</code> are of type <code>float</code>.
cs: Dále už musíte jen deklarovat <a cbot|var>proměnné</a>, které budete v programu používat. Proměnná <code>target</code> je typu <code>object</code>, zatímco proměnné <code>dir</code> a <code>len</code> jsou typu <code>float</code>.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Repeat forever :
cs: Opakovat stále dokola:
