Repository: badernageral/colobot-data
Catalog: levels/missions/chapter001/level002/po/*.po
Languages: cs

source: Building
cs: Budovy

source: Learn how to construct buildings.
cs: Naučte se stavět budovy.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: This is your second drill. <a object|human>You</a> should now familiarize yourself with the handling of basic equipment. This could turn out to be your best ally during the course of this expedition.
cs: Toto je <a object|human>Váš</a> druhý cvičný úkol. Musíte se seznámit s ovládáním základního vybavení. Během celé výpravy to může být Vaše nejdůležitější dovednost.

source: The construction of buildings and the manufacturing of bots all require the use of <a object|titan>titanium</a>. Titanium is a mineral found in most solar systems in the universe.
cs: Stavba budov i výroba robotů shodně vyžadují <a object|titan>titan</a>. Tento kov se vyskytuje ve většině planetárních soustav napříč vesmírem.

source: Procedure
cs: Postup

source: Position yourself close to the first <a object|titan>titanium cube</a>.
cs: Přesuňte se do blízkosti první <a object|titan>kostky titanu</a>.

source: Build a <a object|research>research center</a> <button 163/>. Note that only <a object|human>you</a> can accomplish the task of building; no bot can be substituted.
cs: Postavte <a object|research>výzkumnou stanici</a> <button 163/>. Pamatujte, že tuto akci můžete provést pouze <a object|human>Vy</a>; nemůže Vás zastoupit robot.

source: With a second <a object|titan>titanium cube</a>, build a <a object|factory>bot factory</a> <button 160/>.
cs: Z druhé <a object|titan>kostky titanu</a> postavte <a object|factory>továrnu na roboty</a> <button 160/>.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a>
cs: <a command>Ovládání</a>

source: Walkthrough
cs: Návod

source: Walk down the street that runs beside <a object|Huston>Mission Control</a>. You will find a <a object|titan>titanium cube</a> on the left hand side of the road, right after the <a object|botgr>grabber bot</a>.
cs: Jděte po silnici podél <a object|huston>řídícího střediska</a>. Po levé straně najdete <a object|titan>kostku titanu</a>, hned za <a object|botgr>pojízdným ramenem</a>.

source: Face the cube. Click on the first button at the bottom left of your screen: <button 163/> <build a <a object|research>research center</a>>.
cs: Otočte se k titanu. Klikněte na první tlačítko v levém dolním rohu obrazovky: <button 163/> Postavit <a object|research>výzkumnou stanici</a>.

source: Walk further down the road. The second cube is on the right past the four green <a object|power>power cells</a>.
cs: Jděte dále po silnici. Druhá kostka je hned za čtyřmi zelenými <a object|power>bateriemi</a>.

source: Repeat 1) but click on the second button: <button 160/> <build a <a object|factory>bot factory</a>>.
cs: Zopakujte krok 1), ale tentokrát klikněte na druhé tlačítko: <button 160/> Postavit <a object|factory>továrnu na roboty</a>.

source: As soon as both buildings are completed, the mission is at an end.
cs: Po dokončení obou budov mise úspěšně skončí.
