Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter004/level002/po/*.po
Languages: cs

source: Use the radar to find lots of stupid blue crosses.
cs: Hledejte pomocí radaru spoustu hloupých modrých křížků.

source: Find
cs: Hledac

source: Exercise
cs: Cvičení

source: Let the bot find all the <a object|waypoint>blue crosses</a> on the ground. As soon as the bot passed over one of the crosses, it will disappear. Here is the general principle that you will apply:
cs: Pošlete robota najít všechny <a object|waypoint>modré křížky</a> na zemi. Každý křížek zmizí, když přes něj robot přejede. Zde je obecný postup, jak úkol vyřešit:

source: Look for a cross
cs: Najít křížek.

source: If there is none, stop the program.
cs: Pokud žádný neexistuje, ukončit program.

source: Calculate the direction of the cross.
cs: Vypočítat směr ke křížku.

source: Set the speed of the motors in such a way that they will find their way to the cross.
cs: Nastavit výkon motorů, aby robot ke křížku postupně dojel.

source: The program
cs: Program

source: Use a <code><a cbot|while>while</a></code> loop in order to repeat several instructions over and over:
cs: Opakujte několik příkazů stále dokola pomocí cyklu <code><a cbot|while>while</a></code>:

source: <code>while ( true ) { </code>instructions...<c/> }
cs: <code>while ( true ) { </code>příkazy...<c/> }

source: The instruction <code><a cbot|radar>radar</a></code> will detect the blue crosses and put their description into a variable, for example <code>spot</code>. In this case, <code><a cbot|radar>radar</a>()</code> needs only one parameter, i.e. the category of the object that it must look for:
cs: Najděte modré křížky pomocí příkazu <code><a cbot|radar>radar</a></code> a uložte si jejich popis do proměnné, nazvěme ji například <code>spot</code>. V tomto případě potřebuje příkaz <code><a cbot|radar>radar</a>()</code> pouze jeden parametr, tj. kategorii objektu, který má hledat:

source: Once all the crosses have been found, <code>radar</code> will return the value <code><a cbot|null>null</a></code>. You will have to test this case and react accordingly with the instruction <code><a cbot|if>if</a></code>:
cs: Po nalezení posledního křížku vrátí příkaz <code>radar</code> hodnotu <code><a cbot|null>null</a></code>. Tuto možnost musíte vhodně ošetřit příkazem <code><a cbot|if>if</a></code>:

source: <c/>if ( spot == null ) // no more ? { motor(0, 0); // stops the motors break; // stops the loop }
cs: <c/>if ( spot == null ) // už žádné křížky? { motor(0, 0); // zastavit motory break; // ukončit cyklus }

source: <n/>The instruction <code><a cbot|break>break</a></code> will stop the infinite loop <code>while (true)</code>.
cs: <n/>Příkaz <code><a cbot|break>break</a></code> ukončí nekonečný cyklus <code>while (true)</code>.

source: Use the instruction <code><a cbot|direct>direction</a>()</code> to calculate the angle of the rotation that the bot must perform in order to turn towards the blue cross. The coordinates of the object are given by <code>spot.position</code>. The following line will put the angle of the necessary rotation into the <a cbot|var>variable</a> <code>dir</code>:
cs: Úhel, o který se robot musí otočit směrem ke křížku, vypočítejte příkazem <code><a cbot|direct>direction</a>()</code>. Polohu objektu udává výraz <code>spot.position</code>. Následující řádek uloží potřebný úhel do <a cbot|var>proměnné</a> <code>dir</code>:

source: The value of the angle is positive if the blue cross is on your left hand, and negative if it is on your right hand. If the cross to be reached is on your left hand, you must set the right-hand motor to full speed, and set the left-hand motor to a lower speed, according to the angle:
cs: Pokud bude modrý křížek nalevo od robota, úhel bude kladný, naopak pro křížek napravo bude záporný. Pokud je křížek nalevo od robota, musíte pravý motor spustit na plný výkon a levý motor na nižší výkon podle úhlu:

source: direction = <code> 0</code> -> speed = <code> 1.0</code> direction = <code> 45</code> -> speed = <code> 0.5</code> direction = <code> 90</code> -> speed = <code> 0.0</code> direction = <code>135</code> -> speed = <code>-0.5</code> direction = <code>180</code> -> speed = <code>-1.0</code>
cs: úhel = <code> 0</code> -> výkon = <code> 1.0</code> úhel = <code> 45</code> -> výkon = <code> 0.5</code> úhel = <code> 90</code> -> výkon = <code> 0.0</code> úhel = <code>135</code> -> výkon = <code>-0.5</code> úhel = <code>180</code> -> výkon = <code>-1.0</code>

source: The graphic below shows the speed of the left-hand and right-hand motor as set by the instruction <code><a cbot|motor>motor</a></code>, according to the angle:
cs: Obrázek níže ilustruje, jaký výkon jednotlivých motorů má příkaz <code><a cbot|motor>motor</a></code> nastavit v závislosti na úhlu:

source: radar2
cs: radar2_cs

source: If the cross is straight ahead, the angle is 0 degrees. The motors will get the speeds 1 and 1, which means full speed ahead. If the cross is behind, the right motor will be set to speed -1: it will turn around. You can use the <a cbot|expr>expression</a> <code>1+dir/90</code> in order to calculate the necessary speed of the motors:
cs: Pokud je křížek rovně před robotem, úhel bude 0 stupňů. Motorům se zadá výkon 1 a 1, což znamená plnou rychlostí vpřed. Pokud je křížek za robotem, pravému motoru se zadá výkon -1: robot se otočí. Vhodný výkon motorů můžete vypočítat <a cbot|expr>výrazem</a> <code>1+dir/90</code>:

source: <c/>if ( dir < 0 ) // on the right side? { motor(1, 1+dir/90); // turns more or less }
cs: <c/>if ( dir < 0 ) // je křížek napravo? { motor(1, 1+dir/90); // zatočit podle úhlu }

source: Use the same principle if the angle has got a positive value, ranging between 0 and 180 degrees. It is up to you to work out the exact instructions to be performed:
cs: Podobně postupujte, pokud je úhel kladný, v rozsahu od 0 do 180 stupňů. Vymyslet správné příkazy pro robota už je na Vás:

source: <code>else // on the left side? { </code>up to you to fill in here...<c/> }
cs: <code>else // je křížek nalevo? { </code>sem doplňte příkazy...<c/> }

source: At the beginning of the program, you must still declare all the variables. <code>spot</code> is of type <code><a cbot|object>object</a></code>, whereas <code>dir</code> is of type <code><a cbot|float>float</a></code>.
cs: Na začátku programu samozřejmě musíte deklarovat všechny proměnné. Proměnná <code>spot</code> musí mít typ <code><a cbot|object>object</a></code>, <code>dir</code> musí mít typ <code><a cbot|float>float</a></code>.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Repeat forever:
cs: Opakovat stále dokola:
