Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter003/level004/po/*.po
Languages: cs

source: Exchange posts 1
cs: Komunikační stanice 1

source: Collect valuable information from information exchange posts.
cs: Získejte z komunikačních stanic užitečné informace.

source: Exercise
cs: Cvičení

source: Several <a object|exchange>information exchange posts</a> stand in the middle of a <a object|mine>mine</a> field. When the bot is close enough to an exchange post, it can read the information that it contains. Every exchange post contains the angle of the rotation that must be performed in order to reach the next exchange post, without touching a <a object|mine>mine</a>. The exchange posts are distant 20m from each other.
cs: Uprostřed <a object|mine>minového pole</a> stojí několik <a object|exchange>komunikačních stanic</a>. Když robot přijede dost blízko ke komunikační stanici, může z ní číst uložené informace. Každá stanice řekne robotovi úhel, o který se musí otočit, aby bezpečně dojel k další stanici a nenajel při tom na <a object|mine>minu</a>. Komunikační stanice jsou od sebe vzdálené 20 metrů.

source: General principe
cs: Obecný postup

source: Move 20m forward.
cs: Popojet o 20m vpřed.

source: Read the direction of the next <a object|exchange>information exchange post</a>.
cs: Načíst směrový úhel k další <a object|exchange>komunikační stanici</a>.

source: Execute the necessary rotation.
cs: Otočit o daný úhel.

source: In order to repeat the steps above, use a <code><a cbot|for>for</a></code> loop, as we saw it before.
cs: Pro opakování výše uvedených kroků použijte <code><a cbot|for>for</a></code> cyklus jako v předchozím cvičení.

source: Move forward with the instruction <c/>move(20);<n/>.
cs: Popojeďte vpřed příkazem <c/>move(20);<n/>.

source: Use the instruction <c/><a cbot|receive>receive</a>("Direction");<n/> in order to read the information contained in the <a object|exchange>exchange post</a>. This is of course possible only when the bot is close enough to the exchange post. You will need a <a cbot|var>variable</a> to contain the value retrieved from the exchange post. Let us call it <code>dir</code>; you must declare it with the following line:
cs: Pro přečtení informace uložené v <a object|exchange>komunikační stanici</a> použijte příkaz <c/><a cbot|receive>receive</a>("Direction");<n/>. Ten samozřejmě bude fungovat jen když je robot ke stanici dostatečně blízko. Pro uložení hodnoty přečtené z komunikační stanice budete potřebovat <a cbot|var>proměnnou</a>. Nazvěme ji <code>dir</code> a musíte ji deklarovat následujícím řádkem:

source: Then retrieve the rotation angle from the exchange post, and put it into the variable:
cs: Pak přečtěte směrový úhel z komunikační stanice a uložte ho do proměnné:

source: Then you can execute the rotation:
cs: Pak můžete robota otočit:

source: Remark
cs: Poznámky

source: You can click on an <a object|exchange>information exchange post</a> in order to read what information it contains. In this exercise, every exchange post contains only one value called <code>"Direction"</code>, but it can contain up to 10 different values, as you will see in some of the following exercises.
cs: Když kliknete na <a object|exchange>komunikační stanici</a>, můžete se podívat, jaké informace obsahuje. Všechny stanice v tomto cvičení obsahují pouze jedinou hodnotu nazvanou <code>"Direction"</code>, ale mohou obsahovat až 10 různých hodnot, jak uvidíte v dalších cvičeních.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Repeat 5 times :
cs: Opakovat pětkrát:
