Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter003/level005/po/*.po
Languages: cs

source: Exchange posts 2
cs: Komunikační stanice 2

source: Collect more valuable information from information exchange posts.
cs: Získejte z komunikačních stanic více užitečných informací.

source: Exercise
cs: Cvičení

source: In this exercise, the <a object|exchange>information exchange posts</a> along the way contain the direction of the next post and the distance. And you do not know how many exchange posts you must get in touch with before arriving at your goal.
cs: <a object|exchange>Komunikační stanice</a> podél trasy v tomto cvičení obsahují směr a vzdálenost k další stanici. A předem nevíte, kolika komunikačních stanic se musíte dotázat na cestu k cíli.

source: General principle
cs: Obecný postup

source: Retrieve the direction from the <a object|exchange>exchange post</a>.
cs: Načíst směrový úhel z <a object|exchange>komunikační stanice</a>.

source: Retrieve the distance from the <a object|exchange>exchange post</a>.
cs: Načíst vzdálenost z <a object|exchange>komunikační stanice</a>.

source: If no information could be retrieved, stop the program.
cs: Pokud se informace nepodařilo načíst, ukončit program.

source: Execute the rotation.
cs: Otočit robota.

source: Move forward to the next post.
cs: Dojet k další stanici.

source: In order to repeat always, use a <code><a cbot|while>while</a> (true)</code> loop. The instructions between the braces <code>{ }</code> will be repeated over and over, or until a <code><a cbot|break>break</a></code> instruction is executed.
cs: Pro neomezené opakování příkazů použijte cyklus <code><a cbot|while>while</a> (true)</code>. Příkazy mezi složenými závorkami <code>{ }</code> se budou opakovat donekonečna, nebo dokud cyklus neukončí příkaz <code><a cbot|break>break</a></code>.

source: This time you need 2 <a cbot|var>variables</a>, one for the rotation angle, one for the distance, for example <code>dir</code> and <code>len</code> :
cs: Tentokrát potřebujete dvě <a cbot|var>proměnné</a>, jednu pro směrový úhel, druhou pro vzdálenost. Například <code>dir</code> a <code>len</code>:

source: Then you can retrieve the information:
cs: Pak můžete načíst informace:

source: A variable of the <a cbot|type>type</a> <code><a cbot|float>float</a></code> can take a special value called <code><a cbot|nan>nan</a></code>. This value means that the variable contains no number (Not A Number). When there is no <a object|exchange>exchange post</a> nearby, either because the bot has reached the goal, or because it took the wrong way, the two variables <code>dir</code> and <code>len</code> contain this value. You can test this with the instruction <code><a cbot|if>if</a></code>, and stop the program if necessary with the instruction <code><a cbot|break>break</a></code>:
cs: Proměnná <a cbot|type>typu</a> <code><a cbot|float>float</a></code> může obsahovat speciální hodnotu nazvanou <code><a cbot|nan>nan</a></code>. Tato hodnota znamená, že proměnná neobsahuje žádné číslo (Not A Number). Když v dosahu nebude žádná <a object|exchange>komunikační stanice</a>, buď protože robot dorazil do cíle, nebo protože jel špatným směrem, obě proměnné <code>dir</code> i <code>len</code> budou obsahovat právě tuto hodnotu. To můžete zkontrolovat příkazem <code><a cbot|if>if</a></code> a případně ukončit cyklus příkazem <code><a cbot|break>break</a></code>:

source: If the information retrieval from the <a object|exchange>exchange post</a> has been performed successfully, execute the rotation:
cs: Pokud bylo načtení informací z <a object|exchange>komunikační stanice</a> úspěšné, otočte robota:

source: And move forward:
cs: A popojeďte vpřed:

source: Remark
cs: Poznámky

source: You can click on an <a object|exchange>information exchange post</a> in order to read what information it contains. In this exercise, every exchange post contains two values called <code>"Direction"</code> and <code>"Length"</code>.
cs: Když kliknete na <a object|exchange>komunikační stanici</a>, můžete se podívat, jaké informace obsahuje. Všechny komunikační stanice v tomto cvičení obsahují dvě hodnoty nazvané <code>"Direction"</code> a <code>"Length"</code>.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: Repeat forever:
cs: Neustále opakovat:
