Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter002/level001/po/*.po
Languages: cs

source: Barrage Fire
cs: Rozptýlená palba

source: Set the power of the different motors in order to achieve a barrage fire.
cs: Ovládejte motory robota přímo, abyste mohli pokropit palbou širší okolí.

source: Move
cs: Kropitko

source: Objective
cs: Úkol

source: As a defense against several giant ants attacking from the north, rotate the bot when shooting in order to perform barrage fire.
cs: Ze severu se blíží roj obřích mravenců. Otáčejte robotem během palby, abyste je všechny pokropili.

source: When you are radio-guiding a bot, you can rotate the cannon during the burst in order to sweep a whole zone. You can also do this when programming the bot, but you have to turn the whole bot with the instruction <code><a cbot|motor>motor</a>( , )</code>. This instruction asks for two numbers: the speed of the left-hand motor, and the speed of the right-hand motor. These numbers must range between -1 and +1.<c/> motor(1,1);<n/> moves the bot forward with maximum speed (both motors at full power).<c/> motor(-1,-1);<n/> moves the bot backward with maximum speed.<c/> motor(1,0.9);<n/> moves the bot forward with a slight turn to the right: the left-hand motor turns a little faster than the right-hand motor. And <c/>motor(1,-1);<n/> will turn the bot clockwise on the spot: the left-hand motor moves forward, the right-hand motor moves backward.
cs: Když robota ovládáte ručně, můžete během palby otáčet kanónem, abyste pokropili větší oblast. Totéž můžete udělat i v programu, ale v tom případě musíte otáčet celého robota příkazem <code><a cbot|motor>motor</a>( , )</code>. Tento příkaz vyžaduje dvě čísla: rychlost levého motoru a rychlost pravého motoru. Obě čísla musejí být v rozsahu -1 až +1. <c/>motor(1,1);<n/> rozjede robota kupředu plnou rychlostí (oba motory na plný výkon). <c/>motor(-1,-1);<n/> rozjede robota vzad plnou rychlostí. <c/>motor(1,0.9);<n/> rozjede robota vpřed a bude mírně točit doprava: levý motor běží trochu rychleji než pravý. A <c/>motor(1,-1);<n/> bude robota otáčet na místě po směru hodinových ručiček: levý motor běží vpřed, pravý motor vzad.

source: After a <a cbot|motor>motor</a> instruction the motors will keep this speed until the next <code>motor</code>, <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code> or <code><a cbot|goto>goto</a></code> instruction. For example, if you perform a rotation on the spot with <c/>motor(1,-1);<n/> and afterward you shoot with <c/>fire(1);<n/>, the bot will continue to turn during the burst, and will sweep a whole zone.
cs: Po příkazu <a cbot|motor>motor</a> poběží motory dál danou rychlostí až do dalšího zavolání příkazu <code>motor</code>, <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code> nebo <code><a cbot|goto>goto</a></code>. Například pokud robota začnete otáčet příkazem <c/>motor(1,-1);<n/>, a pak začnete střílet příkazem <c/>fire(1);<n/>, robot se bude otáčet dál během palby a pokropí celé okolí.

source: rotate clockwise with <c/>motor(1,-1);<n/>
cs: začněte otáčet po směru hodinových ručiček příkazem <c/> motor(1,-1);<n/>

source: a 2 seconds burst with <c/>fire(2);<n/>
cs: vystřelte dvousekundovou dávku příkazem <c/>fire(2);<n/>

source: rotate counter-clockwise with <c/>motor(-1,1);<n/>
cs: začněte otáčet proti směru hodinových ručiček příkazem <c/> motor(-1,1);<n/>

source: a 2 seconds burst.
cs: vystřelte další dvousekundovou dávku.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: The ants attack from the north. In order to sweep the whole zone north of the bot, first turn 90 degrees left with <c/>turn(90);<n/>, then repeat always with <code><a cbot|while>while</a> (true)</code> the following instructions:
cs: Mravenci útočí ze severu. Abyste pokropili celou oblast na sever od robota, nejprve se otočte o 90 stupňů vlevo příkazem <c/>turn(90);<n/> a pak cyklem <code><a cbot|while>while</a> (true)</code> opakujte následující příkazy:
