Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter001/level001/po/*.po
Languages: cs

source: Spiders 1
cs: Pavouci 1

source: Kill three spiders with a small program.
cs: Zlikvidujte tři pavouky pomocí krátkého prográmku.

source: Spider1
cs: Pavouk1

source: Objective
cs: Úkol

source: Write a small program to kill three spiders.
cs: Napište krátký program na likvidaci tří pavouků.

source: Procedure
cs: Postup

source: In order to program the bot, select it.
cs: Vyberte robota, abyste mu mohli zadat program.

source: The numbers 1 to 4 corresponding to the programs contained in the bot appear on the lower left-hand corner of your screen. Select the first line.
cs: V levém dolním rohu obrazovky uvidíte čísla 1 až 4 odpovídající programům, které má robot načtené. Vyberte první řádek.

source: Click the button with the braces <button 22/>, and you will arrive in an editor where you can write the program.
cs: Klikněte na tlačítko se složenými závorkami <button 22/> a otevře se editor, ve kterém můžete psát programy.

source: While you are writing the program, the key <format key><key help/></format> will display the text you are reading right now. When you have finished writing the program, click the "OK" button.
cs: Během psaní programu si můžete znovu přečíst tento text stisknutím klávesy <format key><key help/></format>. Až dopíšete program, klikněte na tlačítko "OK".

source: In order to execute the program, click the arrow button <button 21/>.
cs: Pro spuštění programu klikněte na tlačítko se šipkou <button 21/>.

source: You must tell the bot exactly step by step what it must do in order to kill the three spiders. The bot understands only precise instructions, which it will execute one after another.
cs: Robotovi musíte říct přesně krok za krokem, co musí udělat, aby ty tři pavouky zlikvidoval. Robot rozumí pouze jasným příkazům a bude je vykonávat jeden po druhém.

source: When you click the braces button <button 22/> in order to write the program, a part of the program will already be there:
cs: Až kliknete na tlačítko se složenými závorkami <button 22/>, abyste začali psát program, část programu už tam najdete připravenou:

source: extern void object::Spider1( ) { <n/>write your program here ...<c/> }
cs: extern void object::Pavouk1( ) { <n/>sem napište svůj program...<c/> }

source: Everything that is already written when you arrive in the editor must not be altered. Just introduce the necessary instructions at the cursor.
cs: Předepsaný kód nijak neupravujte. Pouze přidejte další příkazy na konec.

source: You will need the following instructions:
cs: Budete potřebovat následující příkazy:

source: <n/>Puts the cannon straight.
cs: <n/>Namíří kanón rovně před sebe.

source: <n/>Executes a rotation of a certain angle, given in brackets in degrees. For example <c/>turn(90);<n/> will turn the bot 90 degrees to the left, i.e. a quarter turn to the left. <c/>turn(-90);<n/> will turn the bot 90 degrees to the right (quarter turn right). Positive values turn left, negative values turn right. <c/>turn(180);<n/> will make the bot face in the opposite direction.
cs: Otočí robota o úhel zadaný v závorkách (ve stupních). Například <c/>turn(90);<n/> otočí robota o 90 stupňů doleva, tj. půlobrat doleva. <c/>turn(-90);<n/> otočí robota o 90 stupňů doprava (půlobrat doprava). Kladné hodnoty otáčejí doleva, záporné doprava. <c/>turn(180);<n/> otočí robota čelem vzad.

source: <n/>Shoots the cannon. The number in brackets indicates the duration of the burst. In most cases, shoot a burst of 1 second.
cs: <n/>Vystřelí z kanónu. Číslo v závorkách určuje dobu střelby. Ve většině případů střílejte dávku dlouhou 1 sekundu.

source: put the cannon straight with <c/>aim(0);<n/>
cs: namiřte kanón rovně příkazem <c/>aim(0);<n/>

source: shoot the spider straight ahead with <c/>fire(1);<n/>
cs: zlikvidujte pavouka přímo před sebou příkazem <c/>fire(1);<n/>

source: turn 90 degrees left with <code>turn(90)</code>
cs: otočte o 90 stupňů doleva příkazem <code>turn(90)</code>

source: shoot with <c/>fire(1);<n/>
cs: vystřelte příkazem <c/>fire(1);<n/>

source: etc.
cs: atd.

source: Here is the program that does all this :
cs: Zde je program, který provede výše popsané:

source: extern void object::Spider1( ) { aim(0); fire(1); turn(90); fire(1); }
cs: extern void object::Pavouk1( ) { aim(0); fire(1); turn(90); fire(1); }

source: It is up to you now to write the rest of the program!
cs: Dopsat zbytek programu už je na Vás!

source: If you have got a problem, you can always look at the solution: select the <code>Solution</code> program on the lower left-hand corner of the screen, and click the braces button <button 22/>. You can even execute the solution program with the arrow button <button 21/>.
cs: Pokud se Vám nedaří, můžete se kdykoliv podívat na řešení: vyberte program <code>Řešení</code> v levém dolním rohu obrazovky a klikněte na tlačítko se složenými závorkami <button 22/>. Vzorové řešení navíc můžete spustit tlačítkem se šipkou <button 21/>.

source: Remarks
cs: Poznámky

source: Be careful to write the instructions precisely, respecting lower and upper case letters.
cs: Dávejte pozor, abyste příkazy psali přesně a správně. Dodržujte i velká a malá písmena.

source: Always write one instruction per line, finishing each line with a semicolon.
cs: Na každý řádek pište jen jeden příkaz a zakončete ho středníkem.

source: In case your program does not do exactly what you wanted, you can put the bot back at the starting point with the <button 59/> button. You can also start over again from the beginning (hit the "Esc" key, then click "Restart"). The program you have written will not be lost.
cs: Pokud Váš program dělá něco jiného, než jste chtěli, můžete robota vrátit na startovní pozici tlačítkem <button 59/>. Dále můžete cvičení spustit úplně od začátku (stiskněte klávesu "Esc" a klikněte na "Restartovat"). O svůj program tím nepřijdete.

source: <format key><key help/></format> allows you to review these instructions at all times.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst klávesou <format key><key help/></format>.

source: Let us see the beginning of the program:
cs: Podívejme se na základ programu:
