Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter003/level002/po/*.po
Languages: cs

source: Follow with variables
cs: Jízda po trase s proměnnými

source: Use variables in order to store the parameters of the path.
cs: Uložte si vlastnosti trasy do proměnných.

source: Move
cs: Trasa2

source: Exercise
cs: Cvičení

source: This exercise is very similar to the previous one. The bot must move exactly in the same way, but when writing the program, you must use a new concept that is extremely important in programming: <a cbot|var>variables</a>. We saw that all the pads are at a distance form each other of 20 meters. And all the rotations performed consist in 90 degree angles. Instead of rewriting the same values over and over again in the program, we can store them in a variable:
cs: Toto cvičení je velmi podobné jako to předchozí. Robot musí projet naprosto stejnou trasu, ale tentokrát musíte při psaní programu použít nový koncept, který je v programování zcela nezbytný: <a cbot|var>proměnné</a>. Už jsme si řekli, že jednotlivé kontrolní body jsou od sebe vzdálené 20 metrů a každá zatáčka je o 90 stupňů. Abyste tato čísla v programu nemuseli opisovat pořád dokola, můžete si je uložit do proměnné:

source: Instead of: <c/><s/> move(20);
cs: Místo: <c/><s/> move(20);

source: We write : <c/><s/> dist = 20;
cs: Můžete napsat: <c/><s/> dist = 20;

source: Variables
cs: Proměnné

source: The name,
cs: Názvu,

source: The type of the content,
cs: Datového typu,

source: The content.
cs: Obsahu.

source: The name
cs: Název

source: Use the name to refer to a variable. For example, instead of writing <c/>move(20);<n/>, write <c/>move(dist);<n/>: "dist" is the name of the variable. You can choose almost any name for a variable, for example <code>dist</code>, <code>dir</code>, <code>p2</code>, <code>a</code>, <code>x</code>, <code>nothing_2_grab</code>, etc.
cs: Na proměnnou se odkazuje pomocí jejího názvu. Například místo <c/>move(20);<n/> můžete napsat <c/>move(dist);<n/>, kde "dist" je název proměnné. Proměnnou můžete nazvat v podstatě libovolně, například <code>dist</code>, <code>dir</code>, <code>p2</code>, <code>a</code>, <code>x</code>, <code>neni_co_sebrat</code>, atd.

source: The type
cs: Datový typ

source: <code><a cbot|int>int</a></code> for a whole number (12, -500, etc.)
cs: <code><a cbot|int>int</a></code> pro celá čísla (12, -500, atd.)

source: <code><a cbot|float>float</a></code> for a real number (3.14, 0.2, -99.98, etc.)
cs: <code><a cbot|float>float</a></code> pro reálná čísla (3.14, 0.2, -99.98, atd.)

source: <code><a cbot|string>string</a></code> for a character string ("Hello!", "Nothing to grab", etc.)
cs: <code><a cbot|string>string</a></code> pro textové řetězce ("Ahoj!", "Neni co sebrat", atd.)

source: <code><a cbot|point>point</a></code> for the x,y,z-coordinates of a point in space
cs: <code><a cbot|point>point</a></code> pro souřadnice bodu v prostoru (x, y, z)

source: <code><a cbot|object>object</a></code> for the information about an object (bot, building, etc.)
cs: <code><a cbot|object>object</a></code> pro informace o objektu (robot, budova, atd.)

source: The content
cs: Obsah

source: The content of a variable can be a number, a string, coordinates, etc., according to the type of the variable. The content of a variable can change many times during the execution of a program.
cs: Obsah proměnné může být číslo, řetězec, souřadnice, atd., záleží na typu proměnné. Obsah proměnné můžete za běhu programu libovolně měnit.

source: Before you can use a variable, you have to declare it. For example, before you can use the two variables <code>dist</code> and <code>dir</code>, you must declare them with the following lines:
cs: Před použitím proměnné ji musíte deklarovat. Například před použitím proměnných <code>dist</code> a <code>dir</code> je musíte deklarovat takto:

source: Now you can use the two variables. To put the value 20 into <code>dist</code> and 90 into <code>dir</code>, write:
cs: Teď můžete obě proměnné začít používat. Abyste uložili hodnotu 20 do proměnné <code>dist</code> a 90 do proměnné <code>dir</code>, napište:

source: Now you can move and turn the bot with the instructions <code><a cbot|move>move</a></code> and <code><a cbot|turn>turn</code></a>:
cs: A teď už můžete robota řídit pomocí příkazů <code><a cbot|move>move</a></code> a <code><a cbot|turn>turn</a></code> i takto:

source: You can also use a whole <a cbot|expr>mathematical expression</a> instead of just the variable:
cs: Místo pouhé proměnné můžete použít i složitější <a cbot|expr>matematický výraz</a>:

source: The latter instruction will be needed to turn the bot right.
cs: Ten poslední příkaz bude třeba na otáčení robota doprava.

source: Now, rewrite the program of the previous exercise, but use a variable for the distance and another variable for the angle of the rotation.
cs: Teď napište stejný program jako v předchozím cvičení, ale pro zadání vzdálenosti a úhlu otočení použijte proměnné.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.

source: A <a cbot|var>variable</a> is composed of three elements:
cs: <a cbot|var>Proměnná</a> se skládá ze tří prvků:

source: The type of a variable determines what kind of information the variable can contain. According to the type, a variable can contain a whole number, a real number, a character string, the coordinates of a point, etc. Here is a list with the most common variable types:
cs: Datový typ proměnné určuje, jaký druh informací do ní lze uložit. V závislosti na datovém typu může proměnná obsahovat celé číslo, reálné číslo, textový řetězec, souřadnice bodu, atd. Zde je seznam nejběžnějších datových typů:
