Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter003/level001/po/*.po
Languages: cs

source: Follow a path
cs: Jízda po zadané trase

source: Move the bot along a given path.
cs: Projeďte s robotem po zadané trase.

source: Move
cs: Trasa

source: Exercise
cs: Cvičení

source: Program the robot in such a way that it arrives on the finishing pad, after having passed by the three blue crosses.
cs: Naprogramujte robota, aby projel přes tři modré kříže a zastavil na cílové značce.

source: Procedure
cs: Postup

source: Take the power cell and put it on the rear of the bot.
cs: Zvedněte baterii a položte ji do zdířky v zadní části robota.

source: Walk around on reconnaissance to understand what the bot must do.
cs: Projděte se po okolí, abyste měli přehled, kudy má robot jet.

source: Program the bot. To do so, you must select it, and then click on the braces button <button 22/>; you will get into the program editor.
cs: Naprogramujte robota. Musíte ho vybrat, a pak kliknutím na tlačítko se složenými závorkami <button 22/> otevřete editor programu.

source: Once you finished writing the program, click "OK", and execute the program with the arrow key <button 21/>.
cs: Až dopíšete program, klikněte na "OK" a spusťte ho kliknutím na tlačítko se šipkou <button 21/>.

source: The pads are at a distance of 20 meters from each other. The instruction <c/>move(20);<n/> moves 20 meters forward. The instruction <c/>turn(90);<n/> turns left with an angle of 90 degrees. The instruction <c/>turn(-90);<n/> turns right with an angle of 90 degrees.
cs: Kontrolní body jsou od sebe vzdálené 20 metrů. Příkaz <c/>move(20);<n/> říká robotovi, aby popojel 20 metrů vpřed. Příkaz <c/>turn(90);<n/> otočí robota o 90 stupňů vlevo. Příkaz <c/>turn(-90);<n/> otočí robota o 90 stupňů vpravo.

source: The frame of the program consists in:
cs: Základ prázdného programu vypadá takto:

source: extern void object::MoveBot( ) { <n/>\\write the necessary instructions here ...<c/> }
cs: extern void object::Trasa( ) { <n/>// veškeré příkazy napište sem...<c/> }

source: For now, you must not change the frame of the program. Just insert the instructions you need to move the bot around between the braces <code>{ }</code>.
cs: Hlavičku programu nijak neupravujte. Pouze dopište příkazy pro ovládání robota mezi složené závorky <code>{ }</code>.

source: Attention
cs: Pozor

source: Be very careful about upper case and lower case letters! Every instruction must be terminated with a semicolon.
cs: Dávejte pozor na velká a malá písmena! Každý příkaz musíte ukončit středníkem.

source: Helpful trick
cs: Užitečný trik

source: When you write the program, you can watch the scene by clicking on the button <Reduce> <button 51/>, and by moving the mouse to the edges of the window to turn the camera.
cs: Během psaní programu můžete kliknout na tlačítko Minimalizovat <button 51/> a prohlédnout si okolí. Kameru můžete otáčet najetím myší na kraj obrazovky.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
