Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter006/level003/po/*.po
Languages: cs

source: Remote control #2
cs: Dálkové ovládání #2

source: Remote control a robot using an information exchange post, so it will pass over the 6 blue waypoints.
cs: Ovládejte robota na dálku prostřednictvím komunikační stanice, aby projel přes 6 modrých kontrolních bodů.

source: remote
cs: Ovladac

source: Exercise
cs: Cvičení

source: Remote control a robot using an <a object|exchange>information exchange post</a>, so it will pass over the 6 blue waypoints. The main actors of this exercise are:
cs: Ovládejte robota na dálku prostřednictvím <a object|exchange>komunikační stanice</a>, aby projel přes 6 modrých kontrolních bodů. Hlavní role v tomto cvičení hrají:

source: A <a object|botgr>wheeled grabber</a> robot without an energy cell. This is the master you have to program.
cs: <a object|botgr>Pojízdné rameno</a> bez baterie. To je velitel, kterého budete programovat.

source: An <a object|exchange>information exchange post</a> that receives information from the master and then transmits it to the slave.
cs: <a object|exchange>Komunikační stanice</a>, která přijme informace od odesílatele a pošle je příjemci.

source: A <a object|bottr>practice bot</a> which waits for orders from the exchange post. This robot has already been programmed.
cs: <a object|bottr>Cvičný robot</a>, který čeká na povely od komunikační stanice. Tento robot už je naprogramovaný.

source: tremot2a
cs: tremot2a_cs

source: An information exchange post stores "name/value" couples. To control the "slave" robot we use two couples:
cs: Do komunikační stanice lze ukládat informace v podobě dvojice "název-hodnota". K ovládání "dělníka" budeme potřebovat dvě takové dvojice:

source: name="order", value=order number
cs: název="order", hodnota=číslo povelu

source: nom="param", valuer=parameter for the operation
cs: název="param", hodnota=parametr pro daný povel

source: Order #1 means "move" and order #2 means "turn". The parameter is the distance to move or the turning angle. For example to make the slave move 20 meters write: <c/><s/> <a cbot|send>send</a>("order", 1, 100); // order "move"
cs: Povel #1 znamená "move" a povel #2 znamená "turn". Parametr je pak délka jízdy v metrech nebo úhel otočení. Například aby dělník popojel o 20 metrů, napište: <c/><s/> <a cbot|send>send</a>("order", 1, 100); // příkaz "move"

source: <a cbot|send>send</a>("param", 20, 100); // distance 20 meters
cs: <a cbot|send>send</a>("param", 20, 100); // vzdálenost 20 metrů

source: These two instruction send following 2 pieces of information to the exchange post: <c/> order=1 param=20
cs: Výše uvedené příkazy pošlou komunikační stanici dvě informace: <c/> order=1 param=20

source: The slave robot waits for an order and executes it. Once the order has been executed by the slave, it removes the order from the exchange post. Once an order has been sent, the master must wait for the slave finishing the order before sending the next order. This is done by testing if the order is still inside the exchange post. Just write: <c/><s/> while ( <a cbot|testinfo>testinfo</a>("order", 100) ) // wait for end of work
cs: Dělník čeká na povel, a pak ho vykoná. Po splnění povelu ho dělník z komunikační stanice vymaže. Než velitel pošle další povel, musí čekat, až dělník splní ten předchozí. Musíte tedy kontrolovat, jestli je v komunikační stanici stále nějaký povel uložený. Jednoduše napište: <c/><s/> while ( <a cbot|testinfo>testinfo</a>("order", 100) ) // čekat na splnění povelu

source: As we must give more than one order its most convenient to write a <a cbot|function>function</a> <code>SendToPost</code>, that sends the order and wait for its completion: <c/><s/>void object::SendToPost(float order, float param)
cs: Protože budeme posílat několik povelů za sebou, hodilo by se na to napsat <a cbot|function>funkci</a> <code>SendToPost</code>, která odešle povel a počká na jeho splnění: <c/><s/>void object::SendToPost(float order, float param)

source: { send("param", param, 100); // send the parameter send("order", order, 100); // send the order while ( testinfo("order", 100) ) // wait for end of work { wait(1); } }
cs: { send("param", param, 100); // odeslat parametr send("order", order, 100); // odeslat povel while ( testinfo("order", 100) ) // čekat na splnění povelu { wait(1); } }

source: To move forward by 20 meters, you must write in the main program: <c/><s/> SendToPost(1, 20); // move(20);
cs: Když má pak dělník popojet o 20 metrů, napište v hlavním programu: <c/><s/> SendToPost(1, 20); // move(20);

source: This is the route the robot must travel through:
cs: Zde je trasa, kterou musí dělník projet:

source: It's up to you to finish the programming.
cs: Dopsat zbytek programu už je na Vás.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
