Repository: badernageral/colobot-data
Catalog: levels/missions/chapter001/level003/po/*.po
Languages: cs

source: Departure
cs: Odlet

source: Equip your spaceship and get ready for takeoff.
cs: Naložte vybavení do rakety a připravte se k odletu.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: Your <a object|base>spaceship</a> is now standing on the launching pad, ready for takeoff.
cs: Vaše <a object|base>raketa</a> už čeká na startovní ploše připravená k odletu.

source: The last drill left for <a object|human>you</a> to perform before embarking on your journey is to equip your spaceship with its <a object|bbox>black box</a>. The only way to reach the <a object|bbox>black box</a> is by a steep path that can only be climbed by a <a object|botgc>tracked grabber</a> which you need to build.
cs: <a object|human>Vaše</a> poslední cvičení před zahájením výpravy je vybavit raketu <a object|bbox>černou skříňkou</a>. Jediná cesta k <a object|bbox>černé skříňce</a> vede po příkrém svahu, který vyjede pouze <a object|botgc>pásové rameno</a>. To si musíte vyrobit.

source: Unfortunately your <a object|factory>bot factory</a> hasn't yet got the capacity to assemble this type of bot. You need to request your <a object|research>research center</a> to come up with a blueprint for this particular propeller.
cs: Bohužel, Vaše <a object|factory>továrna na roboty</a> zatím nedokáže tento typ robota vyrábět. Nejprve musíte zadat <a object|research>výzkumné stanici</a> příkaz, aby vytvořila výrobní plány pro tento druh pohonu.

source: Procedure
cs: Postup

source: Power the research center with one of the green <a object|power>power cells</a>.
cs: Vložte jednu zelenou <a object|power>baterii</a> do výzkumné stanice.

source: Click on the <tracked bot research program> button <button 64/>.
cs: Klikněte na tlačítko Spustit výzkum pásových robotů <button 64/>.

source: Drop a <a object|titan>titanium cube</a> in the center of the <a object|factory>bot factory</a> and build a <a object|botgc>tracked grabber</a>.
cs: Doprostřed <a object|factory>továrny na roboty</a> položte <a object|titan>kostku titanu</a> a vyrobte <a object|botgc>pásové rameno</a>.

source: Power and radio-control the <a object|botgc>tracked grabber</a> to the top of the southwest-oriented mountain.
cs: Do zdířky <a object|botgc>pásového ramena</a> vložte baterii a dojeďte s ním na vrchol hory na jihozápadě.

source: Bring the black box back aboard your spaceship.
cs: Na palubu rakety přivezte černou skříňku.

source: Don't forget to take the <a object|botgr>wheeled grabber</a> along. These bots may prove very useful in the future.
cs: Nezapomeňte naložit i <a object|botgr>pojízdné rameno</a>. Tito roboti se Vám v budoucnu mohou hodit.

source: Climb aboard the <a object|base>spaceship</a>.
cs: Nastupte do <a object|base>rakety</a>.

source: Select the <a object|base>spaceship</a> and take off <button 28/>.
cs: Vyberte <a object|base>raketu</a> a odleťte <button 28/>.

source: Please note: To work more efficiently, you can use the <a object|botgr>wheeled grabber</a>.
cs: Pamatujte: <a object|botgr>Pojízdné rameno</a> Vám může usnadnit práci.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a>
cs: <a command>Ovládání</a>

source: Walkthrough
cs: Návod

source: Before taking off, you need to bring the following aboard your spaceship:
cs: Před odletem musíte do rakety naložit:

source: <a object|bbox>Black box</a>.
cs: <a object|bbox>Černou skříňku</a>.

source: <a object|botgr>Wheeled</a> and <a object|botgc>tracked</a> grabbers.
cs: <a object|botgr>Pojízdné</a> a <a object|botgc>pásové</a> rameno.

source: <a object|human>Yourself</a>.
cs: <a object|human>Sebe</a>.

source: Power the <a object|research>research center</a> with one of the green <a object|power>power cells</a>.
cs: Vložte jednu zelenou <a object|power>baterii</a> do <a object|research>výzkumné stanice</a>.

source: Activate the <a object|research>research center</a> then click on the <button 64/> <tracked bot research program> button.
cs: Vyberte <a object|research>výzkumnou stanici</a> a klikněte na tlačítko <button 64/> Spustit výzkum pásových robotů.

source: Place a <a object|titan>titanium cube</a> inside the <a object|factory>bot factory</a>.
cs: Do <a object|factory>továrny na roboty</a> položte <a object|titan>kostku titanu</a>.

source: Step back out and activate the <a object|factory>bot factory</a>.
cs: Ustupte ven a vyberte <a object|factory>továrnu na roboty</a>.

source: Click on the <button 138/> <build a <a object|botgc>tracked grabber</a>> button.
cs: Klikněte na tlačítko <button 138/> Vyrobit pásové rameno.

source: Power the <a object|botgc>tracked grabber</a> with a brand new <a object|power>power cell</a>.
cs: Do zdířky <a object|botgc>pásového ramena</a> vložte nabitou baterii.

source: Radio-control the <a object|botgc>tracked grabber</a> to the top of the mountain in the south-west.
cs: Dojeďte s <a object|botgc>pásovým ramenem</a> na vrchol hory na jihozápadě.

source: Bring the <a object|bbox>black box</a> back aboard your <a object|base>spaceship</a>.
cs: Na palubu <a object|base>rakety</a> přivezte <a object|bbox>černou skříňku</a>.

source: Radio-control both the <a object|botgc>tracked</a> and the <a object|botgr>wheeled</a> grabbers onto the platform.
cs: Dojeďte s <a object|botgc>pásovým</a> i <a object|botgr>pojízdným</a> ramenem na palubu rakety.

source: 10) Climb aboard the <a object|base>spaceship</a> yourself. 11) Take off!
cs: 10) Sami nastupte na palubu <a object|base>rakety</a>. 11) Odlet!

source: In order to take off, select the <a object|base>spaceship</a>, provided that it is visible, by clicking on it. If it is not visible, you need to click one of the buttons in the upper left corner of your screen. The blue triangle <button 130/> allows you to alternate between symbols for bots and symbols for buildings. Click once to shift to the <buildings> list. A <button 171/> <spaceship> symbol will now appear. Click on the button to select it.
cs: Abyste odletěli, nejprve klikněte na <a object|base>raketu</a>, pokud ji vidíte na obrazovce. Pokud ji nevidíte, můžete ji vybrat kliknutím na jedno z tlačítek v levém horním rohu obrazovky. Tlačítko s trojúhelníkem <button 130/> přepíná mezi tlačítky robotů a budov. Klikněte na něj, abyste přepnuli na seznam budov. Objeví se tlačítko se symbolem rakety <button 171/>, na které klikněte.

source: Once the spaceship is selected, click on the larger <button 28/> <takeoff> button in the lower center of your screen. If the objects mentioned above as well as yourself are indeed standing on deck, takeoff will take place.
cs: Když máte raketu vybranou, klikněte uprostřed dolní části obrazovky na velké tlačítko <button 28/> Odlet. Pokud budete na palubě spolu s výše uvedenými objekty, raketa odletí.

source: No object or bot should hinder the closing of the eight large panel doors.
cs: Žádný robot ani objekt při tom nesmí překážet na osmi velkých nájezdových rampách, aby se mohly uzavřít.

source: Here is a detailed breakdown of the operations:
cs: Zde je podrobný seznam nutných kroků:
