Repository: badernageral/colobot-data
Catalog: levels/exercises/chapter002/level003/po/*.po
Languages: cs

source: Flying Tower 2
cs: Létající věž 2

source: Program a flying tower that wastes less energy.
cs: Naprogramujte létající obrannou věž, která nebude tolik plýtvat energií.

source: Move
cs: Obrana2

source: Objective
cs: Úkol

source: Adapt the program <code>Tower1</code> in order to avoid wasting energy when shooting at ants that are out of range.
cs: Upravte program <code>Obrana1</code>, aby zbytečně neplýtval energií palbou na mravence mimo dostřel.

source: The program <code>Tower1</code> shoots in the direction of the closest ant, even if it is still out of range:
cs: Program <code>Obrana1</code> střílí na nejbližšího mravence, i když je mimo dostřel:

source: extern void object::Tour1() { object item; jet(0.2); while(position.z < 20) { wait(0.2); } jet(0); while(true) { item = radar(AlienAnt); turn(direction(item.position)); fire(1); } }
cs: extern void object::Obrana1() { object item; jet(0.2); while(position.z < 20) { wait(0.2); } jet(0); while(true) { item = radar(AlienAnt); turn(direction(item.position)); fire(1); } }

source: If the bot must perform the same task than before with only a <a object|power>regular power cell</a>, you can insert a loop that waits until the ant is close enough, i.e. until the ant is at less than 40 meters. Only one burst will be needed for every ant then.
cs: Tentokrát musí robot splnit stejný úkol pouze s <a object|power>obyčejnou baterií</a>. Musíte tedy přidat cyklus, který bude čekat, až se mravenec dostatečně přiblíží, t.j. dokud nebude blíže než 40 metrů. Pak bude na každého mravence stačit jediná dávka.

source: You can give the instruction <code><a cbot|radar()>radar</a></code> more parameters (numbers) indicating where the radar should look for the ants. For example <c/>radar(AlienAnt,0,360,0,40);<n/> will only look for ants that are closer than 40 meters. The two first numbers tell the radar to search in all directions, the two last numbers tell the radar to detect only ants that are at a distance between 0 and 40 meters. If no ant is found that is closer than 40 meters, the instruction <code><a cbot|radar()>radar</a></code> returns the value <code>null</code>. We can then write a conditional loop similar to the one written in the last exercise that waits as long as there is no ant closer than 40 meters:
cs: Příkazu <code><a cbot|radar>radar</a>()</code> můžete zadat více parametrů (čísel) vymezujících, kde má radar hledat mravence. Například <c/>radar(AlienAnt,0,360,0,40);<n/> bude hledat mravence pouze do vzdálenosti 40 metrů. První dvě čísla říkají radaru, aby hledal ve všech směrech, další dvě čísla říkají, aby hledal pouze mravence ve vzdálenosti od 0 do 40 metrů. Pokud žádný mravenec není blíže než 40 metrů, příkaz <code><a cbot|radar>radar</a>()</code> vrátí hodnotu <code>null</code>. Můžeme tedy podobně jako v předchozím cvičení napsat cyklus, který bude čekat, dokud se některý mravenec nepřiblíží na méně než 40 metrů:

source: Notice that two equal signs "==" are needed to perform a comparison of equality.
cs: Všimněte si, že porovnání na rovnost se zapisuje dvěma rovnítky za sebou: "=="

source: Just insert these lines before the instruction <c/>fire(0);<n/>, and the bot will wait before shooting until the ant is closer than 40 meters. Like this a regular power cell is enough to kill all ants.
cs: Jednoduše vložte výše uvedený kód před příkaz <c/>fire(1);<n/> a robot bude před výstřelem čekat, až se mravenec přiblíží na méně než 40 metrů. Pak bude na likvidaci mravenců stačit i obyčejná baterie.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
